{
  "data": [
    {
      "offset_start": "0:00:00.000",
      "offset_end": "0:02:20.300",
      "text": "אוקיי, אז שלום לכולם, נתחיל בחזרה קצרה לשיעור הקודם, ונמשיך משם. אוקיי? אז היה לנו, דיברנו בעצם על קבוצות, כאוסף של איברים, דיברנו בעצם על קבוצות, ‫כאוסף של איברים. ‫דיברנו בעצם על שייכות. ‫אז האיבר מופיע בקבוצה. ‫אז זה סימן של שייך. ‫דיברנו על הכלה בין קבוצות. ‫אז הסימון הוא A מוכל ב-B, ‫אז זה קצת היה מבלבל, ‫אני יודע לחלק מהאנשים ‫שיש שם את השווה שם, ‫הוא אמור בעצם, זה איזשהו סימון ‫של ההגדדרה בעצם אומרת שכל איבר ב-A נמצא גם ב-B, ואנחנו יכולים לרשום את זה בצורה מקוצרת גם, כן? אז אם A שייך ל-A, אז A שייך ל-B, ואנחנו רושמים את זה גם, כן, בצורה מתמטית כזאת, אז יש לנו x שייך ל-a, ואז סימן כזה שקוראים לו סימן גרירה, שזה חץ כפול שאומר x שייך ל-a, אם x שייך ל-a, אז x שייך ל-b, אז זה כתיב מקוצר בעצם לאים אז.‫אוקיי? ‫עכשיו, אם אנחנו מסתכלים ‫על הדיאגרמת ון של קבוצות, ‫אז יש לנו בעצם את הקבוצה A ‫מוכלת בקבוצה B, ‫אבל זה לא פורסם את הרעיון ‫שבעצם A ו-B יכולות להיות גם שוות אחת לשנייה, ‫והן עדיין תהיה החלה של a ו b. אז או... a ו b או שוות אחת על השנייה. אוקיי, a שווה ל-b.",
      "lang": "he",
      "type": "audio",
      "ref": "https://photos.google.com/share/AF1QipMdzNUoZi6u47DCo9m8T1GKIgoLntNoD44EtTCrjDLVHq3w6AsRVSlZhoqLtLinhQ/photo/AF1QipPi8ROw1FZ5r_C4N8gzXmkZDEr-oVQKkZBHdYYp?key=NXBaX0JQZWM4Z251cU1LT09GdWxVa3k5UmozTVR3"
    },
    {
      "offset_start": "0:02:22.600",
      "offset_end": "0:04:26.700",
      "text": "סעולי, אם יש לי שאלה מהמבחן? מהמבחן? מהבוחן. אה, מהבוחן. בואו נעשה את זה אחרי השיעור, כי אין לנו הרבה זמן בהרצאות עצמן. בסדר? אין בעיה. אוקיי, אז אנחנו נראה עוד היום הרבה דוגמאות, ו... אז ככה, אז רציתי להתחיל בעצם את השיעור במין שני תרגילונים, אוקיי? שהם תרגילים תיאורטיים, ואנחנו בעצם, מכיר דרכם בעצם שתי שיטות מתמטיות מאוד סטנדרטיות, אז בעצם יש לנו את המשפט, אוקיי? משפט ראשון, אז אם A מוכל ב-B וגם B מוכל ב-C, אז A מוכל ב-C. עכשיו, מבחינת ציור של הדיאגרמות בין זה אמור להיות די ברור, נכון? יש לנו A מוכל ב-B, מוכל ב-C, אז זה ברור ש-A מוכל בקבוצה הגדולה יותר אבל כמובן שזאת לא הוכחה, אנחנו לא יכולים להשתמש בציורים בתור הוכחות למשפטים עכשיו מה זה משפט? משפט זה איזושהי טענה שאנחנו אומרים אותה שהיא נכונה תמיד, אוקיי? לא משנה איזה שלוש קבוצות אנחנו לוקחים A, B ו-C, זה חייב להתקיים. שאם A מוכל ב-B וגם B מוכל ב-C, אז A מוכל ב-C. עכשיו, איך מוכיחים בעצם טענות עם אז? אז אם יש לי טענת אם פי אז קיו, ‫איך אני מוכיח אותה? ‫על ידי הנחת פי, ‫בעצם אנחנו מניחים ש-P מתקיים,",
      "lang": "he",
      "type": "audio",
      "ref": "https://photos.google.com/share/AF1QipMdzNUoZi6u47DCo9m8T1GKIgoLntNoD44EtTCrjDLVHq3w6AsRVSlZhoqLtLinhQ/photo/AF1QipPi8ROw1FZ5r_C4N8gzXmkZDEr-oVQKkZBHdYYp?key=NXBaX0JQZWM4Z251cU1LT09GdWxVa3k5UmozTVR3"
    },
    {
      "offset_start": "0:04:31.200",
      "offset_end": "0:06:08.500",
      "text": "בואו נחשב מרגע כאן, מניחים ש-P מתקיים ומראים ש-Q מתקיים. האם שלי במקרה הזה זה כל הדבר הזה? אני מניח שאם A מוכל ב-B וגם B מוכל ב-C, אני צריך להראות שבכך A מוכל ב-C. אז אנחנו נניח ש-A מוכל ב-B וגם B מוכל ב-C. שזה בעצם הציור שאנחנו רואים בצד שמאל של העמוד. אני רוצה להוכיח עכשיו, צריך להוכיח, זה בקיצור צריך להוכיח, שמתקיים... למה זה לא מובן מאליו, אם זה הנתון? אז אנחנו נראה נניח בתרגיל הבא שדברים שאנחנו חושבים שאולי הם מובנים מאליהם, הם לא מובנים מאליהם, כלומר, יכול להיות שיש לך משהו שהוא נראה מאוד מאוד הגיוני, אבל הוא פשוט לא נכון. אוקיי, במקרה הזה הוא במקרה נכון, אבל עדיין צריך לכתוב את ההוכחה שלו. אז זה משהו שמלווה אותנותמיד במתמטיקה, ‫כאילו איזה מין דיפוח כזה בין ‫עד כמה פורמליים אנחנו צריכים להיות. ‫במקרה הזה אנחנו מתחילים ‫בצעדים מאוד קטנים, ‫מה שנקרא baby steps, אוקיי? ‫אז אנחנו מתחילים מאיזושהי טענה ‫שהיא יחסית ברורה, אוקיי? ‫כמו שאתה אומר, ‫אבל אנחנו נמשיך לטענות אחרות ‫שאולי הן נראה שהן ברורות, ‫אבל לא בטוח שהן ברורות בכלל, אוקיי? ויכול להיות שהן לא נכונות אפילו.",
      "lang": "he",
      "type": "audio",
      "ref": "https://photos.google.com/share/AF1QipMdzNUoZi6u47DCo9m8T1GKIgoLntNoD44EtTCrjDLVHq3w6AsRVSlZhoqLtLinhQ/photo/AF1QipPi8ROw1FZ5r_C4N8gzXmkZDEr-oVQKkZBHdYYp?key=NXBaX0JQZWM4Z251cU1LT09GdWxVa3k5UmozTVR3"
    },
    {
      "offset_start": "0:06:08.500",
      "offset_end": "0:07:41.400",
      "text": "יכול להיות שיש כל מיני מקרי קצה שבגללם הטענה שלך היא לא נכונה. מה שאנחנו משתמשים עכשיו זה בעצם בכלים מלוגיקה, אוקיי? שזה בעצם שיטות שפותחו על ידי היוונים ‫לפני 2,500 שנה בערך, ‫ובעזרתם הם בעצם משכנעים, ‫בן אדם א' מנסה לשכנע את בן אדם ב' ‫בנכונות של משהו, של איזושהי טענה. ‫וזה לאו דווקא קשור למתמטיקה, ‫זה בצורה כללית, ‫איך בן אדם א' צריך לשכנע ‫את בן אדם ב' שמשהו הוא נכון. ‫אז אני מניח שהא מתקיים, ‫אני צריך להוכיח שאז מתקיים. ‫אז אני צריך להוכיח במקרה הזה ‫שמתקיים שאי מוכל ב-C, ‫שהקבוצה הקטנה מוכלת ‫בקבוצה הגדולה ביותר שם. ‫מה זה אומר? זה אומר שצריך להראות ‫שכל איבר ב-A נמצא גם ב-C. ‫אז אנחנו נעשה את זה ככה, ‫אז יהי, שזו מילה יפה כזאת מתמטית לאהיה, או נניח ש... יהי x שייך ל-a. אוקיי? אז x הוא שייך ל-a, מה זה עוזר לי? איך אני יודע שהוא שייך ל-c? מה שאני כן יודע, אני יכול להשתמש בעצם בהנחות שלי שהתחלתי איתן, אני הנחתי ש-a מוכל ב-b. אם x שייך ל-a, מה זה אומר על x? שייך ל-b ושייך ל-c. כן, אז כיוון ש-a מוכל ב-b, נקבל x שייך ל-b, נכון?",
      "lang": "he",
      "type": "audio",
      "ref": "https://photos.google.com/share/AF1QipMdzNUoZi6u47DCo9m8T1GKIgoLntNoD44EtTCrjDLVHq3w6AsRVSlZhoqLtLinhQ/photo/AF1QipPi8ROw1FZ5r_C4N8gzXmkZDEr-oVQKkZBHdYYp?key=NXBaX0JQZWM4Z251cU1LT09GdWxVa3k5UmozTVR3"
    },
    {
      "offset_start": "0:07:41.400",
      "offset_end": "0:09:40.440",
      "text": "אז יש לנו עכשיו x שייך ל-B, וכיוון ש-B מוכל ב-C, נקבל X שייך ב-C, אוקיי? אז מה שעשיתי זה עקבתי אחרי בעצם הנתונים שלי וההנחות שלי כדי להגיע למסקנה נדרשת. התחלתי מאיזשהו איבר מצד שמאל, שהוא נמצא בעצם כאן, אחרי זה הראיתי שהוא נמצא כאן, בצד ימין, כלומר ב-B, ואז השתמשתי בהכלה הזאת כדי להראות שהוא גם שייך לצד ימין, שזה C, ולכן A מוכן D ב-B. שאלה? כן. הוא בעצם רק שייך לו, הוא לא, C לא מכיל את A, נכון? אז C, X שייך ל-C, אבל אנחנו, בעצם מה ההבדל בין החלה לשייכות? שייכות זה שהאיבר נמצא ברשימה, החלה זה שכלרשימה הראשונה מוכלת ברשימה השנייה. ‫אוקיי? מה שהראיתי זה שכל איבר ‫ששייך ל-A שייך גם ל-C. ‫אוקיי? ולכן A מוכלת ב-C, ‫כי כל איבר ברשימה של A ‫נמצא גם ברשימה של C. ‫בסדר? ‫עכשיו, בואו נעבור עכשיו, אז בעצם, למשל, מה זה אומר? זה אומר מה שצריך להוכיח, סיימנו את ההוכחה בעצם, כי זה אומר בעצם ש-A מוכל ב-C אוקיי, היינו יש עוד שאלות? ‫בואו נעבור לתרגיל אחר, ‫שהוא תרגיל שבו אנחנו ‫רושמים איזושהי טענה, ‫ואנחנו לא יודעים ‫אם היא נכונה או לא נכונה, ‫אז אנחנו כותבים, ‫הוכחו, הפרחו, הוכיחו, הפריחו,",
      "lang": "he",
      "type": "audio",
      "ref": "https://photos.google.com/share/AF1QipMdzNUoZi6u47DCo9m8T1GKIgoLntNoD44EtTCrjDLVHq3w6AsRVSlZhoqLtLinhQ/photo/AF1QipPi8ROw1FZ5r_C4N8gzXmkZDEr-oVQKkZBHdYYp?key=NXBaX0JQZWM4Z251cU1LT09GdWxVa3k5UmozTVR3"
    },
    {
      "offset_start": "0:09:46.120",
      "offset_end": "0:11:28.680",
      "text": "‫אם אתם רוצים להיות... ‫לא לציין את המין במקרה הזה, ‫אז זוכיחו או הפריחו את הטענה הבאה. ‫אוקיי? ‫אם A שייך ל-B, ‫וגם B שייך ל-C, אז A שייך ל-C. אז מה אנחנו צריכים לעשות כאן? אנחנו בעצם צריכים או, אנחנו צריכים להחליט האם הטענה היא נכונה או לא נכונה. אם הטענה היא נכונה, אנחנו צריכים להוכיח, רשום כאן הוכיח עובד או אם הטענה היא לא נכונה, אנחנו צריכים להפריך אותה, מה זה אומר להפריך אותה? זה להראות שקיים איזשהו אינסטנס, איזושהי דוגמה ספציפית שעבורה זה לא מתקיים אוקיי, האם לדעתכם הטענה הזאת היא טענה נכונה או לא נכונה? נכונה,נה נכונה ‫או לא נכונה? ‫נכונה. ‫-לא נכונה. ‫אז אנחנו... מישהו אמר ‫שהטענה היא נכונה? ‫אני. ‫אוקיי, אז למה אתה חושב ‫שהטענה היא נכונה? ‫כי A שייך ל-B. ‫-נכון. ‫וגם B שייך ל-C. אוקיי, אז A מופיע ברשימה B, ו-B מופיע כאיבר ברשימה C, אוקיי? זה כבר, אין לנו את הציור הזה שמצויר כאן, אוקיי? זה שונה לגמרי. בסדר? אז מה שאנחנו יכולים, אם כבר אנחנו מציירים את זה, אז אנחנו נקבל איזשהו ציור כזה די מעוות. ‫אז קודם כול יש לנו את הקבוצה B, ‫ו-A מופיע בה בתור איבר,",
      "lang": "he",
      "type": "audio",
      "ref": "https://photos.google.com/share/AF1QipMdzNUoZi6u47DCo9m8T1GKIgoLntNoD44EtTCrjDLVHq3w6AsRVSlZhoqLtLinhQ/photo/AF1QipPi8ROw1FZ5r_C4N8gzXmkZDEr-oVQKkZBHdYYp?key=NXBaX0JQZWM4Z251cU1LT09GdWxVa3k5UmozTVR3"
    },
    {
      "offset_start": "0:11:31.320",
      "offset_end": "0:13:32.760",
      "text": "‫בתור נקודה בקבוצה הזאת, אוקיי? ‫ו-B מופיע בתור נקודה בקבוצה C, ‫אז יש לנו את הקבוצה C, ‫ויש לנו כאן נקודה שהיא הקבוצה B. ‫אז זה כבר נראה לנו חשוד, כאילו, ‫זה לא נראה הגיוני כל כך ‫שבהכרח A יש A אחלסי. בואו נראה דוגמה לזה, אוקיי? נפריך את זה על ידי נכון... זה כאיבר, אבל הוא עדיין נמצא בפנים. אבל הוא לא מופיע כאיבר ברשימה, בואו נפריך את זה ונראה באמת למה זה לא נכון. מישהו יכול לתת לי דוגמה של... כן. שהאים מתקיים, אבל האז לא מתקיים? כן. כן, במידה ואיי הוא, נגיד, הכי גדול. סתם, כאילו, במידה וראי הוא נגיד הכי גדול, סתם, כאילו נגיד,ושהי דוגמה ספציפית שבה משהו מתקיים, אז אני חושב שאנחנו יכולים ממש להתחיל עם הדברים הכי הכי בסיסיים. אני אצייר את ה-X כאילו בתוך ה-B, בתוך השטח של ה-B. כן, אבל תן לי ממש דוגמה, תן לי דוגמה, זאת אומרת תן לי ממש קבוצות ו... אוקיי, בנאחד. אז אני פשוט יכול לקחת את a להיות שווה פשוט לאיבר נניח 1, אוקיי? אני יכול גם לתת דוגמה שa היא קבוצה, אבל זה לא חייב להיות. אוקיי? ואנחנו יודעים שנניח 1 שייך לקבוצה הזאת. אוקיי? עכשיו, לאיזה קבוצה שייך את ה...",
      "lang": "he",
      "type": "audio",
      "ref": "https://photos.google.com/share/AF1QipMdzNUoZi6u47DCo9m8T1GKIgoLntNoD44EtTCrjDLVHq3w6AsRVSlZhoqLtLinhQ/photo/AF1QipPi8ROw1FZ5r_C4N8gzXmkZDEr-oVQKkZBHdYYp?key=NXBaX0JQZWM4Z251cU1LT09GdWxVa3k5UmozTVR3"
    },
    {
      "offset_start": "0:13:32.800",
      "offset_end": "0:14:24.520",
      "text": "לאיזה קבוצה שייך האיבר הזה בעצם? אוקיי? תנו לי דוגמה של קבוצה שהדבר הזה מופיע בבתור איבר. C. B. קבוצה עם קבוצה של אחד. אוקיי, זו קבוצה עם קבוצה של אחד. אוקיי, זו קבוצה... קבוצה של בי. שבי מופיע בה בתור איבר, נכון? זה בי. כן. אוקיי? האם A שייך ל-C? לא. לא. לא. אז רואים ש-A לא שייך ל-C. למה הוא לא שייך ל-C? כי הוא לא מופיע בו בתור איבר. אוקיי? אחד לא מופיעA לא שייך ל-C. ‫למה הוא לא שייך ל-C? ‫כי הוא לא מופיע בו בתור איבר, אוקיי? ‫ח' לא מופיע בתור איבר ב-C. ‫אז יש לנו A שייך ל-B ‫ויש לנו B שייך ל-C, ‫אבל A לא שייך ל-C. ‫אתה יכול להגיד ש-A מוכל בתוך C? ‫-לא, כי A הוא מבוצע.",
      "lang": "he",
      "type": "audio",
      "ref": "https://photos.google.com/share/AF1QipMdzNUoZi6u47DCo9m8T1GKIgoLntNoD44EtTCrjDLVHq3w6AsRVSlZhoqLtLinhQ/photo/AF1QipPi8ROw1FZ5r_C4N8gzXmkZDEr-oVQKkZBHdYYp?key=NXBaX0JQZWM4Z251cU1LT09GdWxVa3k5UmozTVR3"
    },
    {
      "offset_start": "0:14:36.000",
      "offset_end": "0:15:43.040",
      "text": "‫אוקיי? אין לנו אוכלה חלב... אבל כן מוכל בתוך B. A גם לא מוכל בתוך B, כי הוא לא קבוצה, אוקיי? A לא מוכל בשום דבר, הוא עבר, בסדר? ו-B כן מוכל, או שזה עדיין לא משהו קבוצה? השאלה היא B מוכל איפה? ב-C. B צייך ב-C, אבל הוא לא מוכל ב-C. מה? אני אמרתי שזה קצת, סליחה, קנדל שבע. דבר, דבר. אמרת שזה קצת מבלבל? זה קצת מבלבל, כי A, אמרת אותיות לטיניות עםוגמאים, נכון, אבל תשים לב. זה הבלבול, אני אומר. זה מקיים את התנאי, אבל אתה יכול, כאילו, אני חושב שאתה טועה בבלבול שלך, כי... כי בעצם אתה יכול לתת דוגמה שבה A, B ו C הם קבוצות. לא, אני מסתכל על הציור השני שלך. אני רגשתי לך לתת דוגמה כש-A ו-B הם קבוצות, זה יותר ברור. הבלבול הוא כש-A הוא לא קבוצה. אוקיי, אבל... אבל הם אמרו להשים לב לזה בגלל הסוגריים. אוקיי, אתה רואה אבל שנתתי בקלות מאוד דוגמה שב-A, B ו-C הם קבוצות, נכון? זה ברור. אוקיי. ובציור העליון B לא קבוצה? כן היא קבוצה, אבל A לא.",
      "lang": "he",
      "type": "audio",
      "ref": "https://photos.google.com/share/AF1QipMdzNUoZi6u47DCo9m8T1GKIgoLntNoD44EtTCrjDLVHq3w6AsRVSlZhoqLtLinhQ/photo/AF1QipPi8ROw1FZ5r_C4N8gzXmkZDEr-oVQKkZBHdYYp?key=NXBaX0JQZWM4Z251cU1LT09GdWxVa3k5UmozTVR3"
    },
    {
      "offset_start": "0:15:43.360",
      "offset_end": "0:17:36.640",
      "text": "B היא קבוצה, אבל היא איבר בת סין, נכון? כן. אוקיי. אז למי שזה עדיין מבלבל אותו, תחזרו לכל הדוגמאות האלה של הביטלס, קבוצות כדורגל וכך הלאה. ג'ון הוא עבר בביטלס, ביטלס הוא עבר בלהקות רוק של שנות ה-60אבל ג'ון הוא לא עבר בקבוצות להקות רוק של שנות ה-60, בסדר? ‫אז זה בערך הרעיון של התרגילים שלנו. ‫זו הייתה קצת חזרה בעצם ‫על מה ההבדל בין שייכות להחלה וכך הלאה. ‫אוקיי. ‫-ס? כן. שאלה, בשביל להפריח, זה מספיק דוגמה? אז לא רק שזה מספיק, אלא זו הדרך ה עכשיו, לפעמים טענה מנוסחת, ‫ככה נניח, שקיים משהו, ‫וכדי להפריך את זה בעצם, ‫אז חייבים להוכיח איזושהי טענה ‫שלא קיים, ‫ואז אי אפשר להפריך את זה ‫על ידי דוגמה נגדית, ‫אלא ממש צריך להראות ‫שזה לא קיים, ‫לא קיים את דוגמה ‫שמקיימת את הטענה. ‫אבל אנחנו סליחים לשים כאן ‫יותר מדי לפינות. ‫בואו נמשיך הלאה ואנחנו נראה ‫את זה באמת בדוגמאות בהמשך. ‫יש עוד שאלות עד כאן? ‫אוקיי. ‫אז סיימת השיעור הקודם בזה ‫שהתחלנו לדבר על פעולות על קבוצות. ‫מה זה אומר פעולות על קבוצות? ‫זה שאנחנו לוקחים שתי קבוצות ‫ואנחנו מייצרים מהן קבוצות חדשות. ‫אז היה לנו חיתוך.",
      "lang": "he",
      "type": "audio",
      "ref": "https://photos.google.com/share/AF1QipMdzNUoZi6u47DCo9m8T1GKIgoLntNoD44EtTCrjDLVHq3w6AsRVSlZhoqLtLinhQ/photo/AF1QipPi8ROw1FZ5r_C4N8gzXmkZDEr-oVQKkZBHdYYp?key=NXBaX0JQZWM4Z251cU1LT09GdWxVa3k5UmozTVR3"
    },
    {
      "offset_start": "0:17:39.520",
      "offset_end": "0:19:48.640",
      "text": "‫אז סימנו את זה ככה, A חיתוך B. ‫זה כל האיברים x, כך שx שייך ל-a וגם x שייך ל-b. עכשיו, יש לזה גם לזה סימון מקוצר, אנחנו יכולים לרשום את זה בצורה כזאתי x שייך ל-a, וגם, שזה מין סימן כזה של וגם לוגי, x שייך ל-b, אוקיי? זה פשוט כל מיני סימונים מתמטיים כדי שאנחנו נוכל לכתוב שורה שלמה או כמה שורות בלי בכלל להשתמש בעברית, אוקיי? אז אנחנו ממש לומדים שפה עכשיו, ‫סימני פיסוק וכך הלאה. ‫עכשיו, אנחנו הראנו שבעצם, ‫אם יש לנו את הדיאגרמה תוון של A ו-B, ‫אז מה זה החיתוך שלהם? ‫שטח המשותף. ‫-זה השטח המשותף, זה השטח המשותף, זה A חיתוך B עכשיו, אנחנו יכולים גם לרשום את זה בעצם בעזרת, יש לנו טבלה שאומרת לנו בעצם, קוראים לזה טבלת אמת או טבלת שייכות, שעוזרת לנו להבין מתי איבר שייך לחיתוך, אז אנחנו מרשמים את זה בצורה כזאת, אז יש לנו a, b, a חיתוך b, אנחנו שואלים בעצם מתי x שייך לאחד מהקבוצות האלה. אז אנחנו רושמים בהתחלה את כל האפשרויות האפשריות, אוקיי? אז... או שאיקס, אבל אנחנו רושמים את זה על ידי איף, אף ותי, כמו פולס וטרו, אוקיי? אז אם איבר לא שייך ‫לאף אחד מהאיברים, ‫מהקבוצות בעצם A ו-B,",
      "lang": "he",
      "type": "audio",
      "ref": "https://photos.google.com/share/AF1QipMdzNUoZi6u47DCo9m8T1GKIgoLntNoD44EtTCrjDLVHq3w6AsRVSlZhoqLtLinhQ/photo/AF1QipPi8ROw1FZ5r_C4N8gzXmkZDEr-oVQKkZBHdYYp?key=NXBaX0JQZWM4Z251cU1LT09GdWxVa3k5UmozTVR3"
    },
    {
      "offset_start": "0:19:49.040",
      "offset_end": "0:21:40.720",
      "text": "‫אז האם הוא יכול להיות שייך ‫לחיתוך ביניהם? ‫לא. ‫-התשובה היא לא, ‫ולכן אנחנו רושמים גם כאן פולס. ‫אנחנו רושמים את כל הצירופים ‫האפשריים של A ו-B, ‫ועבור כל אחד מהם אנחנו רושמים ‫את ערך האמת של החיתוך, אוקיי? האם x שייך לחיתוך. אז אם x שייך ל-b אבל לא שייך ל-a, האם הוא שייך לחיתוך? לא, גם לא. גם בשורה הבאה זה יהיה לא. ומה היה לגבי השורה האחרונה? כן. יש תשובה? בינארית כזאת? אז זה ממש טבלה בינארית, אנחנו יכולים לרשום אפסים ואחדים במקום F ו-T, אוקיי? אז זה בעצם גם טבלה לוגית, אנחנו... אתם תראו את זה בקורס לוגיקה שתיקחו בסמסטר הבא או... בשנה הבאה אתם תראו באמת שאנחנו... זאת בעצם טבלה הלוגית של וגם, אוקיי? אז אנחנו צריכים ששני התנאים יתקיימו כדי שהתנאי השלישי יתקיים. אוקיי. עכשיו אנחנו נראה את איכות, שזו הפעולה השנייה שלנו. אז זה כל האיקסים, כך שאיקס שייך לאי, או איקס שייך לבי. עכשיו, הבעיה היא שהאו הזה הוא מבלבל כאן, זה לא א רגיל, זה א לוגי, ‫שהוא קצת מוזר, ‫אנחנו נראה את זה לפי הטבלת אמת שלו. ‫אנחנו צריכים להבין אותו בצורה הבאה.",
      "lang": "he",
      "type": "audio",
      "ref": "https://photos.google.com/share/AF1QipMdzNUoZi6u47DCo9m8T1GKIgoLntNoD44EtTCrjDLVHq3w6AsRVSlZhoqLtLinhQ/photo/AF1QipPi8ROw1FZ5r_C4N8gzXmkZDEr-oVQKkZBHdYYp?key=NXBaX0JQZWM4Z251cU1LT09GdWxVa3k5UmozTVR3"
    },
    {
      "offset_start": "0:21:48.520",
      "offset_end": "0:23:26.100",
      "text": "‫זה איקס שייך ל-א, או איקס שייך ל-ב, ‫אb, או x שייך לשניהם, אוקיי? אז זה לא בעצם כמו שאנחנו מדברים בשפת הרחוב, אנחנו לא אומרים כאילו a או b, אז אתה צריך לבחור באמת בין a או b, אתה צריך לבחור בין גלידת טילון וניל או טילון שוקו. אתה לא יכול לבחור את שניהם, אם יש לך כסף נניח רק לטילון אחד. ‫אז זה... אז ה-או... סליחה, ‫ה-או המתמטי שלנו מתנהג קצת שונה מ-או, ‫שאנחנו בשפת רחוב, ‫שאנחנו מדברים בעצם. ‫בואו נראה איך זה נראה בטבלת שייכות. יש לנו false, false, false, true, true, false ו- true, true. אוקיי. אז השאלה היא ‫האם איקס שייך בעצם? ‫אם איקס לא שייך לא ל-A ולא ל-B, ‫אז האם איקס שייך לאיחוד? ‫לא. אם איקס שייך ל-B, ‫אבל איקס לא שייך ל-A, ‫האם הוא שייך לאיחוד? ‫-כן. ‫אוקיי, מוחמד, כתבת ממש ההפך, ‫למה אתה מתכוון? ‫ממש ההפך משפט רחוב, כלומר? ‫מניח ממה שהיה מקודם. ‫אוקיי, אז זה לא בדיוק ההפך מעברגם, ‫אבל אנחנו נראה ש... אוקיי, אז זה לא בדיוק היכך מאיזה גם, אבל אנחנו נראה ש... אוקיי, אז...",
      "lang": "he",
      "type": "audio",
      "ref": "https://photos.google.com/share/AF1QipMdzNUoZi6u47DCo9m8T1GKIgoLntNoD44EtTCrjDLVHq3w6AsRVSlZhoqLtLinhQ/photo/AF1QipPi8ROw1FZ5r_C4N8gzXmkZDEr-oVQKkZBHdYYp?key=NXBaX0JQZWM4Z251cU1LT09GdWxVa3k5UmozTVR3"
    },
    {
      "offset_start": "0:23:32.400",
      "offset_end": "0:25:47.000",
      "text": "אז עכשיו מה אנחנו מקבלים כאן? אנחנו מקבלים כאן true, כאן true, וגם כאן true, כי אמרנו בעצם שכאן זה או ש-x שייך ל-a, או ש-x שייך ל-b, או ש-x שייך לשניהם, זה בסדר מבחינתנו. זה כמו פלוס, וקודם זה כמו כפל. כן, כאילו אם אתה מכפיל באמת אפסים ואחד, אם בעצם בצורה... כן, כן, כאילו אם זה אפס אחד. כן, אז צריך להיזהר כאן כי אחד ועוד אחד לא שווה לאפס, אבל... כן, ואחד. אוקיי, אז יש לנו את הדיאגרמת ון, מה זה הדיאגרמת ון של האיחוד? כל השטח. אז זה כל השטח בעצם, אוקיי? אז בואו נצייר את זה בצבע אחר. ‫אז תשימו לב שהטבלאות שלנו ‫הן לא הפוכות ממש אחת לשנייה, ‫כי זה לא שכל מה שהיה פועל ‫ספך לטרו, ‫אז הם לא בדיוק הפכים אחד של השני, ‫צריך להיזהר. ‫אוקיי, הפעולה הבאה שלנו היא תהיה הפרש, היא תהיה הפרש קבוצות. אוקיי, לא עשינו דוגמה עדיין של איחות, אז כדאי לעשות דוגמה של איכות. אז נניח שאנחנו לוקחים a שווה ל-1,2 ו-b שווה ל-1 A. אז זה פשוט יוצא A, זה נכון לכל קבוצה, נכון? אוקיי, ומה זה קבוצה ריקה? איחוד עם קבוצה ריקה זה גם כן קבוצה ריקה, מאמרנו שזה נכון לכל A. בסדר גמור, אוקיי, תשימו לב גם כן ש...",
      "lang": "he",
      "type": "audio",
      "ref": "https://photos.google.com/share/AF1QipMdzNUoZi6u47DCo9m8T1GKIgoLntNoD44EtTCrjDLVHq3w6AsRVSlZhoqLtLinhQ/photo/AF1QipPi8ROw1FZ5r_C4N8gzXmkZDEr-oVQKkZBHdYYp?key=NXBaX0JQZWM4Z251cU1LT09GdWxVa3k5UmozTVR3"
    },
    {
      "offset_start": "0:25:47.000",
      "offset_end": "0:27:54.080",
      "text": "יש למה זה A איחוד B, נכון? ואיך זה סיים שלנו? אופס, תודה, אוקיי, יפה מאוד, אם A מוכל ב-B,מה אנחנו יכולים להגיד לגבי האיכות שלהם? ‫B. ‫-הוא שווה ל-B, כי ב-B בעצם, ‫אנחנו לוקחים את כל האיברים ‫שהם ב-A וב-B. ‫A מוכל ב-B, אז אנחנו פשוט לוקחים ‫את כל האיברים שב-B פשוט. ‫אם אז, אוקיי? אז טענה פשוטה, ‫שלא נוכיח אותה כאן, אבל זה די ברור. אוקיי, פעולה שלישית, הפרש קבוצות. זה הפרש סימטרי כאילו? לא. זה לא קשור? לא אותו דבר? לא, אנחנו נגדיר את הפרש סימטרי בעזרת הפרש קבוצות, אבל הפרש קבוצות מתנהג יותר כמו מינוס מאז שאתה מדבר על הפרש סימטרי. אז הפרש קבוצות מוגדר ככה, אז אנחנו מסמנים אותו על ידי a מינוס b, שזה מינוס עקום כזה קצת, או על ידי מינוס רגיל והתאם לקונטקסט שלנו אם אנחנו לא מתבלבלים בין מינוס למינוס או בין הפרש למינוס אז לא אכפת לנו גם לרשום את המינוס בצורה רגילה, אוקיי? אז אנחנו נגדיר את ה-A מינוס B להיות כל האיברים שנמצאים ב-A, אבל לא נמצאים ב-B. X, כך ש-X שייך ל-A, וגם X לא שייך ל-B. שימו לב, אז השתמשנו שוב בסימן הזה של ה... וגם הלוגי, אז x שייך ל-a וגם x לא שייך ל-b. בואו נראה דיאגרמת ון.",
      "lang": "he",
      "type": "audio",
      "ref": "https://photos.google.com/share/AF1QipMdzNUoZi6u47DCo9m8T1GKIgoLntNoD44EtTCrjDLVHq3w6AsRVSlZhoqLtLinhQ/photo/AF1QipPi8ROw1FZ5r_C4N8gzXmkZDEr-oVQKkZBHdYYp?key=NXBaX0JQZWM4Z251cU1LT09GdWxVa3k5UmozTVR3"
    },
    {
      "offset_start": "0:28:00.920",
      "offset_end": "0:29:44.840",
      "text": "מה לדעתכם זה ההפרש במקרה הזה? רק a לנוע חיתוך. רק A בלי השטח המשקיע. כן, יפה מאוד. אז אנחנו רואים שזה בעצם כל מה שב-A ולא ב-B, אז אנחנו בעצם מורידים את החיתוך, אוקיי? אפשר להגיד A מינוס A חיתוך B? כן, אז אנחנו יכולים להגיד טענה כזאת, ‫ש-a מינוס b שווה ל-a מינוס a חיתוך b. ‫אפשר לרשום את זה למטה ‫בתור איזושהי טענה דוגמה כזאת ‫שאפשר להוכיח אותה, ‫אז a מינוס b שווה ל-a מינוס a חיתוך b, בסדר? לזרוק את b זה אותו דבר כמו לזרוק את החיתוך של a עם b. עכשיו בואו נראה את טבלת אמת של ההפרש, זאת תבלת שייכות, אז יש לנו a, b, a מינוס B, FF, FT, TF, TT. אוקיי, מה זה, האם A מינוס B הוא בשורה הראשונה, האם הוא צריך להיות true או false? False. אוקיי, שורה שני הוא צריך להיות true או false? ‫false. ‫-false. ‫בשורה השנייה? ‫-שנייה, false. ‫גם, כי הוא לא שייך ל... ‫אז מלכתחילה אנחנו לא מסתכלים עליו. ‫בשורה השלישית? ‫-true. ‫-כן, true. ‫ובשורה הראשית? ‫-לא נכון, false. ‫לא נכון, כן, אנחנו לא רוצים ‫לקחת איבר שהוא נמצא בחיתוך בעצם,",
      "lang": "he",
      "type": "audio",
      "ref": "https://photos.google.com/share/AF1QipMdzNUoZi6u47DCo9m8T1GKIgoLntNoD44EtTCrjDLVHq3w6AsRVSlZhoqLtLinhQ/photo/AF1QipPi8ROw1FZ5r_C4N8gzXmkZDEr-oVQKkZBHdYYp?key=NXBaX0JQZWM4Z251cU1LT09GdWxVa3k5UmozTVR3"
    },
    {
      "offset_start": "0:29:45.800",
      "offset_end": "0:32:41.200",
      "text": "‫שהוא נמצא בשניהםם. בואו נראה דוגמה. נניח שיש לנו a שווה ל-1,3 ו-b שווה ל-2,וש, מה זה A מינוס B? אחד. אנחנו לוקחים את כל האיברים שנמצאים ב-A, אבל לא נמצאים ב-B. מה זה A פחות קבוצה ריקה? A. A. זה A. מה זה קבוצה ריקה פחות A? קבוצה ריקה. קבוצה ריקה. אוקיי. האם יש שאלות? תשימו לב, אתם ממש, מי שדיבר על כפל וחיבור אז באמת, אנחנו צריכים לחשוב עליהם בעצם בתור פעולות חשבון על קבוצות, אוקיי? יש לנו, אנחנו מקבלים שתי קבוצות, עושים עליהן איזושהי פעולה, ומחזירים בחזרה קבוצה. תודה. שאלות? אוקיי. אז ראינו את האיחוד, את החיתוך, את ההפרש, או חיסור, אפשר גם לקרוא לזה גם חיסור קבוצות, זה לא משנה. אוקיי. אז עכשיו בואו נעשה תרגיל. אז הוכיחו או הפריחו. האם או... אנחנו מקבלים את הטענה הבאה בעצם, צריכים להחליט האם היא נכונה? אנחנו לא יכולים לדעת. כן, זה נכון, נכון. אבל הניחוש שלנו אולי שזה לא יהיה נכון, למה? כי... האם זה נכון עבור מספרים כשאנחנו לוקחים מינוסים? תשימו לב שאם זה היה מספר מצד שמאל, אז למה זה היה שווה כשהיינו פותחים את הסוגריים? זה היה שווה ל-a-b פלוס c, נכון?",
      "lang": "he",
      "type": "audio",
      "ref": "https://photos.google.com/share/AF1QipMdzNUoZi6u47DCo9m8T1GKIgoLntNoD44EtTCrjDLVHq3w6AsRVSlZhoqLtLinhQ/photo/AF1QipPi8ROw1FZ5r_C4N8gzXmkZDEr-oVQKkZBHdYYp?key=NXBaX0JQZWM4Z251cU1LT09GdWxVa3k5UmozTVR3"
    },
    {
      "offset_start": "0:32:43.400",
      "offset_end": "0:34:09.480",
      "text": "אז... אבל זה לא נכון אז שזה יהיה שווה ל-A מינוס B מינוס C, אבל כמובן שזה לא... אין כאן מספרים, אי אפשר לעשות את הפעולות האלה על מספרים, אבל אנחנו יכולים לנסות לבנות איזושהי דוגמה שבה זה באמת לא עובד. אוקיי? אז לפעמים זה קצת אומנות בעצם לחשוב על דוגמאות שמפריחות איזשהן טענות, אז פתרון מפריח על ידי דוגמה נקדית אוקיי אז בואו נראה איך אנחנו עושים את זה. אז תשמעו לב, מה ההבדל ביניהם? ‫ההבדל ביניהם שבעצם כאן אנחנו עושים את b מינוס c קודם, נכון? אז יכול להיות מצב שבעצם שבו b מינוס c ‫פשוט שווה לקבוצה ריקה, לדוגמה, ‫ואז a פחות קבוצה ריקה ‫יהיה פשוט שווה ל-a. מצד שני, אם אנחנו עושים את הפעולות בסדר הזה, ‫אז אנחנו קוד, ‫ואז a פחות קבוצה ריקה יהיה שווה ל-a. ‫מצד שני, אם אנחנו עושים ‫את הפעולות בסדר הזה, ‫אז אנחנו קודם נעשה a פחות b, ‫ואז נוריד איזשהו איבר מ-a יכול להיות, ‫ואז כאן נוריד אחרי זה ‫עוד איבר מ-a, ‫ואנחנו רואים באמת שזה לא יהיה אותו דבר, ‫כי זה לא יהיה a יותר. ‫אז איזה דוגמה ניקח? ‫ניקח את a שווה נניח ל-1, 2, 3, אפשר לקחת אפילו דוגמה יותר קטנה.",
      "lang": "he",
      "type": "audio",
      "ref": "https://photos.google.com/share/AF1QipMdzNUoZi6u47DCo9m8T1GKIgoLntNoD44EtTCrjDLVHq3w6AsRVSlZhoqLtLinhQ/photo/AF1QipPi8ROw1FZ5r_C4N8gzXmkZDEr-oVQKkZBHdYYp?key=NXBaX0JQZWM4Z251cU1LT09GdWxVa3k5UmozTVR3"
    },
    {
      "offset_start": "0:34:11.000",
      "offset_end": "0:35:44.440",
      "text": "בואו נעשה דוגמה אפילו יותר פשוטה, כדי שזה יהיה ממש כמה שיותר קל. וניקח את b להיות שווה ל-1, ואת c להיות שווה ל-2. אוקיי. אז אם אני עושה A פחות B פחות C, מה זה B פחות C במקרה הזה? אחד. אה, אני עשיתי איזה פריטות. זה יוצא קבוצה ריקה. זה יוצא אחד, ואז אנחנו באמת לוקחים, נכון, אז אנחנו בעצם מקבלים כאן, אז אנחנו מקבלים כאן a פחות קבוצה ריקה, נכון? סליחה, לא קבוצה ריקה, אנחנו מקבלים את 1, כמו שאתם אמרתם. זה יוצא קבוצה ריקה, לא? לא, b פחות c שווה ל-1. לא, ואז 1 פחות 1, כאילו. לא, אבל a זה 1 שתיים, זה בעצם יוצא אחד שתיים פחות אחד. אוקיי, אני קצת מסמיק עכשיו, לא רואים את זה אולי בזום, אבל כי אני אמרתי איזושהי שטות קודם, אתם יכולים לחזור אחרי זה בווידאו ולמצוא את השטויות שאמרתי, אבל כשחושבים על זה בצורה מסודרת אז זה יוצא נכון הדוגמה הנגדית הזאת. ‫מה זה 1, 2, פחות 1? ‫2. ‫-2. ‫אוקיי. עכשיו בואו נעשה ‫a פחות b פחות c. ‫אז אנחנו צריכים לעשות ‫את a פחות b קודם. ‫מה זה a פחות b? ‫-2.",
      "lang": "he",
      "type": "audio",
      "ref": "https://photos.google.com/share/AF1QipMdzNUoZi6u47DCo9m8T1GKIgoLntNoD44EtTCrjDLVHq3w6AsRVSlZhoqLtLinhQ/photo/AF1QipPi8ROw1FZ5r_C4N8gzXmkZDEr-oVQKkZBHdYYp?key=NXBaX0JQZWM4Z251cU1LT09GdWxVa3k5UmozTVR3"
    },
    {
      "offset_start": "0:35:44.920",
      "offset_end": "0:37:12.760",
      "text": "‫2. ‫-2, נכון? זה כל הדברים שנמ�מצאים ב-a ולא נמצאים ב-b. אז אנחנו מקבלים 2 פחות 2, ולמה זה שווה? קבוצה ריקה. קבוצה ריקה. אוקיי, כן, אנחנו מסתכלים על כל העברים שנמצאים כאן, אבל לא נמצאים כאן. בסדר, אז אנחנו רואים ששתי הקבוצות האלה שקיבלנו הן לא שוות אחת לשנייה. ולכן גם הטענה שלנו מלכתחילה לא הייתה נכונה. האם יש שאלות? אני לא יודעת אם צריך להפריט את זה או לא, כן? ‫אז זאת שאלה מאוד פשוטה. ‫אין לזה תשובה פשוטה, ‫אבל בעצם ככה מתרחש בעצם ‫תהליך חשיבה מתמטית. ‫אנחנו ממציאים איזושהי טענה, ‫ואז בודקים האם היא נכונה או לא נכונה ‫על ידי דוגמה, או לנסות לה... ‫אז מה קורה בעצם?צם? אנחנו יכולים ללכת בשתי דרכים, זאת הבעיה כאן, אנחנו נמצאים באיזשהו פיצול דרכים, באיזושהי צומת, ואנחנו צריכים להחליט האם אנחנו מחפשים דוגמה נגדית או שאנחנו מנסים להוכיח. עכשיו, הרעיון הוא שיכול להיות שלא בחרנו את המסלול הנכון, יכול להיות שיש טענה נכונה שאנחנו מנסים להפריך אותה, אוקיי? ‫אם אתה לא הולך... ‫-אז איך אנחנו הולכים לכיוון אחד, ‫לא מצליחים, ‫אז אנחנו חוזרים בחזרה לכיוון השני.",
      "lang": "he",
      "type": "audio",
      "ref": "https://photos.google.com/share/AF1QipMdzNUoZi6u47DCo9m8T1GKIgoLntNoD44EtTCrjDLVHq3w6AsRVSlZhoqLtLinhQ/photo/AF1QipPi8ROw1FZ5r_C4N8gzXmkZDEr-oVQKkZBHdYYp?key=NXBaX0JQZWM4Z251cU1LT09GdWxVa3k5UmozTVR3"
    },
    {
      "offset_start": "0:37:13.360",
      "offset_end": "0:39:12.000",
      "text": "‫לא מצליחים שם, ‫שוב חוזרים למסלול הראשון. ‫לא מצליחים שם, ‫שוב חוזרים למסלול השני. ‫אז ככה אנחנו משחקים עם זה ‫עד שאנחנו מגיעים לאיזשהו פתרון. ‫וזה ממש התהליך ‫שבו מתמטיקאים עובדים. ‫כלומר, אם אני עובד על איזושהי בעיה בעיה אני לא יודע מראש אם היא נכונה או לא נכונהיותר יותר פרגילים, ככה היכול שלך לנחש את הכיוון הנכון, הסיכוי שלך לנחש את הכיוון הנכון הוא בעצם עולה, אוקיי? כי אתה כבר מזהה דפוסים, אתה יכול לנחש בקלות יותר האם טענה היא נכונה או לא נכונה. אוקיי. סעולי. כן. חזרת בשורה ארבע פחות, בי פחות שיא, אתה יכול להסביר למה זה יוצא קבוצה של 1? כן, אז כאן יש לי, בואו נפגש את זה.מה זה b פחות c? זה שווה ל-1 מינוס 2. אז זה כל האיברים שנמצאים ב-b ולא נמצאים ב-c, בסדר? אז 1 נמצא ב-b אבל הוא לא נמצא ב-c, ולכן הוא יהיה שייך בעצם להפרש ביניהם, בסדר? עכשיו, דרך אחרת להסתכל על זה זה כאילו, מה זה חיסור? אתה בעצם מוחק מהרשימה של B את כל האיברים של C כיוון שהאיברים של C לא נמצאים ב-B אז אתה לא מוחכת שום דבר בעצם ונשארת עם B במקרה הזה. בסדר? כן, כן.",
      "lang": "he",
      "type": "audio",
      "ref": "https://photos.google.com/share/AF1QipMdzNUoZi6u47DCo9m8T1GKIgoLntNoD44EtTCrjDLVHq3w6AsRVSlZhoqLtLinhQ/photo/AF1QipPi8ROw1FZ5r_C4N8gzXmkZDEr-oVQKkZBHdYYp?key=NXBaX0JQZWM4Z251cU1LT09GdWxVa3k5UmozTVR3"
    },
    {
      "offset_start": "0:39:12.000",
      "offset_end": "0:42:00.720",
      "text": "אוקיי, אז זה היה הפרש וגם עשינו תרגיל אחד נחמד, תיאורטי. אוקיי, ויש לנו את הפעולת ההפרש הסימטרי שדיברתם עליה בתרגול, אז אני רק... רגע, סולי. מה? אם היה ב-B, נגיד, 1, 2, 3, וב-C, 2, 3,בע. זה עדיין היה רק אחד? אם... בואו נסמן דוגמה אחרת. אם b שווה ל-1, 2, 3, ו-c שווה ל-2, 3, 4, אז b פחות c, זה אומר למחוק מהרשימה של B את כל האיברים של C, ובאמת אנחנו מקבלים שזה שווה ל-1. אה, אוקיי. אוקיי. נמשיך הלאה. אז אפרש סימטרי. אנחנו פחות משתמשים בו ביומיום. ‫אבל הוא בעצם עובד לפי או אקסקלוסיבי, ‫אוקיי? אז יש לנו בעצם... ‫אנחנו נסמן את זה לפעמים ‫כ-A משולש B, ‫יש לזה עוד כל מיני סיבונים, זה בעצם אומר, דבר הבא, אנחנו לוקחים את איקס, איקס שייך לאי, וגם איקס לא שייך ל-b, או, אז בואו נחשב על זה כ-o לוגי, בלי עברית בכלל, זה יעשה לכם קצת כאב ראש, או x לא שייך ל-A וגם X שייך ל-B. אז אתם רואים שההגדרה שלו גם הרבה יותר מסורבלת. אפשר לקצר את זה בעצם על ידי קבלת כסור לוגית שאתם תלמדו עליה בלוגיקה וגם בתכנות. אז תוות השייכות נראית בצורה הבאה. אז יש לנו A, B, A הפרש סימטרי B.",
      "lang": "he",
      "type": "audio",
      "ref": "https://photos.google.com/share/AF1QipMdzNUoZi6u47DCo9m8T1GKIgoLntNoD44EtTCrjDLVHq3w6AsRVSlZhoqLtLinhQ/photo/AF1QipPi8ROw1FZ5r_C4N8gzXmkZDEr-oVQKkZBHdYYp?key=NXBaX0JQZWM4Z251cU1LT09GdWxVa3k5UmozTVR3"
    },
    {
      "offset_start": "0:42:08.120",
      "offset_end": "0:44:07.260",
      "text": "אז יש לנו False, false, false, true, true, false, true, true. אוקיי. בואו נראה. האם בשורה הראשונה צריך להיות לנו false או true? false. אז למה false? כי תשימו לב, כאן בתנאי הזה הוא לא מתקיים כי x לא שייך ל-a, והתנאי הזה גם כן לא מתקיים כי x לא שייך ל-b, אז בסך הכל x לא ישייך להפרש הסימטרי. מה לגבי השורה השנייה? True. אז שורה השנייה היא True, למה היא True? איזה אחד מהתנאים שלנו מתקיים, השמאלי או הימני? הימני. הימני, כי x לא שייך ל-a וגם x שייך ל-b. כיוון שאחד מהתנאים מתקיים, אז אנחנו יודעים שצריך להיות לנו true. גם השורה השלישית תהיה true באותה צורה, אנחנו עכשיו מסתמכים על התנאי הראשון. מה לגבי המצב שבו שניהם true? false. לא. false. למה? כי שוב, שני התנאים האלה לא מתקיימים. ‫אוקיי, ואם אנחנו מסתכלים ‫על היאגרמת ון... ‫זה רק הולך חוץ מהחיתוך. ‫-נכון. ‫כאילו כמו איחוד פלוס... ‫איחוד פחות החיתוך. ‫מאוד. אז באמת... ‫בואו נראה דוגמאות קודם, ‫ואז אנחנו נרשום את כל הטענות האלה שאמרתם עכשיו. אז יש לנו דוגמה. נניח שיש לנו a שווה ל-1, 2 ו-b שווה ל-2, 3. מה ההפרש הסימטרי של A ו-B?",
      "lang": "he",
      "type": "audio",
      "ref": "https://photos.google.com/share/AF1QipMdzNUoZi6u47DCo9m8T1GKIgoLntNoD44EtTCrjDLVHq3w6AsRVSlZhoqLtLinhQ/photo/AF1QipPi8ROw1FZ5r_C4N8gzXmkZDEr-oVQKkZBHdYYp?key=NXBaX0JQZWM4Z251cU1LT09GdWxVa3k5UmozTVR3"
    },
    {
      "offset_start": "0:44:07.880",
      "offset_end": "0:45:50.800",
      "text": "אחד, שלוש, נכון? אחד. אז זה אחד ו... אחד ושלוש. נכון? אחד ושלוש. אנחנו לוקחים רק את הדברים שהם לא מופיעים בחיתוך בעצם, את כל הדברים שלא מופיעים בחיתוך, נכון? ככה. אז יש לנו טענות שאפשר להוכיח אותן, אז זה הולך ככה, אז יש לנו A הפרש סימטרי B, הוא שווה ל-A מינוס B איחוד עם B מינוס איי. האם אתם מסכימים עם הטענה הזאת? מה זה איי מינוס בי? זה כל מה שנמצא מצד שמאל בציור כאן, ומה זה בי מינוס איי? זה כל מה שנמצא בצד ימין. האיכות שלהם נותן לנו בדיוק את כל זה, ולכן זה בדיוק ההפרש הסימטרי. אתם הצעתם טענה אחרת שהיא גם כן נחמדה, היא אומרת שההפרש הסימטרי. ‫אתם מצאתם טענה אחרת ‫שהיא גם כן נחמדה. ‫היא אומרת שהפרש הסימטרי ‫שווה ל-A איחוד B פחות A חיתוך B. ‫אוקיי? אנחנו לוקחים את האיחוד ‫ואז זורקים ממנו את החיתוך. האם יש שאלות? אלעד אמר שזה לא בדיוק ככה. לא הבנתי למה הוא אמר אבל, סתם משהו שהוא אמר. מה זאת אומרת? לא יודע, שאמרנו לו את זה, את הטענה האחרונה, הוא אמר, זה לא תמיד ככה. משהו כזה. לא, לא, הטענה האחרונה הוא אמר, זה לא תמיד ככה, משהו כזה. לא, לא, הטענה האחרונה היא כן נכונה. אוקיי?",
      "lang": "he",
      "type": "audio",
      "ref": "https://photos.google.com/share/AF1QipMdzNUoZi6u47DCo9m8T1GKIgoLntNoD44EtTCrjDLVHq3w6AsRVSlZhoqLtLinhQ/photo/AF1QipPi8ROw1FZ5r_C4N8gzXmkZDEr-oVQKkZBHdYYp?key=NXBaX0JQZWM4Z251cU1LT09GdWxVa3k5UmozTVR3"
    },
    {
      "offset_start": "0:45:54.100",
      "offset_end": "0:48:51.200",
      "text": "היא פשוט נכונה. אוקיי? יכול להיות שהוא דיבר על משהו אחר דומה קצת, אבל... הטענה הזאת היא נכונה. גם ממש רואים את זה ויזואלית ‫כאילו בדיאגרמת ון, ‫צריך להוכיח את זה כמובן, ו... ‫אני חושב שלא עשיתי לאף אחד בחילה עכשיו. ‫-כן. ‫אוקיי, אז אלה היו הפעולות שלנו. ‫אנחנו עכשיו נדבר על משהו ‫שנקרא בעצם קבוצה אוניברסלית, ‫בפעולת המשלים. ‫אוקיי, אז בהינתן, הרבה פעמים ‫אנחנו בעצם, ‫כשאנחנו עובדים על איזושהי בעיה מתמטית, יש לנו איזושהי קבוצה שכל הקבוצות בדיון שלנו הן תת קבוצות של הקבוצה הזאת, אז אנחנו בוחרים קבוצה גדולה, שכל הקבוצות שמעניינות אותנו הן תת קבוצות שלה. אז אנחנו לא אמרנו מה זה תת קבוצה, אז בואו נגדיר את זה למרות שזה... ‫זה אומר בעצם A תת-קבוצה של B אם היא מאוכלת בה. ‫אוקיי, זה פשוט שם נרדף למצב הזה. ‫אוקיי, נקרא לה קבוצה אוניברסלית, אוקיי? ‫-היא חייבת להיות קבוצה. ‫-כן. הגדולה הזאת, נקרא לה קבוצה אוניברסלית. נסמן ב-U. כמו Universal אוקיי? אז התעולת המשלים היא מוגדרת ביחס לקבוצה האוניברסלית הזאת אז... בוא נרשם את זה. אז אנחנו בינתן A, שהיא מוכלת בקבוצה האוניברסלית שלנו, נגדיר את המשלים.",
      "lang": "he",
      "type": "audio",
      "ref": "https://photos.google.com/share/AF1QipMdzNUoZi6u47DCo9m8T1GKIgoLntNoD44EtTCrjDLVHq3w6AsRVSlZhoqLtLinhQ/photo/AF1QipPi8ROw1FZ5r_C4N8gzXmkZDEr-oVQKkZBHdYYp?key=NXBaX0JQZWM4Z251cU1LT09GdWxVa3k5UmozTVR3"
    },
    {
      "offset_start": "0:48:57.640",
      "offset_end": "0:50:46.160",
      "text": "‫נראה לי שאלעד אוהב לשים קו מלמעלה, ‫אני לפעמים רושם את זה עם C כזה מלמעלה. ‫ה-C הזה הוא לא תמיד מוצלח, ‫כי אם יש לנו קבוצה שקוראים לה C, ‫אז זה מאוד מבלבל, ‫אבל זה כאילו מין A בחזקת C כזה, ‫שגם זה לא מוצלח ‫כי יהיו לנו משמעויות אחרות לחזקות. ‫אולי היה עדיף באמת לבחור ‫את הסימון של אלעד, ‫אבל בהרבה ספרים אתם תראו באמת ‫שזה מופיע או כקו מלמעלה, ‫או כאיזו מין C כזה. ‫ש-C זה באנגלית זה קומפלימנט, שזה בעצם המשלים, אנחנו מגדיר אותה להיות פשוט U מינוס A, שזה כל האיברים, נניח X שייך ל-U, כך ש-X לא שייך ל-A. אוקיי, כיוון שזה מפרש, אז אנחנו יודעים איך זה נראה, אבל אם אנחנו הרבה פעמים כאילו רואים בספרים, אז הקבוצה U נניח מסומנת בריבוע, אוקיי, שהיא כאילו בעצם כל הדף, והקבוצה A היא מוכלת בה, היא נמצאת כאן. מה זה המשלים של A? כל מה שנמצא מחוץ לקבוצה A, אז זה המשלים של A. סורי, זה לא אומגה? מה, U? כן. אומגה זה U הפוכה, כן? אז זה משהו כזה. כן, מצמיד את זה ככה בדרך כלל במקומות? כן. אוקיי. לפעמים עוד כותבים אומגה, אבל Uם יותר מקובל ‫בספרים של מדעי המחשב, אני חושב.",
      "lang": "he",
      "type": "audio",
      "ref": "https://photos.google.com/share/AF1QipMdzNUoZi6u47DCo9m8T1GKIgoLntNoD44EtTCrjDLVHq3w6AsRVSlZhoqLtLinhQ/photo/AF1QipPi8ROw1FZ5r_C4N8gzXmkZDEr-oVQKkZBHdYYp?key=NXBaX0JQZWM4Z251cU1LT09GdWxVa3k5UmozTVR3"
    },
    {
      "offset_start": "0:50:50.680",
      "offset_end": "0:52:30.000",
      "text": "‫בסדר, כולם מבינים את הרעיון? ‫נניח אם יו... זה יהיה פשוט. ‫אם נניח יו שווה ל... ‫בואו ניקח ממש דוגמה של ממשיים. ‫אז נניח אם יו שווה ל-R, ‫שזה כל הממשיים, אז נניח אם u שווה ל-r, שזה כל הממשיים, ואני לוקח את a להיות כל ה... את כל הקטע בעצם מינוס 1 עד 1, שזה כל המספרים x שנמצאים בממשיים, כך ש-x הוא בין מינוס 1 ל-1. מה יהיה המשלים של a במקרה הזה? גדול מ-1, קטן מ-1. אם הוא, כאילו, או גדול מ-1 או קטן. יפה מאוד, אז בעצם אנחנו אומרים שזה כל ה-x'ים ששייכים ל-R, כך ש-X גדול מאחד או X קטן מ-1, וכיוון שיש לנו תנאי O, אז אנחנו גם יכולים לרשום אותו בתור איכות, אז זה יוצא, כל המספרים ממ�ינוס אינסוף עד, סליחה, גדול שווה, נכון? יואלה, אפשר להסביר את זה בבקשה? כן. אז אני ארשום רק, יש לנו מינוס אחד, מינוס אינסוף עד מינוס אחד, ואחד עד אינסוף. איזה מבלבל שהוספת, אתה גדול שווה עכשיו. זה לא גדול שווה, למעלה רשמת רק את הגדול. כן, אבל כשאתה לוקח את המשלים, אז בואו נצייר את הציור. אז עכשיו, דיקשתם שאני אסביר, אז אני אסביר.",
      "lang": "he",
      "type": "audio",
      "ref": "https://photos.google.com/share/AF1QipMdzNUoZi6u47DCo9m8T1GKIgoLntNoD44EtTCrjDLVHq3w6AsRVSlZhoqLtLinhQ/photo/AF1QipPi8ROw1FZ5r_C4N8gzXmkZDEr-oVQKkZBHdYYp?key=NXBaX0JQZWM4Z251cU1LT09GdWxVa3k5UmozTVR3"
    },
    {
      "offset_start": "0:52:31.000",
      "offset_end": "0:54:13.500",
      "text": "יש לנו את הישר של הממשיים, R, אוקיי? זה כל המספרים. יש לנו את 0 באמצע, ויש לנו את מינוס 1 עד 1. אוקיי? A זה קבוצת כל המספרים שבין מינוס אחד לאחד לא כולל, אוקיי? אז A זה הקבוצה הבאה. בואו נוריד את זה למטה קצת. אנחנו עושים עיגול רגל כדי לסמן שזה לא שייך מינוס 1 ו-1, וכל הקטע ביניהם זה A. מה קורה כשאנחנו לוקחים את המשלים? אנחנו לוקחים את כל האיברים שנמצאים ב-R ולא נמצאים ב-A. אז איך אנחנו מציירים את המשלים במקרה הזה? או שהמספר הוא גדול שווה לאחד, אוקיי? כי אחד, למה אחד כלול במשלים? כי אחד לא כלול בקבוצה עצמה, נכון? כן. או שאנחנו לוקחים את מינוס אחד או מספר שהוא קטן ממנו. זהו, אז אני לא הבנתי את הכתיבה, למה רשמת שגדולה זה מינוס אחד פסיק אחד ולא רשמת את זה בצורה של תחום כמו אי שוויון כזה? אז יש לנו סימונים, יכול להיות שאני קצת קפצתי קדימה כי בעצם יש לנו סימונים בחדווה סטנדרטיים לכתעים של מספרים. אוקיי. אז הסימונים הסטנדרטיים הם כאלה, יש לך A, B, זה כל המספרים שהם בין A ל-B. הבנתי. יש לך סימון כזה, עם סוגריים מרובעים, שזה X גדול שווה ל-A וקטן שווה ל-B,",
      "lang": "he",
      "type": "audio",
      "ref": "https://photos.google.com/share/AF1QipMdzNUoZi6u47DCo9m8T1GKIgoLntNoD44EtTCrjDLVHq3w6AsRVSlZhoqLtLinhQ/photo/AF1QipPi8ROw1FZ5r_C4N8gzXmkZDEr-oVQKkZBHdYYp?key=NXBaX0JQZWM4Z251cU1LT09GdWxVa3k5UmozTVR3"
    },
    {
      "offset_start": "0:54:13.500",
      "offset_end": "0:55:58.120",
      "text": "ויש לך סימונים מעורבים, שזה A נניח B, זה אומר ש-X גדול מ-A וקטן שווה ל-b. בסדר? ויש לך את הסימון הזה כמובן. a, b זה x גדול שווה ל-a וקטן מ-b. זה דרך מקוצרת פשוט לרשום את זה, לא? נכון, זה דרך מקוצרת פשוט. זה הדרך הראשונה שאני רואה את זה. אוקיי, אז אתה תראה את זה עוד כל כך הרבה ‫בחטווה שאתה ירצה... ‫בא לך להקיא כבר, ‫כי זה באמת השפה הסטנדרטית של חטווה. ‫אז סליחה שאני דילגתי ככה אז כבר, ‫הנחתי שכבר ראיתם את זה, ‫אבל בעצם עוד לא ראיתם. ‫-מה זה היום? ‫בחטווה אנחנו כל הזמן עוסקים ‫בעצם בקטעים של ממשיים, ‫וזה יש לנו, זה נקרא בעצם קטע פתוח, ‫זה נקרא קטע סגור, ‫והקטעים האחרים זה קטעים מעורבים ‫או חצי פתוקים, חצי סגורים. ‫אוקיי, יש עוד שאלות? ‫-סעלי, מה זה ה-U? למה? ‫ה-U זה הקבוצה האוניברסלית, אז אני אומר שבעצם במקרה שלנו אז אני בוחר את הקבוצה האוניברסלית להיות כל המספרים הממשיים, בסדר? רק בשביל שתרגישו יותר בנוח עם הדוגמאות, אז נניח שאנחנו בוחרים ‫את U להיות 1, 2, 3, ‫ואת A להיות 1 ו-3. ‫אז מה המשלים שלה? ‫-2. ‫אז המשלים שלה הוא 2.",
      "lang": "he",
      "type": "audio",
      "ref": "https://photos.google.com/share/AF1QipMdzNUoZi6u47DCo9m8T1GKIgoLntNoD44EtTCrjDLVHq3w6AsRVSlZhoqLtLinhQ/photo/AF1QipPi8ROw1FZ5r_C4N8gzXmkZDEr-oVQKkZBHdYYp?key=NXBaX0JQZWM4Z251cU1LT09GdWxVa3k5UmozTVR3"
    },
    {
      "offset_start": "0:56:04.400",
      "offset_end": "0:58:16.000",
      "text": "‫מה אם אני בוחר את A להיות קבוצה ריקה? מה המשלים שלה? 1, 2, 3, בעצם כל U, נכון? ומה המשלים של U? ביחס ל-U? אין לו משלים, לא? קבוצה ריקה, נכון? קבוצה ריקה, אנחנו עושים, תזכרו, זה שווה בעצם ל-u פחות u, נכון? אז זה שווה לקבוצה הריקה. אוקיי, אז זה דוגמאות נוספות. אוקיי. אז דוגמאות שלנו, אחת, שתיים, שלוש. ‫האם יש שאלות? ‫-כן, דוגמה שנייה. ‫כן, אז תשים לב, יש לך כאן בעצם, ‫מה זה המשלים? ‫זה בעצם יו פחות קבוצה ריקה אתה לוקח מ-U, אתה זורק ממנו את כל מה שהוא, אתה לוקח את המשלים בעצם, המשלים זה כל מה שנמצא מחוץ לקבוצה ריקה, אז בעצם זה הכל אוקיי? אוקיי. ועוד דוגמה אחת, אם אני לוקח נניח את U להיות Z, נבחר U להיות Z, מה המשלים של הזוגיים? איזוגיים. יש את הזוגיים, ואנחנו בעצם מזה, אנחנו מגיעים לטענה הבאה שהיא יחסית ברורה, מה זה A משלים משלים? A? חזרה לאותו מקום, לא? פשוט A, נכון? אז אנחנו יכולים לרשום את זה בצורה מלאה, זה יוצא U מינוס U מינוס A שווה ל-A אוקיי",
      "lang": "he",
      "type": "audio",
      "ref": "https://photos.google.com/share/AF1QipMdzNUoZi6u47DCo9m8T1GKIgoLntNoD44EtTCrjDLVHq3w6AsRVSlZhoqLtLinhQ/photo/AF1QipPi8ROw1FZ5r_C4N8gzXmkZDEr-oVQKkZBHdYYp?key=NXBaX0JQZWM4Z251cU1LT09GdWxVa3k5UmozTVR3"
    },
    {
      "offset_start": "0:58:20.000",
      "offset_end": "1:00:30.360",
      "text": "ושוב, זה נכון כמובן, הטענה הזאת היא כמובן נכונה רק לקבוצות בהן נניח כאילו ש-A חייבת להיות מוכלת ב-U ובקבוצה האוניברסלית זה פשוט ההנחה הבילט אין, אבל אם אתם סתם לוקחים שתי קבוצות A ו-B אז הטענה הזאת לא תהיה נכונה באחת. אוקיי. שאלות? אפשר אולי לעשות דוגמאות קצת? כל זה היה דוגמאות. לא, נגיד על האחרון שאמרת U ו-A, במספרים נגיד, אני אומר ה-U שלי זה 1 עד 10. כן, אז בואו נעשה קצת יותר, קצת פחות דרמטי, אז 1, 2, 3 נניח, ואז אנחנו לוקחים את a להיות 1, אז המשלים שלו זה 2, 3, והמשלים של המשלים זה פשוט 1, נכון? כן, אחלה. אוקיי. אז אוקיי, בואו נעשה עכשיו צמד משפטי מאוד מאוד חשוב. אז משפט דה מורגן, ‫אז הוא אומר את הדבר הבא, ‫אנחנו שוב, אנחנו חיים ‫באיזושהי קבוצה אוניברסלית, אוקיי? ‫המשפט הזה חסר משמעות ‫אם אנחנו לא חיים באיזושהי קבוצה אוניברסלית. ‫אז הוא אומר את הדבר הבא, ‫אם אנחנו לוקחים חיתוך של קבוצות ואז לוקחים את המשלים, אז יוצא A משלים, איחוד עם B משלים ואם אנחנו לוקחים את האיחוד של קבוצות, אז יוצא Aוקיי, אז בעצם הפעולת ההשלמה היא הופכת את החיתוך לאיחוד ואת האיחוד לחיתוך.",
      "lang": "he",
      "type": "audio",
      "ref": "https://photos.google.com/share/AF1QipMdzNUoZi6u47DCo9m8T1GKIgoLntNoD44EtTCrjDLVHq3w6AsRVSlZhoqLtLinhQ/photo/AF1QipPi8ROw1FZ5r_C4N8gzXmkZDEr-oVQKkZBHdYYp?key=NXBaX0JQZWM4Z251cU1LT09GdWxVa3k5UmozTVR3"
    },
    {
      "offset_start": "1:00:30.400",
      "offset_end": "1:02:24.500",
      "text": "צריך לזכור את זה, זה חשוב מאוד. אוקיי. יש הוכחה לזה? כן, אבל היא לא כל כך תורמת. הסיבה לזה היא שבעצם זה נובע מלוגיקה, אוקיי? אז אנחנו צריכים... אני אנסה לשכנע אתכם בעצם בעזרת... תסתכלו על הדבר הזה נניח, אוקיי? אז אנחנו צריכים כאילו לקחת בעצם, יש לנו כמה מצבים, אוקיי? אז נניח שאנחנו מסתכלים על הטענה הראשונה, תתמקדו בזה, a חיתוך b משלים שווה ל-a משלים איחוד אם b משלים. אז כמו שאמרתי, אני לא ארשום מוכחה פורמלית, אבל יש לנו בעצם, אפשר להגיד שהרבעה מצבים. ‫אז יכול להיות שאיקס שלנו, ‫שאנחנו מסתכלים עליו, ‫הוא לא שייך לא ל-A ולא ל-B. ‫יכול להיות שאיקס שאנחנו ‫מסתכלים עליו, נקרא לו Y עד פעם, ‫הוא שייך ל-A, אבל לא שייך ל-B. ‫יכול להיות שהאיבר שנסתכל עליו... ‫הוא שייך ל-B, אבל לא שייך ל-A. ‫והאיבר האחרון שנשאר לנו בעצם לבדוק זה עבר ששייך לשתי הקבוצות אבל מה בעצם עשינו כאן? עשינו כאן טבלת אמת כלשהי, טבלת שייכות בואו ננסה לראות באמת, ואז אנחנו צריכים להראות שאם זה שייך לצד שמאל אז זה שייך לצד ימין אם זה שייך לצד ימין אז זה שייך לצד שמאל אז הכי קל לראות את ההוכחה של דה מורגן בעצם על ידי טבלת שייכות",
      "lang": "he",
      "type": "audio",
      "ref": "https://photos.google.com/share/AF1QipMdzNUoZi6u47DCo9m8T1GKIgoLntNoD44EtTCrjDLVHq3w6AsRVSlZhoqLtLinhQ/photo/AF1QipPi8ROw1FZ5r_C4N8gzXmkZDEr-oVQKkZBHdYYp?key=NXBaX0JQZWM4Z251cU1LT09GdWxVa3k5UmozTVR3"
    },
    {
      "offset_start": "1:02:25.720",
      "offset_end": "1:04:06.720",
      "text": "אז יש לנו A, B, A חיתוך B, A חיתוך B משלים, ‫וכאן יש לנו A משלים, B משלים, ‫ו-A משלים, איחוד B משלים ו-A משלים איחוד B משלים. סליחה, המשלים מעל הסוגריים, איך הוא שונה מכשהמשלים יורד כל אחד, הוא יורד אליהם כל אחד בנפרד? כאילו אם אני פותח את זה... כן, אתה לוקח את המשלים של A ומאחד אותו עם המשלים של B, כאן אתה לוקח את החיתוך קודם, ‫ואז אתה לוקח את המשלים. ‫-אוקיי. ‫אנחנו נראה את זה עכשיו ‫ממש בצורה מפורשת בטבלת אמת. ‫אתה תבין... ‫טרו-טרו, אוקיי? ‫זה בעצם ארבע השורות שלנו. ‫אז אתם רואים שבמקום להסתבך ‫עם כל מיני טענות לוגיות כאן, ‫אנחנו בעצם פשוט בודקים את זה ‫עבור טבלת שייכות. ‫אז אנחנו פשוט הולכים לפי הטבלה. ‫אז הטבלה כאן... ‫אז אנחנו פשוט הולכים לפי החיתוך. ‫מתי יתרו? ‫המקום היחיד שיתרו ‫זה כששניהם יתרו. ‫אוקיי? ‫מה עם המשלים עכשיו? ‫המשלים בעצם הופך לנו ‫את הערך האמת שלנו, ‫אז יש לנו כאן true, true, true, false. ‫אם איבר שייך לחיתוך, ‫אז הוא לא שייך למשלים. ‫אם איבר לא שייך לחיתוך, ‫אז הוא כן שייך למשלים, אם הרער לא שייך למשלי לחיתוך, אז הוא כן שייך למשלים.",
      "lang": "he",
      "type": "audio",
      "ref": "https://photos.google.com/share/AF1QipMdzNUoZi6u47DCo9m8T1GKIgoLntNoD44EtTCrjDLVHq3w6AsRVSlZhoqLtLinhQ/photo/AF1QipPi8ROw1FZ5r_C4N8gzXmkZDEr-oVQKkZBHdYYp?key=NXBaX0JQZWM4Z251cU1LT09GdWxVa3k5UmozTVR3"
    },
    {
      "offset_start": "1:04:11.240",
      "offset_end": "1:06:02.920",
      "text": "אז זה בעצם טבלה אחת של הגף השמאלי שלנו. עכשיו יש לנו את A משלים ו-B משלים, אז תשימו לב, אנחנו לוקחים את A משלים, אז אנחנו צריכים להפוך את העמודה הזאת. אז מה אנחנו מקבלים? True, True, false, true false. עכשיו אני לוקח את הייחוד של שתי העמודות האלה. מתי איחוד מקבל את הערך true? כשלפחות אחד מהעמודות יש true, אוקיי? אז כאן יהיה לנו true, כאן יהיה לנו true, כאן יהיה לנו true, וכאן יהיה לנו false. מה קיבלנו? ששתי העמודות שלנו הן בעצם זהות אחת לשנייה, אוקיי? ולכן יש לנו שוויון בין שתי הקבוצות האלה. אנחנו צריכים גם לזכור את הטבלה הזאתי ספציפית או רק את החוקים? לא, מה פתאום, זו דוגמה של איך משתמשים בטבלת אמת בשביל להוכיח איזושהי טענה של קבוצות, אוקיי? לא צריך לזכור אותה, כמובן, צריך לזכור את הדרך שבה אנחנו, או שיטה שבה אנחנו בודקים ששתי קבולות נמשבות אחת לשנייה. אפשר להוכיח דרך טבלת אמת אז, לפי מה שאתה אומר? כן. אוקיי, אז זאת הוכחה לגיטימית, למה? כי היא באמת מראה לנו ש-X שייך לצד שמאל, אם ורק אם, X שייך לצד ימין. אני חושב שאנחנו סיימנו להיום בגדול. בסדר, אז אנחנו נעצור כאן.",
      "lang": "he",
      "type": "audio",
      "ref": "https://photos.google.com/share/AF1QipMdzNUoZi6u47DCo9m8T1GKIgoLntNoD44EtTCrjDLVHq3w6AsRVSlZhoqLtLinhQ/photo/AF1QipPi8ROw1FZ5r_C4N8gzXmkZDEr-oVQKkZBHdYYp?key=NXBaX0JQZWM4Z251cU1LT09GdWxVa3k5UmozTVR3"
    },
    {
      "offset_start": "1:06:04.560",
      "offset_end": "1:07:40.880",
      "text": "יש שאלות? סולי, היה לי שאלה, גם עוד מישהו אמר בהתחלה שהיה לו שאלה מהמבחן שהיה מעבודת בית כןהיה עמודה אחת בתוך המבחן, בתוך הקובץ, שכאילו נתת שם איזושהי קבוצה והיינו צריכים להגיד אם הקבוצות הבאות נכונות לפי הדענה שהיה להן, היה או שייכות או אכלה אוקיי, אתה זוכר, אתה מרשם, אתה לא זוכר אבל אתה יכול להגיד את השם של הקבוצה, איזה קבוצה הזאת היית?. ‫פעמיים כאילו סוגריים וסוצלות, ‫סוגריים וסוצלות, שתיים, שלוש, ‫סוגריים וסוצלות, סוגריים וסוצלות. ‫היה צריך להגיד שזה שייך. ‫רק שנייה, אני אפתח את זה. ‫-זה שייך? ‫בסופו של דבר, אני לא יודע, לא רשמתי. ‫אני אפתח את זה, ‫ואז אני אשתף את זה כאילו אני הרגשתי אותך את זה עם x למרות שזה סימן לי שזה x כי לא הרגשתי שאני מסכום להבין את זה אוקיי אז היה שם, כן, זה היה תרגיל ארוך למדי, נכון? ‫כי היה שם הרבה תשובות. ‫-כן, היה שם הרבה סעיפים, כן. ‫בואו נפתח את זה. ‫אוקיי. ‫בואו פשוט נעבור ביחד סעיף-סעיף מהר, ‫ונראה כאילו בעצם...",
      "lang": "he",
      "type": "audio",
      "ref": "https://photos.google.com/share/AF1QipMdzNUoZi6u47DCo9m8T1GKIgoLntNoD44EtTCrjDLVHq3w6AsRVSlZhoqLtLinhQ/photo/AF1QipPi8ROw1FZ5r_C4N8gzXmkZDEr-oVQKkZBHdYYp?key=NXBaX0JQZWM4Z251cU1LT09GdWxVa3k5UmozTVR3"
    },
    {
      "offset_start": "1:07:41.280",
      "offset_end": "1:09:01.520",
      "text": "‫אז השאלה הראשונה, ‫האם 2-3 מוכל ב-A? כן. מה אתה חושב? כן. לא. לא. התשובה היא לא. למה התשובה היא לא? רק 2 מוכל ב-A. כי האיברים 2 ו-3 הם... האיבר 3 הוא ב-A. אנחנו צריכים לבדוק באמת האם האיברים 2 ו-3 הם שייכים ל-A? ‫האם הם מופיעים ברשימה שהיא A? ‫אז אם אנחנו מסתכלים, ‫אנחנו רואים ש-2 כן מופיע, ‫אבל 3 לא מופיע ברשימה. ‫נכון? כי אלה בעצם איברים, ‫הם כמו שקים סגורים, אמרנו בפעם שעברה. ‫אז 3 לא מופיע, ‫כי למרות שהוא מופיע ברשימה פנימית, ‫אנחנו לא רואים אותו ‫כשאנחנו מסתכלים בתוך A בעצם. ‫בסדר? הוא לא איבר של A. ‫ולכן אין לנו החלה כאן. מה לגבי 1, 2 שייך ל-A? זה נכון. לא, זה לא נכון. גם זה לא נכון, כי אנחנו שואלים האם האיבר הזה מופיע בתור איבר של A, אז אנחנו רואים שפשוט אנחנו עוברים, יש לנו רק ארבעה אאיברים של A ולא אף אחד מהם, אוקיי? ‫יש לנו את האיבר אחד שהוא איבר של A, ‫איבר שתיים שהוא איבר של A, ‫האיבר הזה והאיבר הזה, ‫רק ארבעה איברים, אוקיי? ‫אז האיבר הזה לא מופיע פשוט ‫ברשימה A, אוקיי? ‫הוא לא מופיע שם, זה לא נכון.",
      "lang": "he",
      "type": "audio",
      "ref": "https://photos.google.com/share/AF1QipMdzNUoZi6u47DCo9m8T1GKIgoLntNoD44EtTCrjDLVHq3w6AsRVSlZhoqLtLinhQ/photo/AF1QipPi8ROw1FZ5r_C4N8gzXmkZDEr-oVQKkZBHdYYp?key=NXBaX0JQZWM4Z251cU1LT09GdWxVa3k5UmozTVR3"
    },
    {
      "offset_start": "1:09:05.900",
      "offset_end": "1:10:20.920",
      "text": "‫מה לגבי 2-3 שייך ל-A? ‫-כן, כן, נכון. ‫. למה זה נכון? כי הוא אחד מהעברים של A, אוקיי? רואים את זה פשוט. אוקיי? אז מתי אני פותח את הסוגריים? בהחלה? אתה... רק בהחלה. בהחלה אתה צריך להסתכל על זה בתור רשימות, ואז אתה עושה השוואה של הרשימות, אוקיי? בסדר? אוקיי. אבל איבר הוא איבר, כאילו, אתה לא מסתכל על קבוצה בתור איבר. כאילו, אתה לא מסתכל על קבוצה בתור... כשקבוצה היא איבר בתוך קבוצה, אתה לא מסתכל עליה בתוך... בתור קבוצה, אתה מסתכל עליה בתור איבר, אוקיי? אם היה רשום רק אחד ושתיים, בלי סוגריים, אז זה היה שייך נה? כן, אבל אתה לא עושה... אתה לרוב מסתכל על איבר אחד, אתה לא מסתכל על שני איברים בבת אחת, כן? זה, לא הגדרנו מה זה. אז בואו נסתכל עכשיו על הטענה הבאה, צריך להקטין את זה אולי כדי שאפשר יהיה להראות הכל. עכשיו לא רואים כלום. אז יש לנו את אחד, שתיים, שלוש מוכל ב-A, האם הוא מוכל ב-A? כן. לא, לא, לא. שלוש, 3 מוכל ב-A. ‫האם הוא מוכל ב-A? ‫-כן. ‫לא, לא, לא. ‫-3 לא נמצא ב-A. ‫1, 2 כן מופיעים ברשימה של A, ‫אבל 3 לא מופיע ברשימה של A, ‫ולכן אין לנו החלה. ‫מה לגבי 1, 2 מוכל ב-A? ‫-כן.",
      "lang": "he",
      "type": "audio",
      "ref": "https://photos.google.com/share/AF1QipMdzNUoZi6u47DCo9m8T1GKIgoLntNoD44EtTCrjDLVHq3w6AsRVSlZhoqLtLinhQ/photo/AF1QipPi8ROw1FZ5r_C4N8gzXmkZDEr-oVQKkZBHdYYp?key=NXBaX0JQZWM4Z251cU1LT09GdWxVa3k5UmozTVR3"
    },
    {
      "offset_start": "1:10:23.120",
      "offset_end": "1:11:55.880",
      "text": "‫אז צריך לבדוק, ‫עבור כל אחד מהאיברים האלה, ‫כאן ברשימה מצד שמאל, ‫האם הוא שייך ל-A. אז אחד שייך ל-A, שתיים שייך ל-S. רגע, אם בעליון היה כתוב אחד, שתיים, שלוש שייך ל-A, זה נכון, נכון? נכון. אה, אוקיי, סבבה. אוקיי, והבא זה קבוצה שמכילה את שתיים, שלוש, שהיא מוכנת בתוך קבוצה, והיא מוכנת... האם היא מוכנת ב-A בעצם? ‫האם הדבר הזה מצד שמאל מוכל ב-A? ‫כן. ‫-אז אנחנו צריכים לבדוק ‫האם האיבר בפנים הוא שייך ל-A. ‫האם האיבר הזה מופיע ב-A? ‫כן, הוא מופיע ב-A, ‫ולכן יש לנו החלה כאן. ‫זה כמו שאלה 2-3 שייך ל-A בעצם? ‫-נכון, בדיוק. ‫האם שתיים שייך ל-A ‫בתוך שוב, בתוך קבוצה? ‫לא, כי לא מופיע בתור איבר שם. ‫שתיים שייך ל-A, ‫התשובה היא שהוא מופיע ברשימה. ‫אם היה מופיע קבוצה ריקה, ‫שייכת או מוכלת ב-A? ‫אז הקבוצה הריקה מוכלת ב-A, ‫אבל היא לא שייכת ל-A ‫כי היא לא מופיעה בו בתור איבר. ‫אוקיי? ‫-כן, תודה. ‫הקבוצה הריקה מוכלת ‫בכל קבוצה אחרת, ‫אבל היא לא... היא שייכת רק לקבוצות ‫שהקבוצה הריקה היא מופיעה בהן בתור איבר. אה, סלולי. עוד שאלות? כן, אני הייתי נהיות שאלה. כן. ש-A שווה ורק קבוצות ריקות כזה.",
      "lang": "he",
      "type": "audio",
      "ref": "https://photos.google.com/share/AF1QipMdzNUoZi6u47DCo9m8T1GKIgoLntNoD44EtTCrjDLVHq3w6AsRVSlZhoqLtLinhQ/photo/AF1QipPi8ROw1FZ5r_C4N8gzXmkZDEr-oVQKkZBHdYYp?key=NXBaX0JQZWM4Z251cU1LT09GdWxVa3k5UmozTVR3"
    },
    {
      "offset_start": "1:11:57.240",
      "offset_end": "1:13:22.000",
      "text": "תראה למטה, תראה אותו. אה, כאילו, שאלה אחרת, אני לא יודע איזה מספר זה פשוט. בסדר, אני מנסה למצוא אותו, תגיד לי, תעצור אותי כשאני מגיע... רק שתיים. זה הכל קבוצות ריקות, אין עוד משהו. לא זאת אני משער. לא? הנה, זה. אוקיי. לא הבנתי איך אני משייך את בי ושי למעלה, נתון שכתוב למעלה. זה הדבר היחיד שטעיתי בו. אוקיי. לא הבנתי איך אני משייך את B ו-C לנתון שכתוב למעלה, זה הדבר היחיד שטעיתי בו. אוקיי. כתוב כאן לכל, אז הכוונה היא בעצם שלא משנה איזה B ו-C אתה בוחר שהם שייכים ל-A, אז קודם כל כמה איברים יש ב-A? שלוש. נכון, יש שלושה איברים, יש לנו קבוצה ריקה, וקבוצה שמכילה את הקבוצה הריקה, ועוד את הקבוצה השלישית הזאת, שיש בה שני איברים בתוכה. אז מה זה אומר לכל B ו-C ששייכים ל-A? זה לכל בחירה של שניים מתוך השלושה איברים. בסדר? אז צריך פשוט לקחת כל פעם שני איברים מתוך A ולבדוק עבורם, האם הטענה מתקיימת או לא מתקיימת. בסדר? מספיק שהיא לא תתקיים עבור אחד מהם, עבור זוג, כדי שתפסול את הטענה. אז התשובה הזו לא נכון פה? פשוט לא ראיתי אז. בואו נראה מה השאלה. אם B שונה מ-C, אז מתקיים B חיתוך C שווה לקבוצה ריקר.",
      "lang": "he",
      "type": "audio",
      "ref": "https://photos.google.com/share/AF1QipMdzNUoZi6u47DCo9m8T1GKIgoLntNoD44EtTCrjDLVHq3w6AsRVSlZhoqLtLinhQ/photo/AF1QipPi8ROw1FZ5r_C4N8gzXmkZDEr-oVQKkZBHdYYp?key=NXBaX0JQZWM4Z251cU1LT09GdWxVa3k5UmozTVR3"
    },
    {
      "offset_start": "1:13:22.000",
      "offset_end": "1:14:30.500",
      "text": "אז אנחנו בוחרים שני איברים מתוך השלושה, אז נניח אנחנו לוקחים את הקבוצה הראשונה ואת הקבוצה השנייה, אז החיתוך שלהם הוא רק, הכל בסדר. הקבוצה הראשונה עם הקבוצה השלישית, החיתוך הוא רק עדיין. אבל מה קורה כשאתה לוקח את הקבוצה השנייה והשלישית, מה יהיה החיתוך שלהם? רקע? קבוצה הרקע מכילה את הקבוצה הרקע. קבוצה של ריק, כן. הקבוצה, זה בעצם אנחנו נקבל את הקבוצה שנכילה את הקבוצה הרקע. כן. לא קבוצה... הסופרית הטענה שלנו היא לא נכונה, כי... היא לא תמיד נכונה. נכון, היא לא תמיד נכונה, כי החיתוך של האיבר השני והשלישי הוא לא רע. אז בשאלה כזאת אני בודק את כל המקרים? כן. אוקיי. ואם יש אין סוף איברים בתוך קבוצה, אי אפשר לבדוק את כל המקרים? נכון, אז צריך לחשוב בצורה אחרת, האם אנחנו יכולים למצוא דוגמה נגדית, או שאנחנו יכולים לנסח איזשהו, להוכיח את זה בעזרת איזשהן טענות לוגיות, אוקיי?",
      "lang": "he",
      "type": "audio",
      "ref": "https://photos.google.com/share/AF1QipMdzNUoZi6u47DCo9m8T1GKIgoLntNoD44EtTCrjDLVHq3w6AsRVSlZhoqLtLinhQ/photo/AF1QipPi8ROw1FZ5r_C4N8gzXmkZDEr-oVQKkZBHdYYp?key=NXBaX0JQZWM4Z251cU1LT09GdWxVa3k5UmozTVR3"
    },
    {
      "offset_start": "1:14:33.000",
      "offset_end": "1:16:53.000",
      "text": "תודה. תודה רבה. תודה, רק כהתחלה. כן, כן.אזהרעיון הוא כזה, לרוב אתה בעצם, ברוב השימושים במתמטיקה או במדעי המחשב, אז יש לך איזושהי קבוצה כאילו שהיא... רגע, למה זה פוסט? אוקיי, אתה רואה עכשיו את הנוסף, אז אתה מתמקד באיזושהי קבוצה אחת שהיא גדולה, שהיא מכילה את כל הקבוצות שמעניינות אותך, בסדר? אז נניח שאתה מסתכל על כל המספרים הממשיים בחדווה, או שאתה מסתכל על כל המספרים השלמים בתורת המספרים או משהו כזה. ואתה מסתכל רק על תת קבוצות של הקבוצה האוניברסלית שלך. אהה, בסדר. את יו זה נראה ככה, יש לך את יו שזה הקבוצה האוניברסלית, והקבוצות היחידות שמעניינות אותך זה רק קבוצות. אוקיי? הכל נמצא בתוך יו. כלומר, יו הוא מין היקום שלך, לא כגם שום דבר מחוץ ליקום. אהה. אוקיי? ועכשיו אתה מתחיל להסתכל על פעולות בתוך הקבוצה הזאת, אז מה שהגדרנו זה בעצם המשלים, שאתה לוקח פשוט את הקבוצה שמנתוכה, ואתה מסתכל על כל מה שנמצא מחוץ לקבוצה הזאת, זה המשלים. באופן כללי, אין טעם להסתכל על מה נמצא מחוץ לקבוצה מסוימת, כי נניח אתה מסתכל נניח על מה לא נמצא במספרים הטבעיים,",
      "lang": "he",
      "type": "audio",
      "ref": "https://photos.google.com/share/AF1QipMdzNUoZi6u47DCo9m8T1GKIgoLntNoD44EtTCrjDLVHq3w6AsRVSlZhoqLtLinhQ/photo/AF1QipPi8ROw1FZ5r_C4N8gzXmkZDEr-oVQKkZBHdYYp?key=NXBaX0JQZWM4Z251cU1LT09GdWxVa3k5UmozTVR3"
    },
    {
      "offset_start": "1:16:53.000",
      "offset_end": "1:17:45.300",
      "text": "אז גם גלידה בטעם וניל לא נמצאת בתוך המספרים הטבעיים, אבל זה לא כל כך מעניין אותך כאילו בעצם, שגלידה לא נמצאת בתוך המספרים, שגלידה לא נמצאת בתוך המספרים, נכון? אז אתה מסתכל על איזושהי קבוצה שהיא בעצם הקבוצה שמעניינת אותך, נניח, המספרים השלמיים, ואז אתה מסתכל בתוכה על נניח על המשלים של המספרים הטבעיים, לדוגמה, שזה המספרים השלמיים מ-0 ומטה. כן? אז זה הכל ביחס לאיזושהי קבוצה יותר גדולה. בסדר. אוקיי, יש עוד שאלות? תודה רבה. לא, זה אופה, אתה מריד את המחברת לאתר, נכון? כן, כן. כן, בסדר. אוקיי. יאללה, ביי ביי.",
      "lang": "he",
      "type": "audio",
      "ref": "https://photos.google.com/share/AF1QipMdzNUoZi6u47DCo9m8T1GKIgoLntNoD44EtTCrjDLVHq3w6AsRVSlZhoqLtLinhQ/photo/AF1QipPi8ROw1FZ5r_C4N8gzXmkZDEr-oVQKkZBHdYYp?key=NXBaX0JQZWM4Z251cU1LT09GdWxVa3k5UmozTVR3"
    },
    {
      "offset_start": "0:00:00.880",
      "offset_end": "0:01:28.440",
      "text": "שלום, ברוכים הבאים לקורס מעבולת קריפטולוגיה. בסרטון הזה אני אתאר את הקורס ומה הדרישות. בואו נעבור למצגת שהכנתי. אז פה, כמו שאמרתי, זה הקורס מעבולת קריפטולוגיה, הקריפטולוגיה היא תורת העצבנות, אנחנו רואים פה כמה תמונות שקשורות בנושא הזה. החל מכתב יד עתיק בערבית מלפני 1200 שנה בערך, שמתאר איך אפשר לפרוץ צופן מסוים. יש לנו כאן את מכונת האניגמה, שצוות בראשותו של אלן טיורינג עסק בלפרוץ את הצופן הזה בזמן מלחמת עולם השנייה. הצוות הזה היה ממוקם באחוזה שנקרא בלצ'לי פארק, ואנחנו רואים אותה ברקע כאן מאחוריי, עם תמונה מאותה תקופה. אז אחרי שראינו את זה, אולי נעבור לתמונה יותר רלוונטית עבורנו. מי שזוכר, זה קמפוס מערב של מיכאל טלחי. אחר כך יש לנו פה סכמה של צופן מודרני משנות ה-60 של המאה ה-20, ובסוף יש פה את הלוגו של ביטקוין, שזה אולי אחד השימושים היותר עכשוויים של קריפטולוגיה. אז כמו שאמרתי, קריפטוגרפיה או קריפטולוגיה, אני לא אבחין בין שני המושגים, יש כאלה שמבחינים, אבל אני לא אבחין ביניהם.",
      "lang": "he",
      "type": "audio",
      "ref": "https://moodle.telhai.ac.il/mod/videostream/view.php?id=1140197"
    },
    {
      "offset_start": "0:01:28.440",
      "offset_end": "0:02:53.000",
      "text": "המקור של המילה הזאת הוא ביוונית, קריפטו זה סודי, גרפיה זה כתיבה, ולוגיה זה תורה, אז מי שבוחר לוגיה זה תורה, מי שבוחר גרפיה זה כתיבה. זה המדע עוסק באמצעים לשמירת סודיות של מידע, על ידי הצפנה למשל, ובדרכים לפגוע בסודיות. זאת אומרת, באיזה דרכים אפשר לפרוץ סופנים. למה הנושא הזה הוא כל כך מרתק? עובדה היא שהנושא הזה הוא מרתק גם בתרבות הפופולרית, בספרות, סופרים שכתבו על זה, סרטים שבהם היו משולבים אלמנטים של קריפטוגרפיה, ואפילו מיתוסים שזה מין סיפורים שלא בטוח שהם נכונים, כמו למשל הסיפור הזה על האוצרת של תומאס ביל, שזה איזשהו מסמך מוצפן שיש מהמאה ה-19, שיש הטוענים שהוא מתאר מקום מדויק שבו נמצא אוצר של כמה מיליון, ששווה היום כמה מיליוני דולרים, ויש אנשים שלוקחים את הסיפור הזה ברצינות. ‫יש מקרים מפורסמים מההיסטוריה, ‫אני אתאר אותם בהמשך, ‫בשיעור הבא, ‫שהוא יהיה איזושהי סקירה היסטורית ‫של התורה הזאת. ‫ושוב, נזכיר, שתי מלחמות העולםולם היו קשורות באירועים קליפטוגרפיים שהשפיעו על הדרך שבה המלחמות האלה הסתיימו,",
      "lang": "he",
      "type": "audio",
      "ref": "https://moodle.telhai.ac.il/mod/videostream/view.php?id=1140197"
    },
    {
      "offset_start": "0:02:53.000",
      "offset_end": "0:04:20.800",
      "text": "ויש ספר של סיימון סינג, שאני מאוד נהניתי לקרוא אותו, שהוא מתאר הרבה סיפורים כאלה, וגם מתאר את ההתפתחות של התורה הזאת בצורה מאוד מפורטת, אפילו מתמטית. והנושא הזה הוא מאוד אקטואלי, כן? כל מה שקשור בלוחמת סייבר, בהבטחת מדע, ומסחר אלקטרוני באינטרנט, ואחד הנושאים האחרונים של מאוד קריפטוגרפים, ואפילו נגיע לתורת הקוונטים ולפיזיקה. אז שוב, כמו שאמרתי, בקריפטוגרפיה משתמשים קודם כל לשמירת מידע, זאת אומרת, להצפנה של מידע, אם נניח אליס ובוב רוצים להתכתב ביניהם, אליס ובוב אלה שני שמות שמקובל להשתמש בהם במדעי המחשב, זה יתאר שני אנשים שעושים ביחד משהו מסוים, כמו למשל התכתבות או קשר ברשת מחשבים, וחוששים שאיב פה מנסה להאזין להם, אז הם מצפינים בעזרת מפתח K את כל המידע שעובר ביניהם. קריפטוגרפיה, אנחנו משתמשים גם בכלים קריפטוגרפיים כדי לוודא שמידע שהעברנו או שמרנו לא השתנה, אוקיי? שמישהו לא שינה אותו בזדון או שלא בזדון. ועוד שימושים שונים, כמו למשל אימות של זהות, אנחנו רוצים לדעת שמי שאנחנו בקשר איתו הוא אכן הבן אדם הנכון.",
      "lang": "he",
      "type": "audio",
      "ref": "https://moodle.telhai.ac.il/mod/videostream/view.php?id=1140197"
    },
    {
      "offset_start": "0:04:21.200",
      "offset_end": "0:05:53.560",
      "text": "מסחר אלקטרוני, הצבעה אלקטרונית, בהרבה ארצות היום בחירות נעשות בצורה אלקטרונית, ממוחשבת. וכמו שאמרתי, מטבעות קריפטוגרפים. בואו נדבר קצת על הקורס. אז הקורס הוא קורס מתמטי חישובי, אוקיי? דרישות קדם זה קודם כל הקורס באלגברה מודרנית, אנחנו נשתמש בידע מתורת המספרים ותורת החבורות, עוזר לדעת קצת הסתברות, עוזר לדעת קצת אלגוריתמים, בעיקר הנושא של חישוב סיבוכיות, ואנחנו נתכנת בשפת פייתון, אז רצוי שיהיה גם קצת ידע בסיסי בפייתון, שאני בטוח שיש לכם. אז בקורס הזה, בשיעור הראשון, אני אתן קצת רקע היסטורי שעוזר לנו מאוד להבין את הקריפטוגרפיה של היום. נדבר על צופני זרם, שאלה צופנים שמצפינים מידע באופן רציף, לעומת צופני בלוקים שהם מצפינים לא באופן רציף, אלא בחבילות, אוקיי? כשמתמלאת חבילה אפשר להצפין אותה. נדבר על צופני מפתח קומבי, של אלה צופנים שהומצאו במאה ה-20, בשנות ה-70, והם למעשה פותרים את הבעיה של להעביר מפתח הצפנה מצד לצד, נדבר על זה הרבה. נדבר על אימות, זאת אומרת, באנגלית authentication זה האמצעים לבדוק ולוודא זהות ‫של מישהו, או למנוע התחזות ברשת.",
      "lang": "he",
      "type": "audio",
      "ref": "https://moodle.telhai.ac.il/mod/videostream/view.php?id=1140197"
    },
    {
      "offset_start": "0:05:54.120",
      "offset_end": "0:07:19.960",
      "text": "‫נדבר על סכמות של חתימה אלקטרונית, ‫שהיא הכלי לוידוי זהות. ‫נדבר על פונקציות גיבוב קריפטוגרפיות, פונקציות השש, דרך להפצת מפתחות, וזה גם קשור במה שנקרא קריפטוגרפיה קוונטית, ובסוף נדבר גם על בלוקצ'יין ומטבעות קריפטוגרפים. יש פה כמה ספרים, שלאף אחד מהם אני לא נצמד, אף אחד מהם הוא לא הטקסטבוק של הספר, אבל אפשר לייעזר בהם כדי להבין מושגים מסוימים. אם כי כל המידע נמצא באינטרנט, זאת אומרת, אם אתם לא מבינים מושג מסוים או רוצים לדעת יותר על מושג מסוים, חפשו אותו באינטרנט, אתם בטח תמצאו שם אתרים ומאמרים שעוסקים בזה, ובסוף אני שוב מציין פה את הספר של סיימון סינג, ואני מאוד ממליץ למישהו שיש לו קצת זמן ואוהב את הנושא. יהיו לנו שני סוגים של שיעורים, יהיו שיעורי הרצאה, כמו בכל קורס בעצם, שיעורי הרצאה, שבהם נלמד בעיקר חומר תיאורטי, ויש שיעורי תרגול, שבהם נממש מה שלמדנו בשיעורי הרצאה, באמצעות תוכניות בפייתון. הציון בקורס הוא 60 אחוז מטלות בית, 40 אחוז בחינה אמריקאית. המטלות, יהיו שלוש מטלות, בדרך כלל יש ארבע, אבל כיוון שהסמסטר הזה יותר קצר, יהיו שלוש מטלות, צריך להגיש את כולם.",
      "lang": "he",
      "type": "audio",
      "ref": "https://moodle.telhai.ac.il/mod/videostream/view.php?id=1140197"
    },
    {
      "offset_start": "0:07:20.240",
      "offset_end": "0:08:14.000",
      "text": "אפשר להגיש אותן בזוגות, אוקיי? ובמטלות הבית יהיו גם תרגילים תיאורטיים וגם תרגילי תכנות, את התרגילים התיאורטיים אתם מגישים בקובץ PDF, ותרגילי התכנות אתם תגישו כמובן בקובץ פייטון. אוקיי? אז שפת התכנות, כמו שאמרתי, פייטון, יש פה כמה כלים שבהם אפשר לתכנת בפייטון. בשיעורים אנחנו נשתמש בפייט שם, שאני לא יודע אם אתם מכירים או לא, אבל כדאי להתרגל לסביבת עבודה הזאת. היא קצת יותר משוכללת מספיידר אנקונדה שבה השתמשנו בקורס מבוא למדעי המחשב. אז זהו, זאת הייתה הקדמה, ואני מצפה לראות אתכם בשיעור הראשון, בחמישי למאי. להתראות.",
      "lang": "he",
      "type": "audio",
      "ref": "https://moodle.telhai.ac.il/mod/videostream/view.php?id=1140197"
    },
    {
      "offset_start": "0:00:00.520",
      "offset_end": "0:01:43.120",
      "text": "שלום. היום זה שיעור הקדמה, או שיעור מבוא לתחום הקריפטולוגיה, נראה סקירה היסטורית ונלמד כמה מושגי יסוד בקריפטולוגיה. אתם רואים פה בפתיחה כמה דמויות מרכזיות מההיסטוריה של תורת העצפנות. ‫יש לנו פה את יולוס קיסר, ‫של שמו נקרצופן קיסר, שתראה אותו. ‫יש לנו את פומרי, המלכה הסקוטית, ‫שכיפחה את חייה ‫כתוצאה מתגלית קריפטולוגית. ‫יש לנו כאן את אלן תיורינג, ‫שלא צריך�בר עליו יותר מדי, כדי כולם מכירים את השם, ויש לנו פה את השלישייה של RSA, שמיר, רי ווסט ועדלמן, שהם אלה שהמציאו את הקוד RSA, שהוא קוד פורץ דרך בהיסטוריה של תורת העצבנות. אז שוב, מה זה קריפטולוגיה או קריפטוגרפיה? מי בנית קריפטו זה סודי, גרפיה זאת כתיבה, זאת תורה שעוסקת בפיתוח אלגוריתמים לצורך גם הסתרת תוכן של מידע, גם בדיקת מקוריות או זהות של מי ששולח את הידיעה, וכיוון ההפוך, כל השיטות לגילוי תוכן של ידיעות מוצפנות, או פריצה של צופנים, והכיוון ההפוך של בדיקת נכונות או מקוריות של ידיעה, כל השיטות לזיוף מקוריות של ידיעה. לא בגלל שאנחנו רוצים לזייף או לפרוץ, אלא בגלל שאנחנו רוצים להתגונן מפני הדברים האלה.",
      "lang": "he",
      "type": "audio",
      "ref": "https://moodle.telhai.ac.il/mod/videostream/view.php?id=1151281"
    },
    {
      "offset_start": "0:01:43.120",
      "offset_end": "0:03:16.300",
      "text": "אז כמו שבהגנת סייבר צריך ללמוד את כל השיטות של ההאקרים כדי שאפשר יהיה להתגונן, אז גם כאן אותו דבר. אז כמה מושגי יסוד. פליין טקסט זה אותו מסמך מקורי שאנחנו רוצים להצפין, זה המסמך הגלוי שאותו רוצים להצפין, וסייפר טקסט, הכתב נסתר, זה המסמך אחרי שהוא עוצפן. סייפר או קוד זה צופן, זה אלגוריתם להפיכת פליינטקסט לסייפר טקסט, וקי, מפתח, זה אותו מידע קריטי וסודי שמשמש את הצופן. ורק מי שיודע את המפתח יכול לפענח בצורה פשוטה. עצפנה, אינקריפטיון, זה תהליך של הפיכת פליינטקסט לסייפרטקסט, דקריפטיון זה התהליך ההפוך, שבו אנחנו הופכים את הסייפרטקסט לפליינטקסט בעזרת המפתח. קריפטואנליזה זה כאשר אנחנו עושים את זה בלי המפתח, זאת אומרת, כאשר אנחנו רוצים לפרוץ את זה ואנחנו לא יודעים את המפתח, והאטק או התקפה זה הפעולה של הפריצה. זאת אומרת, הקריפטואנליזה, השיטות של הקריפטואנליזה, הן כולם התקפות. כשאנחנו מדברים על התקפות, אז ראוי להיות מודע לפחות לשיטת התקפה הכי פשוטה, שהיא נקראת brute force, או בעברית חיפוש מפתחות ממצה. זה פשוט מנסים את כל המפתחות האפשריים עד שמגלים את המפתח הנכון. מה זאת מערכת צפינה?",
      "lang": "he",
      "type": "audio",
      "ref": "https://moodle.telhai.ac.il/mod/videostream/view.php?id=1151281"
    },
    {
      "offset_start": "0:03:16.800",
      "offset_end": "0:04:37.200",
      "text": "כן, אז מערכת צפינה הוא מערכת קריפטוגרפית, כאשר מדובר על צופן, בעצם מדברים על מערכת קריפטוגרפית. אנחנו מדברים פה על שלושה מרחבים או קבוצות. קבוצת כל הפליינטקסטים האפשריים, כל המסמכים או כל היחידות, יותר נכון להגיד כל יחידות פליינטקסט, כי גם את הפליינטקסט או המסמך אפשר לחלק ליחידות, למשל כמו אותיות או מילים, מה שאנחנו בוחרים, או בלוקים שמוגדרים מראש. אז קבוצת כל הפליינטקסטים האפשריים זה אם, קבוצת כל הסייפרטקסטים האפשריים וקבוצת כל המפתחות האפשריים. אז וצופן תמיד מוגדר מעל איזושהי מערכת צפינה או מעל איזושהי שלישייה כזאת של פליינטקסטים, סייפרטקסטים ומפתחות, אז הוא זוג של אלגוריתמים, אלגוריתם אחד להצפנה E זה אלגוריתם הצפנה, הוא לוקח מפתח ומסמך ומקבל סייפר טקסט, ואלגוריתם פענוח לוקח, מקבל מפתח וסייפר טקסט ונותן לנו מסמך גלוי. וכמובן צריך ששתי הפונקציות האלה יהיו אופחיות, זאת אומרת, אם אני מצפין את מסמך M בעזרת מפתח K, ואחר כך מפענח בעזרת אותו מפתח K, אני אמור לקבל חזרה את המסמך שאיתו התחלתי. כן? והתנאי הזה נקרא תנאי העקביות.",
      "lang": "he",
      "type": "audio",
      "ref": "https://moodle.telhai.ac.il/mod/videostream/view.php?id=1151281"
    },
    {
      "offset_start": "0:04:38.800",
      "offset_end": "0:05:50.600",
      "text": "עכשיו, כשאני מדבר על צופן בתור אלגוריתם יעיל, אני מתכוון, בדרך כלל אנחנו מתכוונים שהאלגוריתם העצפנה והפי התנוח הם אלגוריתמים יעילים, זאת אומרת שהסיבוכיות שלהם היא פולינומיאלית באורך הקלט. ופולינומיאלית אנחנו מתכוונים בריבוע לכל עתר בשלישית. אוקיי. אז אלה מושגי יסוד, ועכשיו אנחנו נשתמש במושגים, אנחנו נראה איך המושגים האלה תופסים לאורך ההיסטוריה, או בצופנים שהומצאו לאורך ההיסטוריה. הצופן הראשון שאנחנו רוצים לדבר הוא צופן מונואלפבטי. צופן מונואלפבטי הוא צופן שאם יש מפתח נתון, אז תמיד אותה יחידת פלנטקסט תוצפן אותו דבר. אנחנו נראה דוגמה. אז הצופן הראשון הוא צופן קיסר, זה הצופן העתיק ביותר שידוע, הוא אומר, קיסר ולילוס קיסר, האימפריה הרומית, הם כבר השתמשו באותיות לטיניות באותה תקופה, הוא אומר ככה, אם אני רוצה להצפין מסמך, מן הסתם הוא מורכב מאותיות, כן, יש בו טקסט, אז כל אות הוצפן על ידי אות אחרת.",
      "lang": "he",
      "type": "audio",
      "ref": "https://moodle.telhai.ac.il/mod/videostream/view.php?id=1151281"
    },
    {
      "offset_start": "0:05:50.600",
      "offset_end": "0:07:25.300",
      "text": "אבל עם חוקיות קבועה, זאת אומרת, עם איזושהי הזזה ציקלית, זאת אומרת, למשל, הזזה יכולה להיות בשלוש, אז במקום A, אנחנו את A מצפינים ב-D, ואז את B ב-E, ו-C ב-F, וכן הלאה, ובסוף, כשאנחנו מגיעים לאותיות אחרונות, אז X, Y, Z כבר מוצפנות ב-A, B ו-C. אוקיי? אז, והאזזה יכולה להיות ב-3, ב-4, ב-5, ולמעשה יש 25 אפשרויות לאזזה, כן, יש גם את האזזה שלא מזיזים כלום, אבל את זה אין טעם, אז יש 25 אפשרויות להזזה כזאת. אם אני רוצה להדגים את זה במונחים שכבר ראינו, אז אם אני רוצה לעשות את זה בצורה יותר חישובית, אז במקום כל אות, לכל אות אנחנו מתאימים מספר, A זה 0, B זה 1 וכן הלאה, עד Z שזה 25. ואז למעשה הפליין טקסטים והסייפר טקסטים וגם המפתחות, זו אותה קבוצה, זה מספרים מ-0 עד 25. כן, אני מצפין אותיות, אז אני מצפין מספרים בין 0 ל-25, אני מקבל גם מספרים בין 0 ל-25, וגם המפתח הוא מספר בין 0 ל-25. אז מהי פעולת העצפנה? אנחנו מחברים לכל plain text x את המפתח, ואנחנו עושים את זה מודולו 26, כדי שבסוף זה יהיה ציקלי, כדי ש-x, y, האותיות האחרונות כבר יוצפנו על ידי אותיות ראשונות באלף ב', מהו הפיענוח?",
      "lang": "he",
      "type": "audio",
      "ref": "https://moodle.telhai.ac.il/mod/videostream/view.php?id=1151281"
    },
    {
      "offset_start": "0:07:28.700",
      "offset_end": "0:08:53.000",
      "text": "החזרה את המפתח, ואז חוזרים, חזרה ל-X המקורי. ועכשיו שתי שאלות, איזה יתרון יש לצופן קיסר, ואיזה חיסרון יש לצופן קיסר? אז תחשבו קצת. אולי כדאי להתחיל דווקא מהחיסרון, כמו שאמרתי קודם, כן? ישות 25 מפתחות אפשריים. בכל זאת, אי אפשר להתעלם מהיתרון של צופן קיסר, וזה שהוא קודם כול צופן מאוד פשוט, ושנית, המפתח הוא מאוד קטן, קל לזכור אותו. זאת אומרת, זה שיש מעט מפתחות אפשריים, גם אומר שהמפתחות הן קטנים, ושקל לזכור אותם זאת אומרת, זה שיש מעט מפתחות אפשריים, גם אומר שהמפתחות הן קטנים, וקל לזכור אותן, שזה גם יתרון. אבל כמובן צופן קיסר הוא צופן מאוד לא יעיל, לא רק היום, אלא גם לפני אלפיים שנה כבר אפשר היה בקלות לפרוץ אותו, ולכן היו צריכים משהו יותר טוב, ולכן הרעיון הבא הוא מתבסס על צופן קיסר, אבל הוא מארחיב אותו. זאת אומרת, אם קודם בצופן קיסר לקחנו את האותיות ועשינו עליהן תמורה, אבל תמורה מאוד מוגדרת של אותה הזזה של כל האותיות,",
      "lang": "he",
      "type": "audio",
      "ref": "https://moodle.telhai.ac.il/mod/videostream/view.php?id=1151281"
    },
    {
      "offset_start": "0:08:53.000",
      "offset_end": "0:10:21.640",
      "text": "צופן הזזה, הצבא אומר, לא, נבחר תמורה כלשהי, כן? יש לי 26 אותיות, בואו נעשה תמורה לאותיות האלה, כן? למשל, אנחנו יכולים לראות כאן תמורה כזאת, כן? האותיות AB וC. האותיות כל אחת מוחלפת על ידי אות אחרת, אוקיי? כל אחת מוחלפת על ידי אות אחרת, זהו. אז אם יש לי ידיעה מסוימת, ואני מחליף לפי הכלל הזה, אני מקבל איזושהי תוצאה, ואני מתעלם מרווחים וסימני פיסוק, אז אני מקבל משהו כמובן מאוד לא קרי. ואם אני, דיברנו על צופן קיסר קודם, שהיו 25 מפתחות אפשריים, אז כאן כבר יש לנו הרבה יותר מפתחות אפשריים, יש לנו 26 הצרת מפתחות אפשריים, אם מדובר באלף בית הלטין, אוקיי? העצפנה היא פשוט הפעלה של תמורה, של התמורה על כל אות, והפיענוח הוא הפעלה של התמורה ההפוכה. וכשאני כותב סיגמה מינוס 1, אז אנחנו בעצם רואים תכונה שלא אמרתי קודם, אבל חייבת להיות פונקציית עצפנה, ושהיא צריכה להיות פונקציה הפיכה. זאת אומרת, פונקציית עצפנה צריכה להיות פונקציה חד-חד ערכית ועל. אוקיי? כדי שיהיה לה גם את הפונקציית הפיענוח, היא הפונקציה ההפוכה שלה.",
      "lang": "he",
      "type": "audio",
      "ref": "https://moodle.telhai.ac.il/mod/videostream/view.php?id=1151281"
    },
    {
      "offset_start": "0:10:24.360",
      "offset_end": "0:11:49.520",
      "text": "אז שוב, אז מה היתרון בולט של צופן הצבא? יש הרבה מפתחות, זאת אומרת שבברוט פורס ייקח לנו המון זמן לנסות את כל המפתחות. חיסרון בולט של צופן הצבא? אז קודם כל, חיסרון אחד כבר ראינו קודם, והוא החיסרון שהמפתח הוא תמורה, אוקיי? המפתח הוא תמורה, ותמורה זה משהו ארוך, קשה לזכור אותו, צריך לרשום אותו איפשהו, צריך לשמור את הפתק הזה שעליו זה רשום. אבל יש לזה עוד חיסרון מאוד בולט, לצורך הנה זה, והוא העובדה שאפשר לעשות ניתוח שכיחויות לסייפרטקס. נניח שיש בידי סייפרטקס, אז אני עכשיו בודק אותו ומתחיל לספור כמה פעמים מופיעה קולעות, ואז אני רואה שאותיות מסוימות מופיעות יותר פעמים ואותיות מסוימות מופיעות פחות פעמים, ואז אני יודע שהאותיות שמופיעות יותר פעמים הן מן הסתם מצפינות את האותיות שמופיעות יותר פעמים באלף בית הלטיני, אם מדובר באלף בית הלטיני. ואותיות שמפיעות מעט הן כנראה מצפינות אותיות שהן יותר נדירות באלף בית הלטיני, ואם יש לי מספיק סייפר טקסט ואני עושה, ויש לי מספיק זמן לשבת ולנתח, אני בסופו של דבר יכול לפרוץ את הצופן הזה, ועל זה כבר עלו המתמטיקאים הפרסים במאה ה-9 לפני הספירה,",
      "lang": "he",
      "type": "audio",
      "ref": "https://moodle.telhai.ac.il/mod/videostream/view.php?id=1151281"
    },
    {
      "offset_start": "0:11:49.520",
      "offset_end": "0:13:22.240",
      "text": "סליחה, במאה ה-9 לספירה, זאת אומרת, בערך לפני 1,200 שנה, ויש פה מסמך שמתעד את הרעיון הזה מאותה תקופה. כדאי לציין שאת זה כבר ידעו המתמ�יקאים הפרסים במאה התשיעית, כמו שאמרתי, אבל באירופה לקח עוד איזה 500 שנה לעלות על הרעיון. אנחנו רואים פה את השכיחויות של אותיות באלף בית הלטיני, כן? אנחנו רואים שהאות E היא הכי נפוצה, אחריה האות T וכן הלאה. זאת אומרת שאם יש לי סייפר טקסט והאות, נאמר, איקס, היא הכי נפוצה שם, יש סיכוי טוב שהאות איקס היא בעצם זאת שמצפינה את האותי. כמו שאמרתי, באירופה עלו על הרעיון רק איזה 500 שנה אחרי זה. סיפור מפורסם, ואני אעשה את זה בקצרה, זה הסיפור של מרי, המלכה הסקוטית, שהייתה טוענת לכתר באנגליה, ובאותה תקופה שלטה אליזבת הראשונה. אליזבת הרגישה מאוימת מצד מרי סטיוט, ולכן קלעה אותה, בגיל 18 הכניסה אותה לכלא, ושם היא חיה בכלא, והיא הייתה מתכתבת עם אנשים. חלק מההתכתבויות שלה היו באמצעות צופן, והצופן מסתבר שזה היה צופן הצבא, והמתמטיקאים או המדענים בחצרה של אליזבת הראשונה ניתחו את הצופנים האלה, ובסופו של דבר הצליחו לפענע חלק מהצופנים האלה באמצעות ניתוח שריכויות,",
      "lang": "he",
      "type": "audio",
      "ref": "https://moodle.telhai.ac.il/mod/videostream/view.php?id=1151281"
    },
    {
      "offset_start": "0:13:22.240",
      "offset_end": "0:14:16.680",
      "text": "ואז גילו שמרי ביחד עם אנשים שהיו מחוץ לכלא, קשרה קשר להדיח את אליזבת, מבחינת אליזבת זאת הייתה הוכחה לזה שמרי חותרת דרכה, והיא הוציאה אותה להורג, ויש לנו פה ציור שמדגים את זה.אז נשאלת השאלה, היה לנו צופן כל כך טוב, עם מפתחות כל כך גדולים, שניתוח של brute force הוא לא יעיל, אבל יש שיטה אחרת לפרוט, והשאלה היא, האם יש אפשרות לצופן שהוא עמיד בפני ניתוח שכיחויות. זאת אומרת שלא יהיו שם הבדלים גדולים בשכיחויות בתוך הסייפר-טקסט. והתשובה היא כן, ועל זה נדבר בסרטון הבא.",
      "lang": "he",
      "type": "audio",
      "ref": "https://moodle.telhai.ac.il/mod/videostream/view.php?id=1151281"
    },
    {
      "offset_start": "0:00:00.880",
      "offset_end": "0:01:40.000",
      "text": "אז שוב, שלום לכולם, צהריים טובים לקורס. ברוכים הבאים לקורס מבוא לקריפטולוגיה. הקורס הזה במקור הוא אמור להיות, והוא אכן, כשאתם רואים קורס מקוון, הוא היה אמור להיות הקורס המקוון, שאולי חלקכם בוחרים בתור הקורס המקוון בחובות שלכם. בינתיים כל הקורסים נהיו מקוונים בשנה. אני גם פחות ממה שתכננתי להכין אותו כקורס מקוון, עם סרטונים מוכנים מראש, אבל בכל מקרה, חלק מהדברים אני כן אשים סרטונים מראש, הרוב אני אקליט את מה שאני מלמד כאן, כמו עכשיו. אז כפי ששמתם לב וגם הודעתי לכם, אני שמתי כמה סרטונים כבר במודל, אחד זה סרטון של תיאור הקורס, דרישות, חלוקת ציון וכן הלאה, אז הכל נמצא שם. בגלל קיצור הסמסטר, אני אעדיף את הפרק הראשון, שהוא פרק של רקע וקצת סקירה היסטורית וקצת סיפורים מעניינים, אני אעדיף לא להעביר אותו כאן, כי אם אני צריך לבחור איזה נושאים להוריד, אז זה נושא שאולי נחמד ונעים לנותן קצת מכניס להווירה, אבל הוא לא, אין שם חומר ממשי, מתמטי, בשביל ללמוד. אז אני אשאיר לכם לצפות בסרטונים בזמנכם הפנוי, מה שהעליתי לכם כבר. מי ששפה אז יודע, אז אולי יש לו יותר מושג למה לצפות.",
      "lang": "he",
      "type": "audio",
      "ref": "https://moodle.telhai.ac.il/mod/videostream/view.php?id=1160317"
    },
    {
      "offset_start": "0:01:40.000",
      "offset_end": "0:03:30.000",
      "text": "אני אסכם את הדברים, ואז אני אפתח את השיעור הזה בנושא הבא. כמובן שהחומר ההוא שבסרטונים אני לא אבחן עליו, אבל זה טוב לצפות בזה, וגם מעניין, וגם באמת נותן הבנה של מה שאנחנו הולכים לעשות. הקורס הזה, קורס בחירה, במקור יש בו חובת נוכחות, בעצם זה שהוא קורס בחירה, יש החלטה לא לחייב נוכחות באופן כללי בלימודים במכללה השנה, אז אני לא מחייב נוכחות. מה שאני כן רוצה לבקש מכם, שוב, זאת בקשה, להדליק מצלמות, מי שאין לזה כוח עליון שמונה את זה ממנו, יהיה לי יותר נעים לראות את מי שאני מדבר אליהם, גם כשאתם שואלים שאלות, יותר נעים לי להסתכל בפנים של מי שאני עונה לו, שאני לא ארגיש שאני פה מדבר על חלל ריק. קורס בזום דורש ממני ומכן קצת יותר עיכוז וקצת יותר ערנות, אז כי קל יותר להיות מוסך, לעשות דברים אחרים, אז אני מבקש, כן, להפעיל את ההערנות הזאת. הקורס הוא, לדעתי, קורס מאוד נחמד, קורס מעניין, אנחנו נלמד בו גם קצת מתמטיקה וגם קצת תכנות. הקורס מחולק להרצאות, שבהן אני אתן שיעור תיאורטי, ואחר כך אנחנו נתרגל חלק מהמושגים על ידי מימוש בשפת פייטון. כל השיעורים אני מקליט אותם ומעלה אותם.",
      "lang": "he",
      "type": "audio",
      "ref": "https://moodle.telhai.ac.il/mod/videostream/view.php?id=1160317"
    },
    {
      "offset_start": "0:03:32.000",
      "offset_end": "0:05:40.360",
      "text": "ושוב, אני מבקש בינתיים רק וואג'ט פה נענה לבקשתי להדליק מצלמה, אז שוב אני מבקש, אם אין איזה כוח עליון שמונע את זה מכם, אז בבקשה, תדליקו מצלמות ונראה אחד את השני. אוקיי, אז שוב, קורס בקריפטולוגיה, אני אעלה את המצגת הראשונה. יש פה קבוצה שלמה של סטודנטים שחיכת שאני אאשר אותם. אז שוב אני מתנצל בפני כל מי שחיכה ב-waiting room, זה לא אמור להיות ככה, זה פעם ראשונה שזה קורה, אני לא יודע למה זה. אז כל מי שנכנס עכשיו, כמו שאמרתי, הנושא הראשון של הקורס נמצא בסרטונים במודל, אני לא אעבור עליו, פשוט כי הוא פחות חיוני ללימודים ולהבנה של הקורס, אני צריך להוריד שלושה שבועות מתוך עשרה, זה אחד מאלה שהחלטתי להוריד, אני אסכם את המסקנות שעלו מהשיעור הזה, שאני לא אעביר כאן, אלא מופיע גם בשקפים וגם בסרטונים במודל. אז טוב, בואו נעשה רגע, מעלה את המצגת. החומר הזה הוא גם ירד מהמבחן, נכון? כן, אני גם רשמתי את זה בהודעה ששמתי לכם. זאת אומרת, לא צריך להשלים ‫את האסורטונים האלה, שאלתם. ‫לא חייבים בשביל ה... ‫זה נוסיף להבנה שלכם, ‫לא חייבים בשביל... ‫אני לא אשתן את השאלות מי נשמד. ‫כמובן שנצפה בכל זאת.",
      "lang": "he",
      "type": "audio",
      "ref": "https://moodle.telhai.ac.il/mod/videostream/view.php?id=1160317"
    },
    {
      "offset_start": "0:05:44.560",
      "offset_end": "0:07:54.900",
      "text": "‫מה קורה?טוב, אז הנושא הראשון זה צופני זרם, תכף אני אסביר מה זה, אוקיי? אבל לפני כן אני כן אראה כמה שקפים שהופיעו במצגת הראשונה, כדי שנבין על מה אנחנו מדברים. אוקיי, אז מה זה קריפטולוגיה? קריפטולוגיה בשפה פשוטה זה תורת העצבנות, מיוונית קריפטו זה סודי, גרפיה כתיבה, יש שני מושגים מקבילים, קריפטוגרפיה וקריפטולוגיה, מבחינתי הם אותו דבר, יש מי שמבחין ביניהם, מבחינתי זה אותו דבר, לוגיה זה תורה, זה תורת הסודיות, כן? בתרגום ישיר מיוונית. כן? התורה הזאת עוסקת ב... כיום, כן? כיום, אבל גם בימי קדם, בפיתוח אלגוריתמים, לצורך הסתרה של מידע, כן? של איזושהי ידיעה או מסמך. ואנחנו משתמשים בכלים קריפטוגרפיים גם כדי להבטיח את מקור הידיעה. זאת אומרת, לבדוק את האותנטיות של מי ששולח לכם משהו, או של מי שטוען שהוא מישהו. וכחלק מהתורה הזאת, גם הצד השני, שעוסק בפריצה של צופנים, זאת אומרת, בגילוי תוכן של ידיעות מוצפנות, וגם אם אמרתי שהקריפטולוגיה עוסקת גם באימות זהות של מישהו, אז הצד השני של זה, זה זיוף הזהות של מישהו, כן? אנחנו לומדים את זה לא כדי שנוכל לזייף מסמכים, אלא כדי שנוכל להתגונן מפני האפשרות הזאת.",
      "lang": "he",
      "type": "audio",
      "ref": "https://moodle.telhai.ac.il/mod/videostream/view.php?id=1160317"
    },
    {
      "offset_start": "0:07:56.400",
      "offset_end": "0:09:16.760",
      "text": "אוקיי. אז מה זה קריפטולוגיה? יש כמה מושגים שאנחנו נשתמש בהם. המושג הראשון הוא פליין טקסט. זה אותו תוכן שאותו גלוי, שאותו אנחנו רוצים להצפין. יש לנו מסמך שכל אחד יכול לקרוא אותו, יכול להבין אותו. אנחנו רוצים להצפין אותו כדי שלא כל אחד יוכל להבין אותו. והסייפר טקסט זה מה שאנחנו מקבלים אחרי שאנחנו מצפינים. זאת אומרת, התוצאה של ההצפנה זה הסייפר טherpick, זה אותו מסמך שאותו לא כל אחד יכול להבין. cypher זה צור מפן, זה אותו אלגוריתם שבו אנחנו משתמשים כדי להצפין וגם כדי לפענח, ו-key זה עוד מידע, זה המפתח שבעמצת אותו אנחנו מצפינים. אוקיי? אז אלה הארבעה המושגים שילוו אותנו לכל אורך הסמסטר. באנגלית, encryption זה תהליך העצפנה, decryption זה התהליך של הפענוח כאשר עושים את זה באופן חוקי, זאת אומרת, בעזרת המפתח, מי שיש לו את המפתח. אבל מי שאין לו את המפתח ורוצה לפרוץ, הוא ישתמש בכלים מתוך המושג של קריפטואנליזה, או באנגלית קריפטואנליסיס. זאת אומרת, זה כל האמצעים לפרוץ צופנים, וכדי לפרוץ אנחנו מבצעים מה שנקרא התקפה, או attack באנגלית.",
      "lang": "he",
      "type": "audio",
      "ref": "https://moodle.telhai.ac.il/mod/videostream/view.php?id=1160317"
    },
    {
      "offset_start": "0:09:16.760",
      "offset_end": "0:10:54.000",
      "text": "זאת אומרת, כל פעולה שנועדה לפרוץ צופן, בלי שיש לי את המפתח, בלי שיש לי את הרשות לעשות את זה, נקראת התקפה. כל פעולה שנעשית כדי להתחזות למישהו, כדי לזייף מסמך, כדי לזייף חתימה על מסמך, זו התקפה. התקפה זה מכלול הפעולות שהם נגד העצפנה, שהם נגד מי שמצפין. יש לנו את המושג של מערכת צפינה, אז כשאנחנו מדברים על צופן, בעצם אנחנו מדברים על מכלול של דברים. קודם כל, יש לנו קבוצה של פליין-טקסטים, מה אנחנו יכולים להצפין, כל מרחב האפשרויות של מה שאנחנו יכולים להצפין. אוקיי, תגידו זה יכולה להיות קבוצה אינסופית, אז בואו נניח שזאת לא קבוצה אינסופית, כי ברגע שאנחנו נניח מגבילים את הגודל של זה, אז זה כבר נהיה קבוצה סופית, נכון? C זה קבוצת כל ה-ciphertextים, זאת אומרת, כל מה שאנחנו יכולים לקבל כאשר אנחנו מצפינים, ו-K זה המרחב של כל המפתחות האפשריים. אז צופן הוא בעצם זוג של אלגוריתמים, אחד שמצפין ואחד שמפענח. אז אלגוריתם E, כן, קיצור של encryption. E זה אלגוריתם שמצפין, מה הוא עושה? הוא מקבל מפתח k, מפתח, והוא מקבל plain text, ובעזרת המפתח והפונקציה, הוא מצפין את ה-plain text, מקבלים cipher text.",
      "lang": "he",
      "type": "audio",
      "ref": "https://moodle.telhai.ac.il/mod/videostream/view.php?id=1160317"
    },
    {
      "offset_start": "0:10:54.000",
      "offset_end": "0:12:12.560",
      "text": "ואחר כך כשאני רוצה לפענח, אז אני משתמש בפונקציה d, שמקבלת את המפתח ואת ה-cipher text, נותנת לי חזרה את הפליים טקסט. ולמה אני אומר אלגוריתמים יעילים? כי זאת פעולה שאנחנו רוצים לעשות אותה ביומיום, זאת פעולה שמתבצעת, שאתם מבצעים אותה גם בלי להיות מודעים לזה ביומיום, כל פעם שאתם שולחים הודעת וואטסאפ, אתם מבצעים את הפעולה הזאת של הצפנה, גם בלי שאתם... כן, זה מתבצע באופן אוטומטי, אבל אתם עושים אותה, כן? אז אנחנו רוצים שאלגוריתם שעושה את זה יהיה מספיק יעיל, כדי שלא יהיה דיליי, בעיקר אם מדובר נגיד באיזושהי הודעה קולית, או אפילו בשיחת טלפון מוצפנת, שאנחנו לא רוצים שהצד השני צריך לחכות כדי לשמוע אותנו. אז אנחנו, האלגוריתמים לעצפנה ולפי הנוח, אמורים להיות אלגוריתמים יעילים, משהו שהוא פולינומיאלי נמוך בנפח של ה... כן? צריך להיות פולינומיאלי באורך של הכלת של האלגוריתם. ושתי הפעולות האלה, E ו-D, הם בעצם פעולות הופכיות אחת של השנייה. זאת אומרת, אם אני לוקח, אם אני מפענח את מה שהוצפני על ידי אי, אני צריך לקבל חזרה את הפליינטקס שאיתו התחלתי.",
      "lang": "he",
      "type": "audio",
      "ref": "https://moodle.telhai.ac.il/mod/videostream/view.php?id=1160317"
    },
    {
      "offset_start": "0:12:12.560",
      "offset_end": "0:13:30.000",
      "text": "זאת אומרת, אם אני מתחיל עם פליינטקס ומפתח, מצפין, ואחר כך מפענח, אני כמובן צריך לקבל חזרה את מה שהצפנתי. כן, אז הפעולות אי ודי, או הפונקציות האלה, הן פונקציות הופכיות. והתנאי הזה נקראD, או הפונקציות האלה, הן פונקציות הופכיות. והתנאי הזה נקרא תנאי העקביות. עכשיו, מי שעבר על פרק המבוא, ומי שיסתכל עליו, אומר שראה שיש שם כמה מסקנות, כן, בעקבות, נגיד, הפרק הזה, אני... יש שם סקירה היסטורית של ההיסטוריה של הקריפטולוגיה, כמה שלבים חשובים בהיסטוריה, כן? החל מפחות או יותר לפני אלפיים שנה ועד היום, ועד המאה, תחילת המאה ה-20, נאמר ככה, אז המסקנות שעולות משם, אם אנחנו רוצים צופן טוב, הוא צריך להיות קודם כל מה שנקרא צופן פולי-אלפבטי. מה זה אומר פולי-אלפבטי? זה אומר שאם יש לי בפליין טקסט איזה שהן חזרות, אני לא אראה את אותן חזרות בסייפר טקסט. למשל, אם יש לי האות A בפליין טקסט, והיא מופיעה כמה פעמים, אז היא לא תוצפן אותו דבר. זאת אומרת, אם A מוצפנת בצורה מסוימת בפעם הראשונה, אם היא מופיעה עוד פעם, היא לא תוצפן אותו דבר.",
      "lang": "he",
      "type": "audio",
      "ref": "https://moodle.telhai.ac.il/mod/videostream/view.php?id=1160317"
    },
    {
      "offset_start": "0:13:30.000",
      "offset_end": "0:14:59.940",
      "text": "כדי שאי אפשר יהיה לקחת את ה-cipher text ולעשות עליו כל מיני ניתוחים, שבסופו של דבר יאפשרו לפו, אוקיי, מה זה מפתח? מפתח הצפנה. מפתח הצפנה זה משהו שאנחנו רוצים לזכור, כיוון שאנחנו רוצים לזכור אותו, כן? אז הוא צריך להיות קצר. אז מה שאני לא יכול לעשות עם המפתח, זה לקחת ולשכפל אותו, אם אני צריך להצפין הרבה דברים, להצפין כל הזמן עם אותו מפתח. אוקיי? אז אני לא צריך... אז אסור לי שתהיה איזושהי מחזוריות במפתח, ותכף נדבר על מה זה אומר לגבי מה שאנחנו הולכים להצפין עוד מעט. ומסקנה שלישית שעולה מהלוטוח שהיה שם, זה שאם אני רוצה צופן טוב, צופן עמיד לפריצה, הוא לא יכול להתבסס על פעולה מתמטית שייך ורק טרנספורמציה לינארית. טרנספורמציה לינארית, אתם יודעים, זה כפל במטריצה, אוקיי? אז אני לא יכול להתבסס על הפעולת הצפנה שלי, שהיא פעולה מתמטית, בסופו של דבר, כמו שאתם תראו, הכל פה הוא מתמטיקה, הפעולה הזאת לא יכולה להיות פעולה לינארית, או היא לא יכולה להיות פעולה לינארית בלבד. יכול להיות שהפונקציה שלי תהיה הרכבה של כמה חלקים, וחלק מזה יהיה לינארי, ואני לא יכול להיות שכל...",
      "lang": "he",
      "type": "audio",
      "ref": "https://moodle.telhai.ac.il/mod/videostream/view.php?id=1160317"
    },
    {
      "offset_start": "0:15:00.480",
      "offset_end": "0:16:58.500",
      "text": "לא יכול... לא יכול להיות שכל הפעולה של ההצפה תהיה לינארית, למה זה? בגלל שזה מאפשר פריצה די בקלות על ידי פתרון של מערכת משוואות לינאריות, ואנחנו לא רוצים את זה, אוקיי? אז אלה המסקנות, אני רוצה שהצופן, שמחזוריות או תפוסים או פאטרנים בפליינטקסט לא יתורגמו לפאטרנים בסייפר טקסט, אני רוצה שהמפתח לא יהיה מחזורי, ואני רוצה שהפעולה המתמטית שאני מבצע לא תהיה פעולה ליניארית. וזה, שלושת המסקנות האלה, הם יובילו אותנו לאורך, שוב, לאורך כל הסמסטר. שאלות עד כאן. בעקבות כל המסקנות האלה, בתחילת המאה העשרים, יש אנשים בחדרה המתנן. אני, כל מי שמופיע לי פה, אני אישרתי אותו. שוב, אני לא יודע למה יש לי את החדר המתנה הזה, אני לא יודע מאיפה הוא צץ, אני עד עכשיו ארבע שנים למד בזום, זה עוד לא קרה לי, אז אני לא יודע, אני צריך לברר את זה, אבל אני מתנצל מפני כל מי שענתין. אוקיי. עם כל השלוש מסקנות שהראיתי לכם, בתחילת המאה העשרים היה חוקר בשם ורנאם, והוא הציע, והוא אמר, אוקיי,, כן, אנחנו בעידן המחשב, הכל זה, כל המידע הוא בינארי, כן? גם אם הוא לא נראה לנו בינארי, מאחורי זה יש, מה שיש מאחורי זה זה נתונים בינאריים.",
      "lang": "he",
      "type": "audio",
      "ref": "https://moodle.telhai.ac.il/mod/videostream/view.php?id=1160317"
    },
    {
      "offset_start": "0:16:58.500",
      "offset_end": "0:18:23.760",
      "text": "אם יש לכם טקסט או מספרים מסרוניים או לא יודע מה, או תמונות, מאחורי זה הכל בינארי. אז הוא אומר ככה, יש לי מסמך שהוא מחוזת בינארית, כן? מחוזת בינארית זה 0, 1, מחוזת בינארית באורך n, 0 ו-1. המפתח הוא גם בינארי, כן? כל הנתונים במחשב הם בינאריים, אוקיי? וגם הסייפר טקסט בסופו של דבר יהיה בינארי, כי כל הנתונים במחשב הם בינאריים, וגם הסייפר טקסט בסופו של דבר יהיה בינארי, כי כל הנתונים במחשב הם בינאריים. אז בואו נראה, מה יותר קל מלקחת את הפליין טקסט ואת המפתח, ולעשות קסור ביניהם, וזה יהיה התוצאה של העצפנה, זה הסייפר-טקסט, כן? אם מישהו לא יודע את המפתח, הוא לא יוכל לגלות את הפליין-טקסט, אוקיי? אז זה יהיה העצפנה, ופיהנוח, אתם יודעים שפעמיים לעשות קסור עם אותו דבר מחזיר אותנו לאיפה שאין, אז הוא אומר, אוקיי, עכשיו יש לי סייפר-טקסט, בוא נעשה לו קסור עם המפתח, ואנחנו נקבל חזרה את אם. נכון? כי אם אני אעשה לדבר הזה קסור עם המפתח, כן, קסור עם עצמו זה אפס, כי כל דבר קסור עם עצמו זה אפס, ואפס, קסור עם אם זה חזרה נותנת אם. דניאל, המפתח זה פר הודעה?",
      "lang": "he",
      "type": "audio",
      "ref": "https://moodle.telhai.ac.il/mod/videostream/view.php?id=1160317"
    },
    {
      "offset_start": "0:18:33.000",
      "offset_end": "0:19:47.680",
      "text": "כן, זאת שאלה טובה, כן? אז כן, אז המפתח הוא פר הודעה. עכשיו, מה החיסרון הגדול של ההצעה הגאונית של ורנה? מפתח ארוך? מפתח ארוך, כן, מפתח ארוך. אם יש לי פליינטקסט באורך n, ונניח שהn הזה הוא מיליון, אז עכשיו אני צריך מפתח באורך מיליון. אז תעזבו את זה שאני, איך אני אזכור מפתח באורך מיליון, איך אני אשמור מפתח באורך מיליון. אני צריך גם להעביר אותו לצד השני, למי שאמור לפענח. אם אני יכול להעביר לו מפתח באורך מיליון, למה אני כבר לא אעביר לו את הפליינטקסט, וזהו. נכון? ואם מישהו מאזין לתקשורת בינינו, אז כמו שאני לא רוצה להעביר לו את הפליינטקסט, כי אז מי שיאזין ידע אותו, אני גם לא רוצה להעביר לו את המפתח, כי אז הוא ידע את המפתח. כן? אז זה לא רעיון טוב. כן, יש פה דוגמה. זה לא רעיון טוב שהמפתח יהיה באורך של הפליינטקסט. הפליינטקסט יכול להיות כל דבר, הוא יכול להיות באורך כלשהו, הוא יכול להיות מסמך מאוד ארוך, יכול להיות קצר, יכול להיות ארוך, אבל המפתח צריך להיות משהו קומפקטי. אז הרעיון הזה של ורנאם הוא לא רעיון יסים, הוא לא רעיון מעשי, אבל הוא כן נותן לנו איזשהו בסיס תיאורטי כדי להתחיל לעבוד.",
      "lang": "he",
      "type": "audio",
      "ref": "https://moodle.telhai.ac.il/mod/videostream/view.php?id=1160317"
    },
    {
      "offset_start": "0:19:47.680",
      "offset_end": "0:21:00.960",
      "text": "מה הבסיס התיאורטי כדי להתחיל לעבוד? המפתח, כמו שהוא אצל ורנר, הוא מכרוזת אקראית. כן? מכרוזת אקראית. הוא צריך להיות מכרוזת אקראית, כי אם הוא לא אקראית, אם יש שיטה לחשב אותו, מישהו יעלה על השיטה וידע את המפתח. איך נדבר על זה? אז הוא חייב להיות מכרוזת אקראית, אם יש שיטה לחשב אותו, מישהו יעלה על השיטה וידע את המפתח. איך נדבר על זה? אז הוא חייב להיות מחוזת אקראית. אז ורנר אומר, אוקיי, כך מחוזת אקראית, הסקסורים הפלנטקסט קבל סייפרטקסט. אבל הנקודה החשובה במפתח זה שהוא אקראי, אז הפתרון זה להגיד, אוקיי, אני לא יכול להרשות לעצמי, זה לא מעשי לעבוד עם מפתח מאוד ארוך. אבל בואו נחשב מפתח בצורה לא אקראית, אבל שיראה אקראי. שיראה אקראי. זה הרעיון. זאת אומרת, בואו ניצור מפתח ארוך, כך שהוא לא יהיה אקראי, אבל הוא יראה אקראי. וזה הרעיון מאחורי הדבר הבא שאנחנו נלמד, שזה PRG, Pseudo Random Generator, כן? רשת אבות של Pseudo Random Generator. זאת אומרת, יוצר פסאודו-רנדומלי. הוא לא באמת רנדומלי, הוא פסאודו-רנדומלי.",
      "lang": "he",
      "type": "audio",
      "ref": "https://moodle.telhai.ac.il/mod/videostream/view.php?id=1160317"
    },
    {
      "offset_start": "0:21:00.960",
      "offset_end": "0:22:01.000",
      "text": "עכשיו, כולכם מכירים יוצרים פסאודו-רנדומלי. עכשיו, כולכם מכירים יוצרים פסאודו-רנדומליים. כל פעם שאתם מפעילים פונקציה רנדום בפייתון למשל, או בשפה אחרת, אז אם אתם לא משתמשים בפונקציה מאוד מיוחדת, אתם בעצם משתמשים ביוצר פסאודו-רנדומלי. זאת אומרת, הוא לא באמת נותן לכם מספר אקראי, הוא נותן לכם מספר שמחושב על ידי איזושהי נוסחה. וכמו שהמחשב שלכם יכול לחשב את המספר הזה על ידי נוסחה, גם מישהו אחר יכול, כן? אז לא כדאי להשתמש ברנדום כדי לייצר מפתח עצמם. אוקיי, אז כדי להבין את העבודה שלנו עם פסודו-רנדום ג'נרטור, אנחנו צריכים קצת להבין הסתברות. אז זה הדבר הבא, אנחנו רוצים להבין הסתברות. אני אעשה רגע הפסקה בשביל שיהיו לי הקלטות יותר קצרות.",
      "lang": "he",
      "type": "audio",
      "ref": "https://moodle.telhai.ac.il/mod/videostream/view.php?id=1160317"
    },
    {
      "offset_start": "0:00:00.000",
      "offset_end": "0:01:47.720",
      "text": "אוקיי, אז כפי שאמרתי, הנושא הבא הוא צופן בלוקים. אז בואו נראה מה זה צופן בלוקים בהשוואה לצופן זרם, אז אני אעלה פה את המצגת. כן, וזה הנושא הבא, צופן בלוקים הוא מודלי פעולה, דווקא אני אסביר מה זה מודי פעולה, אבל לפני כן אני אסביר מה זה צופן בלוקים. אוקיי, צופן זרם, כן? צופן זרם בעצם אומר, אפשר להצפין משהו באופן רציף. זאת אומרת, יש לי מידע או אינפוט שמגיע אליי באופן רציף, לאו דווקא בחבילה אחת, למשל שיחת טלפון, כן? אותות דיבור שאנחנו רוצים להצפים, אז השיחה מתקיימת, וככל שהיא ממשיכה, אז יש לנו יותר פליין טקסט בעצם, יותר חומר להצפין. ותוך כדי זה שהplain text מגיע, אנחנו צריכים להצפין אותו. אוקיי? אז בצופן זרם, אנחנו צריכים, ראינו איך צופן זרם עובד, יש לנו seed, ועכשיו אנחנו מתחילים, ממשיכים, יוצרים איזושהי מכרוזת ביטים בהתאם לאורך שאנחנו צריכים. ואז ככל שהביטים מתקדמים, אנחנו עושים קסור. אבל אני לא חייב שהפליין טקסט יהיה גמור, שיהיה לי את כל הפליין טקסט, כדי שאני אוכל להתחיל להצפין, כי כל הפעולה של ההצפנה היא בסך הכל קסור. אז יבואו עוד ביטים, אני אעשה גם להם קסור. זה צופן זל.",
      "lang": "he",
      "type": "audio",
      "ref": "https://moodle.telhai.ac.il/mod/videostream/view.php?id=1165271"
    },
    {
      "offset_start": "0:01:49.040",
      "offset_end": "0:03:20.000",
      "text": "צופן בלוקים זה משהו אחר. בצופן בלוקים יש לי פליין טקסט, ועכשיו אני צריך להצפין אותו, אוקיי? אז מה אני עושה? אני מחלק אותו לחתיכות שנקראות בלוקים, ואני מצפין כל בלוק בנפרד. אוקיי? אז מה זה צופן בלוקים? צופן בלוקים הוא בעצם פונקציה, זאת הפונקציה, שמקבלת שני קלטים, היא מקבלת את הפליינטקסט, מקבלת מפתח, שניהם באורך קבוע, אוקיי, באורך קבוע, 118 ביט, 196 ב מ-98 ביט, 12 ביט, לא משנה, זה תלוי בצופן. כן, הם לא חייבים להיות באותו גודל, המפתח והפליינטקסט, אבל הם בגודל קבוע, והפונקציה מקבלת ששני הקלטים האלה עושה מה שהיא עושה ונותנת לנו סייפר טקסט, בלוק של סייפר טקסט, שהוא גמול באורך קבוע. כך נראית, זאת אומרת, זה צופן בלוקי. כן, יש לנו כמה צופני בלוקים נפוצים, אחד מהם זה דז, שעליו אנחנו נדבר בשיעור הזה, צופן אחר ויותר חדיש זה AES, נדבר עליו בשיעור הבא, ויש עוד צופן שהוא מאוד... יש עוד כמה צופנים ידועים שהופיעו, חלקם הוזכרו בסרטים שונים, Idea, Blowfish וכן הלאה. בצופני בלוקים יש להם מאפיינים, אחד המאפיינים זה מה הוא גודל הבלוק ומה גודל המפתח.",
      "lang": "he",
      "type": "audio",
      "ref": "https://moodle.telhai.ac.il/mod/videostream/view.php?id=1165271"
    },
    {
      "offset_start": "0:03:20.000",
      "offset_end": "0:04:57.980",
      "text": "אז בדס גודל הבלוק הוא 64 ביט, גודל המפתח 56 ביט למשל, ב-AS הם בגודל כפול לפחות, זאת אומרת, המפתח והבלוק הם לפחות בגודל 128 ביט, וזה מגיע עד 256, יש תופני בלוקים עם יותר גמישות בהגדלים האלה, למשל Blowfish, אבל אנחנו נדבר פה על שניים. אז אם אני רוצה להצפין פליין טקסט, אז כמו שאמרתי קודם, אני לוקח את הפליין טקסט, מחלק אותו לבלוקים P1, P2 עד PM, בגודל קבוע, כמה שצריך, אם האורך של הפלנטקסט לא מתחלק בגודל הקבוע, אז צריך לרפד את זה, צריך להוסיף קצת לבלוק האחרון כדי שזה יהיה בגודל המתאים, זה נקרא ריפוד. ואז אני לוקח את כל אחד מהבלוקים האלה, כל אחד מהבלוקים האלה, ומצפין באמצעות הצופן ומקבל סייפר טקסט. ומצפין, כן, מצפין באמצעות המפתח, המפתח הוא אותו מפתח, זאת אומרת, אם יש לי מיליון בלוקים, אז אני אעשה פה מיליון עצפנות באותו מפתח. אוקיי? מפתח הוא אותו מפתח. אם מחר אני שוב ארצה להצפין, אני כבר אשתמש במפתח אחר, אבל ברגע שיש לי פליינטקסט ואני רוצה להצפין אותו, חלק אותו לבלוקים, וכל אחד מהבלוקים אני מצפין באותו מפתח. מה שנקרא session key. יבוא לי בעוד דקה פליינטקסט אחר ואני רוצה להצפין אותו,",
      "lang": "he",
      "type": "audio",
      "ref": "https://moodle.telhai.ac.il/mod/videostream/view.php?id=1165271"
    },
    {
      "offset_start": "0:04:57.980",
      "offset_end": "0:06:47.640",
      "text": "סביר להניח שאני אשתמש במפתח אחר. אבל בואו נניח שכרגע יש לנו בלוקים ויש לנו פליין טקסט, אני אחלק אותו לבלוקים וכל בלוק, כל הבלוקים מוצפנים באותו מבטח. ובסוף מכל בלוק אני מקבל סייפר טקסי, או שיש איזושהי תלות בין הפעולות? האם כשאני מצפין את בלוק מספר 2, ההצפנה של בלוק מספר 2, איך שהוא מושפעת מההצפנה של בלוק מספר 1? אז יש כמה גישות, הגישה הראשונה, ואלה המודים, מודי פעולה, זה איך ההצפנות השונות של הבלוקים השונים תלויים בהצפנות של בלוקים אחרים. אז הגישה הכי ליברלית והכי הצלנית אומרת, לא, הם לא קשורים. הם לא קשורים, הם לא קשורים. זאת אומרת, אם באיזשהו שלב, אם יש שני בלוקים זהים, שני בלוקי פליינטקסט זהים, אז גם הסייפר טקסטים זהים. כל אחד מוצפן באופן עצמאי, וזה השיטה הזאת, או המוד הזה, נקרא Electronic Codebook, בקיצור, ECB. היתרון זה עצמאות. קודם כל, אני יכול להצפין כל בלוק בנפרד, לא תלוי באחרים. אפשר לעשות את העצמאות במקביל, אוקיי? אף בלוק לא תלוי באחרים, אפשר לעשות את העצמאות במקביל ולעשות את זה יותר מהיר. ועוד יתרון זה שאם יש טעות באיזה בלוק, אז היא לא משפיעה על בלוקים אחרים.",
      "lang": "he",
      "type": "audio",
      "ref": "https://moodle.telhai.ac.il/mod/videostream/view.php?id=1165271"
    },
    {
      "offset_start": "0:06:47.640",
      "offset_end": "0:08:16.180",
      "text": "זאת אומרת, אם כשאני שולח את ה... או כשאני מקבל, אז יש טעות בבלוק פליין טקסט מסוים, או יש גייה בעצפנה, זה לא משפיע על הבלוקים האחרים. וכשאני אראה את המודים האחרים, להבין את זה. דני, יש לי שאלה. כן. ה-Blocking זה הכוונה למידע שהוא רציף, או שהוא, גם המידע עצמו הוא רציף? כי אז זה די מזכיר לי את זה שדיברנו בסופן הקודם, שאם אתה מגלה את המפתח, אז אתה יכול לבד את כל הקוד. כן, אז זה לא היה קשור באם זה היה רציף או לא, אבל בדוגמה שהבאתי של CSS, נכון? לזה אתה מדבר? על CSS? כן, על זה דיברתי, פשוט אמרתי, אם המידע רציף, אז זה ממש באופן ישיר אתה יכול לראות את זה. נכון, זה לא קשור, תראה, לשאלתך, המידע הוא לא רציף. יש לנו, תחשוב על קובץ, יש לך קובץ ואתה צריך להצפין אותו, הקובץ נתון, הוא לא הולך להתארך או להתקצר. יש לך עכשיו קובץ, אתה צריך להצפין אותו, אתה לוקח את הקובץ, מחלק אותו לבלוקים, מצפין כל בלוק בנפרד, מקבל בלוקי סייפר דקט, מצרף אותם, יש לך את הסייפר דקט. בסדר? כן. דני, בטעות, הכוונת טעות בשליחה? כאילו, למה שתהיה טעות בעצפנה עצמה?",
      "lang": "he",
      "type": "audio",
      "ref": "https://moodle.telhai.ac.il/mod/videostream/view.php?id=1165271"
    },
    {
      "offset_start": "0:08:18.560",
      "offset_end": "0:09:50.300",
      "text": "לא, יכולה להיות לך, קודם כל, יכולה להיות טעות, כן, טעות בשליחה, זאת אומרת, איזשהו ביט בדרך מתהפך, למשל. עכשיו, אם העצפנה של בלוקים תלויה בבלוקים קודמים, אז גם הפענוח של בלוקים תלוי בבלוקים קודמים, ואם איזשהו ביט יתהפך באיזשהו שלב, אז זה ישפיע גם על הפענוח של הבלוקים האחרים. אנחנו נראה דוגמה, אנחנו נבין את זה כשנראה את הבלוק השני. אבל בשיטה הזאת של האלקטרונית קוד בוט, כל בלוק מוצפן באופן עצמאי לא תלוי בבלוקים אחרים, וזה אומר שאם יש שני בלוקים, אם יש חזרות על מידע בפליין טקסט, החזרות האלה יבואו לידי ביטוי בסייפר טקסט. וכבר ראינו ודיברנו על זה שיש לזה חסרונות, זאת אומרת, זה אומר שבסייפר טקסט אנחנו נראה כל מיני פאטרנים. ואם יש פאטרנים בסייפר טקסט, והסייפר טקסט לא נראה לגמרי אקראי, אז אפשר לנצל אותם כדי לקבל מידע על הפליינטקסט. ולכן, אלקטרונית קוד בוק זה לא מוד פעולה שמומלץ לשימוש אלא אם כן, יש לכם כמה בלוקים בודדים ואז לא סביר גם שיהיו חזרות משמעותיות. אבל אם יש לכם משהו מאוד ארוך, בטח אם יש לכם תמונה שאתם רוצים להצפין, אז לא מומלץ להשתמש במוד הזה,",
      "lang": "he",
      "type": "audio",
      "ref": "https://moodle.telhai.ac.il/mod/videostream/view.php?id=1165271"
    },
    {
      "offset_start": "0:09:50.300",
      "offset_end": "0:11:26.120",
      "text": "ואנחנו גם נראה דוגמה בתרגול היום, איך באמת חזרות בפליין טקסט באות לידי ביטוי, בסייפר טקסט אם אנחנו משתמשים במוד הזה, כן? אז שוב, לסיכום, יש פה תמונה, יש לנו פליין טקסט, אני מכניס אותו לבלוק סייפר, מכניס מפתח, מקבל סייפר טקסט, כל אחד עובד באופן עצמאי בעצפנה, ולכן כל CBC, והוא מייצר איזושהי שרשרת שמגדירה תלות בין הבלוקים. יש פה תיאור של איך שזה עובד, אבל אני מעדיף להראות את זה בצורה גרפית. אז איך זה עובד? אז קודם כל שוב, יש לי את הפליין טקסט, אני מחלק אותו לבלוקים, הנה יש פה שלושה בלוקים, ועכשיו אני מתחיל כך, אני לוקח איזשהו וקטור אקראי, לא סודי, אינישל וקטור, זה נקרא IV בקיצור, ולפני שאני מצפין את הבלוק הראשון של הפליינטקס, אני עושה לוקסור עם האינישל וקטור. אז אני לוקח את הפליינטקס, עושה לוקסור עם איזה וקטור אקראי לא סודי, ואז מצפין את התוצאה, כמובן באמצעות המפתח, מקבל בלוק סייפרטקס. זה בבלוק הראשון. בבלוק הראשון זה נראה טיפשי, למה לקחת את הפליינטקסט ולעשות לו קסור עם איזשהו וקטור אקראי, שהוא לא סודי.",
      "lang": "he",
      "type": "audio",
      "ref": "https://moodle.telhai.ac.il/mod/videostream/view.php?id=1165271"
    },
    {
      "offset_start": "0:11:26.120",
      "offset_end": "0:12:50.000",
      "text": "אבל בבלוק השני זה מתבהר, כי כשאני לוקח את הפלט של הבלוק הראשון, את הסייפר טקסט של הבלוק הראשון, אני עושה לו קסור עם הבלוק פלנטקסט השני. זאת אומרת, אני לוקח את הבלוק פלנטקסט השני, עושה לו קסור עם הסייפר טקסט של הבלוק הראשון ואז מצפין, וכן הלאה. זאת אומרת כל פעם אני לוקח את הסייפר טקסט, גם מוציא אותו החוצה, אבל גם עושה לו קסור עם הפליינטקסט הבא. אם אני אחזור לתיאור המתמטי, אז אני לא מצפין את פי i, אני מצפין את פי i קסור עם c i מינוס 1. אוקיי? אבל כש-i שווה 1 אז אין לי i מינוס 1, אז אני צריך לעשות קסור עם איזשהו וקטור אקרי. אוקיי? עכשיו, אם אני רוצה לפענח את זה, תשימו לב, אני רוצה לפענח. אז עכשיו בואו נניח שאני רוצה לפענח את בלוק בוא נניח שאני רוצה לפענח את ה... בלוק סייפר טקסט הראשון, בהנחה שיש לי את המפתח. אז אין בעיה, אני מפענח, מקבל פה משהו, עושה לו XOR עם ה-IV, מקבל את הפליינטקסט. אם אני רוצה לפענח את הבלוק סייפר טקסט השני, אני מפענח באמצעות המפתח, עושה לו XOR עם הסייפר טקסט הראשון, מקבל את הפליינטקסט. הנה יש פה תיאור גרפי של איך זה עובד, אוקיי?",
      "lang": "he",
      "type": "audio",
      "ref": "https://moodle.telhai.ac.il/mod/videostream/view.php?id=1165271"
    },
    {
      "offset_start": "0:12:51.000",
      "offset_end": "0:14:32.520",
      "text": "אז כדי לפענח את הבלוק הראשון, אני מפענח, עושה לו כסור עם ה-IV, מקבל את הפליינטקסט. כדי לפענח את השני, אני מפענח, עושה לו כסור עם הסייפר טקסט הקודם, קבל את הפליינטקסט. ובאופן כללי, כדי לפענח בלוק, כן, אני קודם כל מפענח אותו, הנה, קודם כל מפענח אותו, באמצעות המפתח, עושה לו כסור עם הסייפר טקסט הקודם, קואו נסתכל רגע על הפענוח. נניח שבדרך, מאיזושהי סיבה בתקשורת, הבלוק סייפר טקסט הראשון יתחלף בו איזשהו ביט, אוקיי? איזשהו ביט יתחלף בו, אז קודם כל זה ישפיע כמובן על מה שנקבל ב-plainט פה, אבל זה גם ישפיע על מה שנקבל כאן. אתם רואים? זה ישפיע על התוצאה. זאת אומרת, אם יש גיות איפשהו, אז הן משפיעות לא רק על הבלוק הספציפי, אלא גם על הבלוקים הבאים. אז זה חיסרון. לא חיסרון מאוד גדול, כן? אבל זה חיסרון. יש לזה יתרון מאוד גדול, זה שאם יש חזרות בפליין טקסט, הן לא מתורגמות לחזרות בסייפר טקסט, כן? בואו נלך פה רגע אחורה. בואו נניח שבלוק 1 ובלוק 3 הם זהים, אוקיי? אז לבלוק 1 אני עוסק, סור סור עם ה-IV, מקבל משהו. לבלוק 3 אני עוסק סור עם משהו אחר, ולכן הסייפרטקס ייראה אחר.",
      "lang": "he",
      "type": "audio",
      "ref": "https://moodle.telhai.ac.il/mod/videostream/view.php?id=1165271"
    },
    {
      "offset_start": "0:14:33.940",
      "offset_end": "0:15:52.900",
      "text": "באופן מהותי, באופן שונה, לא רק באיזה ביט אחד, יכול... חצי מהביטים יכולים להיות שונים. בסדר? זה ברור? אני לא שומע אתכם. כן, כן. אוקיי. כן, זה ברור. אוקיי, עכשיו, שאלת שאלה רגע, למה אתה לא, למה אתה אומר שהinitial vector לא צריך להיות סודי, נכון? זה מה שאמרת, אינישל וקטור לא צריך להיות סודי. אוקיי, בואו נניח שהוא סודי. אז עכשיו יש לי בעיה, אני צריך, אוקיי, להעביר אותו באופן סודי, כמו שאני מעביר את המפתח. נניח, בסדר. אבל זה לא משנה, כי בפעם הבאה, בבלוק הבא, אני יודע בדיוק עם מי הפליין טקסט, בואו נניח שאני מאזין בקו, ויש לי את כל הסייפרטקסט, אז יש לי את הבלוקים של הסייפרטקסט. אז אני יודע שכשעצפינו את הבלוק השני, עשו לו כסור עם הסייפרטקסט הראשון. ואני יודע מי זה הסייפרטקסט הראשון, אי אפשר להסתיר את זה ממני, כי זאת המהות של סייפרטקסט, שהוא גלוי לכולם. אז זה שיסתירו לי תייניס של וקטור של הפליינטקסט הראשון, זה לא היה עזור הרבה, בגלל שאחר כך ממילא אנחנו מכירים את ה-ciphertextים, כן?",
      "lang": "he",
      "type": "audio",
      "ref": "https://moodle.telhai.ac.il/mod/videostream/view.php?id=1165271"
    },
    {
      "offset_start": "0:15:52.900",
      "offset_end": "0:17:41.500",
      "text": "המאזין מכיר את ה-ciphertextים והוא יודע עם מי נעסק סור. זאת אומרת, זה לא באמת חשוב להסתיר את ה-initial vector, הוא לא צריך להיות צודי, הוא פשוט אקראי. אז אם יש את ה-ciphertext, זה אומר שאני יכול לפרוץ את זה? לא, זה בדיוק הרעיון, בשביל זה אנחנו מצפינים, כדי שמי שמאזין, כל מה שיהיה לו זה ה-סט, והוא לא יוכל לפרוץ. אז כל המהות של צופן זה שגם אם יש למישהו את הסייפר טקסט, כן? וזה מה שיהיה, בדרך כלל, הסייפר טקסט עדיין, אם אין לך את המפתח, אתה לא יכול לפרוץ. אלא אם כן זה צופן גר בשימוש, אפשר לקרוא עליהם פה, וכתוב פה שזה לא בחומר, אני רוצה לעבור למוד האחרון, למוד נוסף, אוקיי? המוד הזה הוא, אפשר לומר, נהנה מכל העולמות. זה נקרא Counter Mode, CTR, והוא עובד כך. ותכף הוא יזכיר לכם, תראו, אני לוקח IV כמו קודם, אבל אני לא עושה לוקסורים מפלנטקס, אני פשוט מצפין את ה-IV, את ה-Initial Vector. אני מצפין את ה-Initial Vector, אוקיי? מצפנו את המפתח, מקבל משהו, ואז עושה לזה XOR עם ה-Plain Text וקבל סייפר טקסט. עכשיו ה-Initial Vector זה מספר, כן? אז אני מוסיף לו אחד, ושוב עושה XOR, מצפין את מה שאני מקבל,",
      "lang": "he",
      "type": "audio",
      "ref": "https://moodle.telhai.ac.il/mod/videostream/view.php?id=1165271"
    },
    {
      "offset_start": "0:17:41.500",
      "offset_end": "0:19:22.500",
      "text": "עושה לזה XOR עם ה-Block השני ו מקבל את הסייפר פקס השני. ובאופן כללי, כן? אם אני רוצה להצפין את הבלוק מספר i, אז זה הקאונטר, זה ה-initial vector פלוס i, כן? initial vector פלוס i או פלוס i מינוס 1, אוקיי? פלוס i מינוס 1. עושה לו קסור,פין אותו, ואז לתוצאה עושה קסור עם הפליינטקסט. עכשיו, מה יש לנו כאן? מה יש לנו כאן? שימו לב מה קורה לפליינטקסט. הפליינטקסט בכלל לא עובר בתוך פונקציית ההצפנה. הפליינטקסט, רק עושים לו קסור עם משהו. איפה ראינו את זה של הפליינטקסט רק עושים קסור עם משהו? בסטרים סייפר. נכון. מה? בסטרים סייפר, כן? בצופן זרם. זה מה שעושים בצופן זרם. מייצרים PRG, ואז עושים לזה קסור עם הפליינטקסט. זאת אומרת, הפליינטקסט בכלל לא עובר עצפנה, הוא רק עובר קסור. אז מה יש לנו כאן, עוד פעם? יש לי initial vector, יש לי מפתח, אני משתמש במפתח הזה בכל אחד מהבלוקים, להצפין את כל אחד מהבלוקים, אבל מה שאני מצפין זה בסך הכל איזשהו משהו ידוע מראש, כלומר, העני של וקטור, שאמרתי, הוא לא סודי, גם כאן הוא לא סודי, להוסיף לו כל פעם אחד, כן, פלוס אחד, פלוס אחד, פלוס אחד, פלוס אחד, זה עדיין לא סודי, כמובן,",
      "lang": "he",
      "type": "audio",
      "ref": "https://moodle.telhai.ac.il/mod/videostream/view.php?id=1165271"
    },
    {
      "offset_start": "0:19:22.660",
      "offset_end": "0:20:54.500",
      "text": "ואת זה אני מצפין, זאת אומרת, אני מצפין משהו שהוא בכלל לא סודי. אבל באמצעות מפתח סודי. מה הכוונה להצפין אלוהים כסור? כאילו, מה ההבדל בין עצפנה לכסור? כסור זה כסור, אוקיי? עצפנה, יש פה פונקציית עצפנה, כרגע זה קופסה שחורה, אנחנו לא יודעים מה זה. אבל זה איזושהי פונקציה, שהיא לא רק קסור, כן? אנחנו תכף נראה דוגמה לאלגוריתם עצפנה, ותראו שיש שם עוד דברים חוץ מקסור, אוקיי? אז בצוף וזרם, כל מה שעושים לפליין טקסט זה קסור. וגם כאן, במוד פעולה הזה, יש לנו פונקציית עצפנה, אבל לפליין טקסט רק עושים קסור. אז בעצם מה שיש לנו כאן זה צופן זרם. כי יש לנו איזשהו קאונטר, מייצרים איזשהו בלוק בעזרת הקאונטר והמפתח, מייצרים איזשהו בלוק, עושים לו קסור עם פי אחד, זה מאוד מזכיר את סלסה, אתם זוכרים מה היה לנו בסלסה? היה לנו בלוק בגודל 64 בייט, כן, היה לנו בלוק 5, איך הוא נוצר? הוא נוצר מאיזה חלקים ממנו היו ידועים לכולם, היה שם נונס שאמרנו שהוא לא סודי, והיה שם גם המפתח, והיה שם גם קאונטר, היה שם... מספר הבלוק גם היה חלק מזה.",
      "lang": "he",
      "type": "audio",
      "ref": "https://moodle.telhai.ac.il/mod/videostream/view.php?id=1165271"
    },
    {
      "offset_start": "0:20:54.500",
      "offset_end": "0:22:28.360",
      "text": "ואז לקחנו את הבלוק הזה, שהיה בו גם קאונטר, והיה בו גם מפתח, והיו בו עוד כמה דברים שהם לא סודיים, והפעלנו עליו איזושהי פונקציה מאוד מסובכת, וקיבלנו את ה-block PRG, ואז כמובן לזה עשינו קסור עם ה-plain text. אז ה-counter mode הזה מאוד מאוד מזכיר את הסלסה, וזה אותו סוג של פעולה. רק שבסלסה, אמרתי לכם בדיוק מה זה הסלסה, יש שם איזו פונקציה שעושים אותה 10 פעמים, וכל פעם עושים את אותו דבר, אבל פעם זה על העמודות, פעם זה על השורות, לא משנה, יש שם פעולות אלמנטריות על ביטים, וגם כאן יש לנו איזושהי פונקציה, וכמו שאנחנו נראה, גם הפונקציות האלה, זה מה שיש בהן. יש בהן פעולות אלמנטריות על ביטים, יש בהן איזה משהו שחוזר על עצמו כמה פעמים, אוקיי? אז זה הקאונטר מוד. שהוא בעצם לוקח... דני, מה שאנחנו מצפינים... כן, אני מקשיב. אני רציתי לשאול אם מה שאנחנו מצפינים פה בעצם זה את המפתח שאיתו אנחנו מצפינים כל בלוק? לא, המפתח הוא מפתח, הוא חלק מהפונקציה. אנחנו מצפינים את הקאונטר, וקאונטר ועוד אחד, וקאונטר ועוד שתיים, וכן הלאה. המפתח הוא חלק מהפונקציה. הוא אחד הקלטים של הפונקציה.",
      "lang": "he",
      "type": "audio",
      "ref": "https://moodle.telhai.ac.il/mod/videostream/view.php?id=1165271"
    },
    {
      "offset_start": "0:22:30.480",
      "offset_end": "0:24:11.800",
      "text": "ויש לנו פה פונקציית עצפנה, שאנחנו בחלק השני היום, אנחנו נראה אלגוריתם אחד כזה. איך זה עובד? כן, אז מה היתרונות של הקלטים? אבל הפורט, הוא לא צריך לגלות את המפתח במקרה הזה, זה נראה כאילו שאני לא מבין מה המשמעות של ספרנק, כי נראה שהפורץ, מספיק שהוא מגלה את הפלט של E, זה לא אכפת לו בכלל מה המפתח ומה הוקטור. נכון, אבל איך הפורץ ידע את הפלט של E? הוא לא ידע, זה בדיוק... הפורץ לא יודע מה הפלט של E. זאת אומרת, כל מה שהפורץ רואה... כל מה שהפורץ רואה זה את ה-C. פורץ רואה את ה-C זה כסור בין מה שהוא לבין הפליינטקסט. זה כמו ב-PRG, מה רואה הפורץ? הוא רואה סייפר טקסט, הוא יודע שהסייפר טקסט זה כסור של הפליינטקסט עם משהו, אבל הוא לא יודע מה זה המשהו הזה. בשביל לדעת מה זה המשהו הזה, הוא צריך לדעת מה המפתח. אוקיי? אוקיי? אוקיי, בזמן. בסדר? כן, אז כמו שאמרתי, זה... עכשיו, יש פה יתרונות. קודם כל, כל בלוק מוצפן בנפרד, כן? אין תלות בין ההצפנות של הבלוקים השונים, ולכן אפשר להצפין בצורה מקבילית. עוד יתרון זה שמכיוון שהפליינטקס עוד קובע קסור, אני אפילו לא צריך פליינטקס,",
      "lang": "he",
      "type": "audio",
      "ref": "https://moodle.telhai.ac.il/mod/videostream/view.php?id=1165271"
    },
    {
      "offset_start": "0:24:11.800",
      "offset_end": "0:25:54.580",
      "text": "אני יכול את הפעולה הזאת של להכין את המכרוזת, שיטה, כן, את ה-PRG, בעצם יש לי פה PRG, אני יכול לעשות לפני שאפילו יש לי פליינטקס, להתחיל לעשות את זה, בגלל שכן, זאת הפעולה שלוקחת יותר זמן, קסור לוקח מעט מאוד זמן. אז הקאונטר מוד הוא מוד מאוד טוב, כן? אבל זה מוזר, כי אתם רואים, אני לא באמת מצפין את הפליינטקסט, אבל זה בסדר, אנחנו מכירים את הקונספט הזה מצופני זרם? בצופני זרם אנחנו לא מצפינים את הפליינטקסט, זאת אומרת, אנחנו לא עושים שום פונקציה לפליינטקסט חוץ מאשר כסור עם משהו. אני גם לא הבנתי, אני גם חשבתי שקסור זה העצפנה. קסור זאת, כן, ברור, קסור זאת העצפנה, אבל קסור זה קסור, אוקיי, זאת פעולת העצפנה מאוד פשוטה, נגיד כך. הפונקציה הזאת, כן, כמו גם הפונקציה בסלסה, היא פונקציה מסובכת, זאת הפונקציה, אוקיי, זאת בעצם ההצפנה האמיתית, אתה יודע. זה הפעולה. וזה מביא אותי לתרגול של השבוע שעבר. בתרגול של השבוע שעבר היה לנו משהו מוזר, אני גם שמתי לכם סרטון הסברה על זה, אחרי זה עליתי על זה. כלומר, היה לנו שלוש שיטות, היה לנו סלסה והיה לנו עוד שיטת PRG, ש... מה זה היה? זה היה שיטה של...",
      "lang": "he",
      "type": "audio",
      "ref": "https://moodle.telhai.ac.il/mod/videostream/view.php?id=1165271"
    },
    {
      "offset_start": "0:25:59.960",
      "offset_end": "0:26:58.080",
      "text": "דופליקייטד? של נו, ליניאר קונגווינס. נכון, וליניאר קונגווינס, יש שם פעולה יותר מסובכת, ומשום מה יצא לנו שהיא דווקא הכי מהירה. למה יצא לנו הכי מהירה? כי אני רק מדדתי את הזמן שלוקח לפונקציה אינקריפט לעבוד. אבל הפונקציה אינקריפט, כל מה שעושה זה קסור. כדי לראות באמת כמה זמן לוקח, הייתי צריך לקלול במדידת הזמן גם את הקונסטרקטור, והקונסטרקטור הוא זה שבנה את המפתח. והבנייה של המפתח היא הפעולה שלוקחת הרבה זמן. אז אם אני עכשיו מודד את הזמן גם של הקונסטרקטור פלוס האנקריפט, אז באמת אפשר לראות שהליניאר קונגוריינס לוקח לו פי 200 יותר זמן מאשר לסלסה או ל-OTP. אוקיי? אז אני שמתי על זה הערה, תסתכלו, שמתי על זה סרטון בשבוע שעבר.",
      "lang": "he",
      "type": "audio",
      "ref": "https://moodle.telhai.ac.il/mod/videostream/view.php?id=1165271"
    },
    {
      "offset_start": "0:00:00.520",
      "offset_end": "0:01:49.300",
      "text": "שלום לכולם, זה השיעור, נדמה לי, השישי, הסמסטר. אנחנו נדבר היום על הצפנה בשיטת מפתח פומבי. בשיעור שעבר למדנו, סקרתי כמה תוצאות, כמה עובדות בסיסיות מתורת המספרים, ולימדתי על מבחנים לבדיקת ראשוניות, מבחנים סטטיסטיים, או מבחנים הסתברותיים לבדיקת ראשוניות. ראינו שני מבחנים, מילר רבין ולמן. כשמילר רבין הוא האלגוריתם המועדף על כולם, לא בגלל שהוא יותר יעיל או יותר מהיר, אלא בגלל שהתוצאה שלו יותר מדויקת. זאת אומרת, יכולים להיות מקרים בודדים, כן, עם הסתברות נמוכה אמנם, אבל מקרים בודדים שבהם אלגוריתם למן יגיד שהמספר הוא ראשוני, ומילר רבין יגיד שהמספר פריק, ואז כמובן זה אומר שאלגוריתם למן טועה. ויש דוגמה גם בשקפים, יש עוד כמה שקפים שלא עברתי עליהם במצגת ההיא, אבל אני מעדיף להמשיך הלאה ופשוט סימנתי אותם כחומר רשות לצורך הסמסטר הזה. והתקנתי את המצגת בנודל. אוקיי, אז אנחנו עכשיו נעבור לנושא הבא, וזה הנושא של... רגע, שנייה. זה הנושא של אלגוריתמים, או שיטת מפתח פומבי, או קריפטוגרפיה של מפתח פומבי. אוקיי, אז בואו נעבור למצגת. אוקיי.",
      "lang": "he",
      "type": "audio",
      "ref": "https://moodle.telhai.ac.il/mod/videostream/view.php?id=1173980"
    },
    {
      "offset_start": "0:01:49.300",
      "offset_end": "0:03:37.800",
      "text": "טוב, אז מה זה אומר קריפטוגרפיה של מפתח פ ביניהם בצורה מאובטחת. אין להם, הערוץ שלהם הוא לא בטוח, אבל הם רוצים להתכתב בצורה מאובטחת. אז לבוב יש איזה מסר שרוצה לשלוח לאליס, הוא מצפין אותו באמצעות אחד האלגוריתמים שלמדנו, דה, זה יהיה, זה סלסה, לא יודע מה, הוא מצפין את זה, כמובן הוא צריך מפתח בשביל זה, שולח את זה לאליס, זה הופך, אחרי ההצפנה זה הופך לבלתי מובן, אליס מקבלת את זה, מפענה אחת, ויכולה לקרוא את מה שבוב כתב. הבעיה היא שאליס ובוב לא יכולים להעביר ביניהם את מפתח העצפנה. זאת אומרת, איך אליס ובוב, כן? איך אליס ובוב בשלב מוקדם יסכימו על מפתח העצפנה, אם הערוץ שלהם הוא לא בטוח, ואם הם לא יכולים להיפגש פיזית. אז זאת הבעיה, זאת בעיה שכבר היו מודעים עליה לא מהיום, אלא לפני 50-60 שנה כבר היו מודעים עליה, וזאת הבעיה של העברת המפתחות, כן? איך מעבירים מפתח הצפנה? אז פתרון שהיה קיים כבר אז, או כבר בתקופה שלפני המפתחות הבומביים, שנות ה-60-70. אוקיי, אליס ובוב ואנשים אחרים גם, רוצים להתכתב ביניהם, אז יש איזשהו מרכז שמרכז את כל ההתכתבויות, הוא מכיר את המפתחות של כולם.",
      "lang": "he",
      "type": "audio",
      "ref": "https://moodle.telhai.ac.il/mod/videostream/view.php?id=1173980"
    },
    {
      "offset_start": "0:03:37.800",
      "offset_end": "0:05:17.000",
      "text": "למשל, אם אני רוצה להצטרף, להיות מנוי במרכז, אז אני מצטרף כמנוי, הם שולחים אליי איזשהו נציג, נותנים לי מפתח, את המפתח שאיתו אני אמור להתכתב, ואז אם אליס רוצה לכתוב לבוב, אז היא מצפינה את הידיעה, ומיד אחר כך מצפין אותה באמצעות המפתח של בוב, ושולח לבוב את הידיעה שאליס כתבה, מוצפנת באמצעות המפתח של בוב, ובוב כמובן יכול לפענח את זה כי הוא יודע את המפתח של עצמו, כן? אז זו דרך שעובדת, הבעיה היא שמאוד מאוד מסורבלת, כי זה, תראו, יש פה חמישה שלבים, בכל שלב צריך לעשות איזשהו חישוב, איזה פעולת עצפנה או פענוח, זה יוצר עומס גדול על המרכז, בנוסף לזה, אם מישהו יפרוץ למרכז, הוא ידע את המפתחות של כולם, זאת בעיה... זאת בעיה... ונשארת הבעיה של... מה? אין מפתחות למרכז בצורה מצוינת. עוד פעם, לא הבנתי מה שאמרת. נשארת הבעיה של איך את מעביר את המפתח שלך למרכז. לא, אז איך אני מעביר למרכז? אז ברגע שאני מצטרף למרכז כמנוי, אז הם דואגים להעביר לי את המפתח בצורה מאובטחת. לא יודע, שולחים אליי שליח הביתה והוא מתקין את המפתח על המצפן שלי.",
      "lang": "he",
      "type": "audio",
      "ref": "https://moodle.telhai.ac.il/mod/videostream/view.php?id=1173980"
    },
    {
      "offset_start": "0:05:17.000",
      "offset_end": "0:06:51.200",
      "text": "אוקיי? אוקיי. כן, אז כן, זה מסובל, אוקיי? זה אם אתם, למשל, אם אתם משווים את מה שקורה היום בוואטסאפ, שאני יכול היום להתכתב בוואטסאפ עם מישהו שאני לא מכיר ולא פגשתי קודם, ומיד להתחיל להתכתב איתו בצורה מאותחת, בלי שאף אחד ירכז לי את זה, אז כן, יש פרוטאליפט מאוד מסורבל. אז בחור בשם וילדפילדיפי, כבר היה מודע לזה בתחילת שנות ה-70, הוא היה דוקטורנט במדעי המחשב נדמה לי, ב-MIT או ב-Harvard, לא בטוח, והיה לו רעיון, והוא שית שגם אם אני יודע להצפין, אני לא יודע לפענח. זאת אומרת, אם בוב רוצה לשלוח לאליס איזו שיהיה ידיעה מוצפנת, אם בוב רוצה לשלוח לאליס איזו שיהיה ידיעה מוצפנת, הוא מצפין את המסמך על ידי זה שהוא יוצר איזושהי בעיה מתמטית שרק אליס יודעת לפתור. גם בו בעצמו אחרי שהוא הצפין הוא לא יודע לפה הנח, אבל הוא יודע את הידיעה, כן? הוא שולח את הידיעה, הוא מצפין אותה על ידי זה שהוא יוצר בעיה מתמטית שרק אליס יודעת לפתור. רק לאליס יש את המידע הרלוונטית שמאפשר לפתור את הבעיה בקלות, כן? או בסיבוכיות נמוכה.",
      "lang": "he",
      "type": "audio",
      "ref": "https://moodle.telhai.ac.il/mod/videostream/view.php?id=1173980"
    },
    {
      "offset_start": "0:06:51.200",
      "offset_end": "0:08:31.000",
      "text": "כמובן שכל מי שמאזין יכול אולי לפרוץ או לפתור את הבעיה, אבל בסיבוכיות מאוד גבוהה, כך שזה לא מטריד אותה. אוקיי, אז זה היה רעיון בסיסי, זה רעיון שלא היה לוויטפילדיפי,, לא היה לו פתרון לזה, זאת אומרת, לא היה לו רעיון איך בדיוק לממש את זה, היה לו איזה רעיון תיאורטי, רעיון אבסטרקטי, הוא לא היה לו, דיפי, מרקל והלמן, יהיה פה עוד שיטה שהוצאה על ידי מרקל כמה זמן לפני דיפי, אבל אני אדלה להגיע אליה, כי לא, שיטה מאוד מוצלחת. בסופו של דבר הוא שיתף ברעיון שלו חוקר אחר בשם הלמן, שישב בסטנפורד, ברחוב המערבי של ארה״ב, והרעיון שלהם הוא היה כזה, יש לנו איזשהו אלגוריתם עצפנה, אוקיי? לאלגוריתם עצפנה, לכל משתמש שמשתמש באלגוריתם עצפנה, יש שני מפתחות. מפתח אחד הוא מפתח פומבי, או�תח ציבורי שכולם מכירים והוא משמש לעצפנה, ומפתח שני שהוא מפתח פרטי, סודי, שמשמש לפי הנוח. זאת אומרת, אם בוב רוצה שיתכתבו איתו, הוא יוצר שני מפתחות, אחד פומבי, שהוא יכול להפיץ לכולם, וכל אחד יכול לכתוב, להצפין משהו בשביל בו, ויש לו מפתח סודי שמשמש לפי הנוח ורק בו מכיר.",
      "lang": "he",
      "type": "audio",
      "ref": "https://moodle.telhai.ac.il/mod/videostream/view.php?id=1173980"
    },
    {
      "offset_start": "0:08:32.000",
      "offset_end": "0:09:46.500",
      "text": "אוקיי? והאלגוריתם העצבנה הוא כזה, כן? הוא כזה מתוחכם שהוא יכול לעבוד עם שני מפתחות, ויותר מזה, מי שיודע את המפתח הפומבי זה לא מאפשר לו עדיין לגלות את המפתח הסודי. עכשיו, זה רעיון שלא היה ידוע קודם, וגם כשהם הציעו את זה דיפי ואלמן, לא היה להם פתרון לאיך בדיוק ליצור צופן כזה, כי תחשבו על דז או על AES, AES לא היה קיים אז, אבל דז היה קיים אז, כן? או כל שיטה של פי-אר-ג'י. אם אני יודע את המפתח של העצפנה, אני יודע גם את המפתח של הפי הנוח, כן? אותו מפתח שמשמש לעצפנה בדז משמש גם לפי הנוח. אותו מפתח שמשמש לעצפנה ב, אני יודע, צופן קיסר, הוא משמש גם לפי הנוח, כן? אז עם סימן מינוס. כל... אותו מפתח שמשמש לעצפנה בצופן קיסר, הוא משמש גם לפי הנוח, כן? אז עם סימן מינוס. כל, אותו מפתח שמשמש לאצפנה בצופן הצוואר, כן? הצופן של איזושהי תמורה, זה אותה תמורה. לפי הנוח צריך את התמורה ההפוכה, אוקיי? אז אם יודעים את מפתח האצפנה, יודעים גם את מפתח הפי הנוח. אז היה להם פה רעיון מהפכני של אפשרות של צופן, שגם אם יודעים את מפתח העצפנה, לא יודעים את מפתח הפיענוח.",
      "lang": "he",
      "type": "audio",
      "ref": "https://moodle.telhai.ac.il/mod/videostream/view.php?id=1173980"
    },
    {
      "offset_start": "0:09:46.500",
      "offset_end": "0:11:03.000",
      "text": "אז אם אליס ובוב רוצים להתכתב, אין בעיה. אליס, לאליס יש את מפתח העצפנה של בוב, היא מעצפינה באמצעות המפתח העצפנה של בוב, שולחת לו ידיעה מוצפנת, ובוב יכול לפענח כי יש לו את מפתח הפענוח, ורק לא יש אותו. כן? אז ידיעת המפתח ה-public, ה-use-a-me-public, לא מורידה את הסיבוכיות של גילוי מפתח הפענוח. מפתח הפענוח, שזה המפתח הסודי, או private, כן? זה r של private. אוקיי? אז זה הרעיון שלהם, אבל לא היה להם רעיון מעשי איך לממש את זה. כן, הנה פה נמצאים השלושה, בתקופה שהם עבדו על הרעיון שלהם. אז דיפי היה, כמו שאמרתי, הראשון שחשב על השימוש בבעיה כזאת, בעיה קשה, בעיית רפדור, כן? בעיית רפדור זה בעיה שרק עם איזשהו מידע סודי אפשר לפתור אותה. הם ביחד פיתחו את רעיון באוניברסיטת סטנפורד, והרעיון של שני המפתחות, הם פרסמו אותו עוד לפני שהיה להם איזשהו מימוש ספציפי, איזשהו צופן ספציפי שעומד בקריטריונים, והשאלה הייתה, האם יש דבר כזה?",
      "lang": "he",
      "type": "audio",
      "ref": "https://moodle.telhai.ac.il/mod/videostream/view.php?id=1173980"
    },
    {
      "offset_start": "0:11:03.320",
      "offset_end": "0:13:04.800",
      "text": "כן? כי זה נראה אנטי-אינטואיטיבי. אם אני יודע את מפתח העצפנה, בהכרח אני צריך לדעת את מפתח הפענוח. אם אני יודע את פונקציית העצפנה, אז אני יודע את פונקצייתיבסט, שמיר ועדלמן בשנת 1977, כן, הם שלושתם חברו יחד בזמן ששמוים עדי שמיר מעיד על זה שהוא, הם יצאו, הם הלכו להסכי, והוא ככה, תוך כדי זה שהוא גלץ במדרון, צץ הרעיון במוחו, ועד שהוא הגיע לתחתית המדרון הוא שכח את הרעיון, אבלון, ‫אבל בסופו של דבר הם עלו ‫על רעיון מאוד פשוט, שאני... ‫שזה הרעיון של ה-RSA, ‫זה השתיבות של השמות שלהם. ‫ואז הרעיון הראשון לסכמת כזאת ‫של מפתח קומביט הייתה ה-RSA נמצא בשימוש עד היום, בהמשך הציעו סכמות אחרות, סכמת אל גמל, סכמה של רבין, וסכמה שמבוססת על הקום אליפטי, שגם אותה אני אלמד בקורס הזה. אז עכשיו, איך הם עלו על רעיון? כן? איך הם עלו על רעיון? אז הם התבססו על המחשבה של דיפי. דיפי אמר, אנחנו צריכים איזושהי בעיה מתמטית קשה, שהיא קשה, שאם איזשהו מידע אפשר לפתור אותה. אם איזשהו מידע נוסף, שזה מפתח העצפנה, סליחה, מפתח הפענוח, אפשר לפתור אותה. זאת אומרת, יש לנו בעיה קשה שמאפשרת לעצפין,",
      "lang": "he",
      "type": "audio",
      "ref": "https://moodle.telhai.ac.il/mod/videostream/view.php?id=1173980"
    },
    {
      "offset_start": "0:13:06.040",
      "offset_end": "0:14:34.200",
      "text": "אבל כדי לפענח, אני צריך עוד איזשהו מידע על הבעיה הזאת, אוקיי? אז הם חיפשו, הם הלכו וחיפשו בעיות קשות במתמטיקה, שאיזשהו מידע עשוי לאפשר לפתור אותה, והיו שלושה סוגים של בעיות, בעיית התרמיל הגב, הנאפסק, שאתם אמורים להכיר אותה מקורס ואלגוריתמים, בעיית הפירוק ובעיית הלוגריתם הדיסקרט. בעיית הנפסק, היא הייתה בעיה טובה, ביססו עליה כמה צופנים, אלא שבמהלך שנות ה-80 וה-90, פרצו את כל הצופנים האלה, מנצו דרך לפרוץ את הצופנים האלה, כך שבעיית תרמיל הגב היא לא רלוונטית היום לצופני מפתח פומבי. ועכשיו נדבר על בעיית הפירוק, אוקיי? אז בעיית הפירוק, מי שחשב עליה לראשונה היה דונלד קנוף, אחד האבות המייסדים של מדעי המחשב. הוא אמר ככה, בעיית הפירוק היא, באופן כללי בעיית הפירוק היא, יש לכם מספר שלם גדול, כן? מספר שלם חיובי מאוד גדול, פרקו אותו לגורמים, זאת בעיית הפירוק. אוקיי? איך אני מפרק אותו לגורמים? מתחיל לנסות לחלק אותו במספרים, כמו שאנחנו יודעים מקורס ועוד במבוא למדעי המחשב, ואחר כך גם ציינתי את זה בקורס הזה. אני צריך לחלק אותו במספרים, אני צריך לפחות להגיע, אני צריך להגיע עד לשורש n כדי למצוא,",
      "lang": "he",
      "type": "audio",
      "ref": "https://moodle.telhai.ac.il/mod/videostream/view.php?id=1173980"
    },
    {
      "offset_start": "0:14:34.200",
      "offset_end": "0:15:49.500",
      "text": "לפעמים אני צריך להגיע עד לשורש n כדי למצוא לו את הגורמים. אם יש לי מזל, יש לו גורמים קטנים, ואז אני יכול להתחיל לפרק, אבל באופן כללי אני צריך להגיע עד לשורש n. אבל אם n הוא מספר מאוד מאוד גדול, אז גם שורש n הוא מספר מאוד מאוד גדול. אז זאת בעיית הפירוק באופן כללי, ספציפית לנושא שלנו, יש לנו מספר n, שהוא מכפלה של שני מספרים ראשונים מאוד גדולים. שכמובן לא יודעים אותם, והבעיה היא למצוא אותם, כן? הבעיה היא למצוא את p ו q. איך אני עושה את זה? אז כמו שאמרתי, אני צריך להתחיל לנסות לחלק את n במספרים, אבל... יש יותר מדי מספרים כאלה אם n הוא מאוד גדול, אז זה לא יהיה מעשי לעשות את זה, אוקיי? אז צופנים שמבוססים על בעיית הפירוק, זה צופן rsa, צופן רבין, שאותו אני לא אזכור כאן, אני מדבר על צופן RSA, אלה בעצם שני הצופנים המרכזיים שמבוססים על בעיית הפירוק. בעיה אחרת, די דומה, אפשר לומר, לא בדיוק, אבל כשנראית הצופנים נראה שהיא דומה, בעיית הלוגריתם הדיסקרטית. מה זה בעיית הלוגריתם הדיסקרטית? נתון מספר ראשוני q, ויש לי איזה מספרים שלמים a וy.",
      "lang": "he",
      "type": "audio",
      "ref": "https://moodle.telhai.ac.il/mod/videostream/view.php?id=1173980"
    },
    {
      "offset_start": "0:15:49.500",
      "offset_end": "0:17:10.000",
      "text": "ואני יודע שקיים x, שאם אני מעלה את a בחזקת x, אני אקבל את y. או אם אני עלה את a בחזקת x מודול או q, אני אקבל את y. אוקיי? יש לי פה משוואה a ו-y ו-q. a ו-y ו-q הם ידועים, אוקיי? והבעיה היא למצוא את x. זאת בעיית הלוגריתם הדיסקרטי. למה בעיית הלוגריתם הדיסקרטי? כי לוגריתם זה חזקה, אז צריך למצוא את x, כן? אם אני אעשה... אם זה לא היה מודולו, הייתי יכול להוציא לוג משני אגפים ולגלות את x, נכון? אם זה היה מספרים ממשיים, אם לא היה לי פה את מוד q, אם זה היה במספרים ממשיים, הייתי בחזקת x שווה ל-y, אז זה לא בעיה לגלות את x, אני מחשבת ללוג של שני הצדדים ואני מוצא את x. אבל מה שעושה את זה לבעיה קשה, זה שהמשוואה הז היא מודולו-Q, ולכן זה נקרא דיסקרטי, בגלל שזה מספרים בדידים, זה מספרים שלמים בדידים, זה בעיה סופית, מודולו-Q זה אומר שיש לנו בעיה בין מספרים סופיים. ואז למעשה כמעט אין לי ברירה, אם אני רוצה למצוא את x, להתחיל לחשב את a בחזקת מספרים שונים עד שאני אקבל את y, אבל מכיוון ש-Q מאוד גדול, אז גם מספר האפל את y, אבל מכיוון ש-q הוא מאוד גדול, אז גם מספר האפשרויות שאני צריך לנסות הוא מאוד גדול.",
      "lang": "he",
      "type": "audio",
      "ref": "https://moodle.telhai.ac.il/mod/videostream/view.php?id=1173980"
    },
    {
      "offset_start": "0:17:11.400",
      "offset_end": "0:18:23.600",
      "text": "אוקיי? אז זאת הבעיה השנייה, בעיית הלוגריתם הדיסקרטי, ומי שמתבסס עליה זה צופן אל-גמל, שציינתי, הזכרתי אותו קודם, אנחנו לא נלמד עליו כאן, אבל אנחנו נלמד על צופן הקומו-אליפטי שמבוסס על סכמה של אלגמל. אז בסופו של דבר אנחנו כן נדע מה הרעיון של אלגמל. אוקיי, אז אלה שתי הבעיות. הבעיות האלה היו ידועות לריבסט, שמיר ועדלמן, אבל הם לא ידעו איך לקחת את הבעיות האלה ולעשות מזה צופן. זה שיש לנו בעיה שקשה לפתור, זה עדיין לא מא�ה ולעשות מזה צופן. זה שיש לנו בעיה שקשה לפתור, זה עדיין לא מאפשר לי לבנות צופן. יש הרבה בעיות שקשה לפתור, אתם מכירים מלא בעיות שקשה לפתור אותן, בעיית הסוכן הנושא, למשל, כן? בעיה שקשה לפתור אותה, עבור עניים גדולים. אבל עדיין זה לא אומר שיש לי רעיון איך לבסס על זה צופן. אוקיי? אז זה האתגר שעמד בפניהם ובפני אנשים אחרים שחשבו על זה באותה זמן. כדי להבין את הבעיה ואת הפתרון, אז אנחנו צריכים לחשוב, לדעת מה זה פונקציה חד-כיוונית. פונקציה חד-כיוונית זה פונקציה F, שקל לחשב אותה.",
      "lang": "he",
      "type": "audio",
      "ref": "https://moodle.telhai.ac.il/mod/videostream/view.php?id=1173980"
    },
    {
      "offset_start": "0:18:29.280",
      "offset_end": "0:20:03.800",
      "text": "אבל גם אם אני יודע לחשב את הפונקציה F, אני לא יודע לחשב את הפונקציה ההופכית. זאת אומרת, למצוא את הפונקציה ההופכית, קשה, זה קשה. גם אם אני יודע את הפונקציה f, קשה לי לחשב את הפונקציה ההופכית. למשל, למשל, כן? אם אני אחזור לשקף הקודם, קל לי להעלות את a בחזקת x ולקבל את y, אבל מ-y לקבל את a בלי שאני אדע את x זה קשה. אוקיי? אוקיי, אז זאת פונקציה חד-כיוונית, פונקציה חד-כיוונית עם טראפדור או עם דלת סודית זה פונקציה ש... נכון, קשה לחשב את F מינוס אחד, אבל אם יהיה לי עוד איזשהו מידע, איזושהי פית, שקל לחשב אותה, אבל כדי לחשב את פונקציית הפרי הנוח, שהיא הפונקציה הופכית, זה קשה, אלא אם כן, יש לנו עוד פיסת מידע, שזה בדיוק המפתח הסודי. אוקיי? אז היום יש הרבה פונקציות שנחשבות לחד-כיווניות, וצופנים רבים מבוססות עליהן, אבל אף אחד מהם לא הוכח באופן מתמטי שהם... זה בעצם פי שווה ל-NP, לא? זה לא פי שווה ל-NP, לא, זה לא פי שווה ל-NP. כי זה לא... זה לא בעיות שהן בהכרח NP. או, כן, שהן בהכרח NP.",
      "lang": "he",
      "type": "audio",
      "ref": "https://moodle.telhai.ac.il/mod/videostream/view.php?id=1173980"
    },
    {
      "offset_start": "0:20:18.500",
      "offset_end": "0:21:44.600",
      "text": "זה... כל פונקציה כזאת שידועה היום, יש מצב שיש לה פתרון בלי שפי שווה ל-np. אוקיי? יכול להיות, מישהו יחשוב, הוא חשב כבר בעבר, אבל לא גילה את זה, זה מתמטיקאי מאוד מאוד חכם, שחשב על פתרון איך לפתור אותם, אבל הוא עדיין לא פרסם את זה. או שעוד לא חשבו על זה, אבל יש פתרון כזה, וזה עדיין לא אומר שp שווה ל-np, במקרה הזה. אוקיי? בדוגמה, זאת הפונקציה שעליה מבוסס RSA, אז כמו שאמרתי, n הוא מכפלה של שני מספרים ראשוניים, יש לי פונקציה מ-z n ל-z n, זאת אומרת, בין שעריות מודולו n, יש לי מספר b שהוא זר לפי של n, זוכרים מי זה פי של n? פי של n זה כמה מספרים קטנים מ-n שזרים לו. אוקיי? בין 1 ל-n מינוס 1 שזרים לו, זה פי של n. אז יש לי מספר b שזר לפי של n, והפונקציה היא, בואו נחשב את x בחזקת b מודולו n, זאת פונקציה חד-כיוונית. אוקיי? זאת פונקציה חד-כיוונית, כל אחד יכול לעשות את זה, כל מי שיודע את b ואת n יכול לעשות את זה, אבל זה עדיין לא מאפשר לדעת את הפונקציה ההופכית. בשביל לדעת את הפונקציה ההופכית, אנחנו צריכים מידע נוסף, תכף נדבר על זה כשנדבר על rsn.",
      "lang": "he",
      "type": "audio",
      "ref": "https://moodle.telhai.ac.il/mod/videostream/view.php?id=1173980"
    },
    {
      "offset_start": "0:21:44.600",
      "offset_end": "0:23:14.000",
      "text": "פונקציה הופכית, אנחנו צריכים מידע נוסף, תכף נדבר על זה כשנדבר על RSA. פונקציה אחרת, פונקציה, זאת אומרת, אם אני אחזור רגע חזרה, נניח שיש לי את x בחזקת b מוד n, ואני רוצה לגלות את x, זה קשה, אוקיי? זה קשה. פונקציה שמבוססת על הלוגריתם הדיסקרטי, תשימו לב, זו פונקציה מאוד דומה לפונקציה שראינו בשקף הקודם. בשקף הקודם ה-X הוא בבסיס החזקה, בשקף הזה X הוא במעריך החזקה. אז עכשיו יש לי לא n שהוא מכפלה של שני ראשונים, יש לי q שהוא מספר ראשוני, יש לי מספר a שזר ל-q, והפונקציה היא, כן? איך אני מפעיל את הפונקציה על x? מעלה את A בחזקת X. אוקיי? אז הפונקציה של X, כן, היא להעלות את A, שידוע לכולם, בחזקת X. אוקיי? נניח שיש לי את A בחזקת X ואני יודע את Q, לגלות מזה את X זה יהיה קשה. אז זו פונקציה גם כן חד-כיוון. אז זה הרעיון בצופנים פומביים, לקחת, לגלות איזושהי פונקציה שהיא חד-כיוונית, ועם דלת צודית. זאת אומרת, שאם יש עוד איזשהו מידע נוסף, אפשר לפתור, כן לגלות את הפונקציה ההופכית, אוקיי? וזה מה שאנחנו יכולים... ואיך אני אמור להעביר את המידע הנוסף?",
      "lang": "he",
      "type": "audio",
      "ref": "https://moodle.telhai.ac.il/mod/videostream/view.php?id=1173980"
    },
    {
      "offset_start": "0:23:16.000",
      "offset_end": "0:24:40.160",
      "text": "אוקיי, שאלה טובה, איך אתה אמור להעביר את ה... אתה לא מעביר את המידע הנוסף, המידע הנוסף נמצא אצל מי שאמור לפענח, הוא לא מעביר אותו לאף אחד. הוא כן מעביר לכולם את הפונקציה, את הפונקציה F הוא מפרסם לכולם. אבל הוא לא מפרסם לכולם את המידע הנוסף. אז זה יוצר מצב שכולם יכולים להשתמש בפונקציה F, זאת אומרת, כולם יכולים להצפין, כי הפונקציה F היא פונקציית העצפנה. אבל רק לי יש את המידע הנוסף כדי לפענח את זה. אני לא מעביר את המדע הזה לאף אחד. זה ברור הרעיון? כאילו אני אומר לכולם איך להצפין בשביל לשלוח לי, ורק אני אוכל לפענח? בדיוק. כן. אני יוצר פונקציה F, שהיא פונקציה חד-כיוונית עם טרפדור, אני מפרסם לכולם את הפונקציה החד-כיוונית, אבל אני לא מפרסם את הטרפדור. את הטרפדור אני שומר אצלי. אגב, זה מה ש... מה פה המידע הנוסף שעוזר לפתור את הפונקציה הזו? אנחנו נראה בדוגמאות, אבל יש עוד מידע נוסף שעוזר לפתור את זה. כן? אבל אני רוצה להגיד, אם אתם זוכרים את הסיפור על הצופן דז, שאמרתי, צופן דז בסופו של דבר הוא אמנם מוצב על ידי IBM, אבל בעצה אחת, ותוך כדי זה תהליך פיתוח ביחד עם ה-NSA.",
      "lang": "he",
      "type": "audio",
      "ref": "https://moodle.telhai.ac.il/mod/videostream/view.php?id=1173980"
    },
    {
      "offset_start": "0:24:40.160",
      "offset_end": "0:26:07.440",
      "text": "ותיאוריות הקונספירציה אומרות, כן, הם פרסמו לנו פונקציית חד-כיוונית, שזה פונקציית העצפנה, אבל להם יש טראפטור, הם חשבו על איזשהו טראפטור ושומרים אותו אצלם, כך שהם יוכלו ליירט כל ידיעה, לפענח כל ידיעה, שמישהו אי פעם יצפין בדז. זאת הייתה תיאוריות הקונספירציה. כנראה שהיא לא הייתה נכונה, אוקיי? כנראה שהיא לא הייתה נכונה, אבל זה היה החשד. אבל בצופן קומבי... זה מבוסס? כאילו יש... כן? אני שואל אם ההשערה הזאת, הקונספירציה הזאת היא מבוססת? כאילו גם שירו מה הטרפדו או שסתם אמרו אולי יש טרפדו? לא שירו, לא היו השערות, היו כל מיני התחלות של דיונים, הסתכלו על האסבוקסס, ועשו כל מיני חישובים, ועשו כל מיני סטטיסטיקות על האסבוקסס, אבל לא הגיעו לשום דבר מעשי. אבל פה זה רשמי, פה אנחנו אומרים כן, זאת פונקציית טרפדור, יש פה טרפדור, אני שומר לעצמי את התפתחות. זאת אומרת, כל מה שמישהו יצפין בשבילי, אני אדע לפענח. אני לא אדע לפענח מה שמישהו יצפין בשביל מישהו אחר, כי שם זה טרפדור אחר, ורק לא יש אותו. אוקיי? אז זה הרעיון. עוד דעה קטנה, אפשר לחשוב על זה בעצם כמו שתי מפתחות, אז זה בעצם מנעול ומפתח.",
      "lang": "he",
      "type": "audio",
      "ref": "https://moodle.telhai.ac.il/mod/videostream/view.php?id=1173980"
    },
    {
      "offset_start": "0:26:07.440",
      "offset_end": "0:26:57.000",
      "text": "כאילו הציבורי יאומין, מנעול, קחו, תנהלו את הדברים, ואני, יש לי את המפתח למנעול. זה משהו כזה בעצם. כן, זה רעיון, זה דימוי, זה אנלוגיה מאוד טובה. זאת אומרת, כל אחד, תחשבו על מנעול קפיצי, כן? לא מנעול רגיל, מנול קפיצי. אתם מכירים את המנולים הקפיציים, שכל אחד יכול ללחוץ ולנעול את המחלול, נו אבל עכשיו אני צריך מפתח בשביל לפתוח אותו. אוקיי? אז זה דימוי מאוד טוב, כן. אוקיי. דני, אנחנו נעשה היום הפסקה? אפשר לעשות עכשיו הפסקה של חמש דקות, אתה יודע מה רוצים? כן? כן, אולי... אז בוא נגיד עד אחד וחמישה, בסדר? הזמן שלי מידוד, בסדר? אז עד אחד וחמישה. סגור, תודה.",
      "lang": "he",
      "type": "audio",
      "ref": "https://moodle.telhai.ac.il/mod/videostream/view.php?id=1173980"
    }
  ],
  "done_files": [
    "photos.google.comshareAF1QipMdzNUoZi6u47DCo9m8T1GKIgoLntNoD44EtTCrjDLVHq3w6AsRVSlZhoqLtLinhQphotoAF1QipPi8RO_Ivrit.json",
    "dani_1a_Ivrit.json",
    "dani_1b_Ivrit.json",
    "dani_2a_Ivrit.json",
    "dani_3b_Ivrit.json",
    "dani_6a_Ivrit.json"
  ]
}